{
    "2": {
        "id": "2",
        "name": "Baked Shrimp Scampi",
        "source": "Ina Garten: Barefoot Contessa Back to Basics",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 6,
        "comments": "Modified by reducing butter and salt.  Substituted frozen shrimp instead of fresh 12-15 count (butterflied, tails on).",
        "calories": 2565,
        "fat": 159,
        "satfat": 67,
        "carbs": 76,
        "fiber": 4,
        "sugar": 6,
        "protein": 200,
        "instructions": "Preheat the oven to 425 degrees F.\r\n\r\nDefrost shrimp by putting in cold water, drain. Place the shrimp in serving dish (9x13 or 2 quart casserole) and toss gently with the olive oil, wine, 1 teaspoons salt, and 1 teaspoon pepper. Allow to sit at room temperature while you make the butter and garlic mixture.\r\n\r\nIn a small bowl, mash the softened butter with the garlic, shallots, parsley, rosemary, red pepper flakes, lemon zest, lemon juice, egg yolk, panko, 1\/2 teaspoon salt, and 1\/4 teaspoon of pepper until combined.\r\n\r\nSpread the butter mixture evenly over the shrimp. Bake for 10 to 12 minutes until hot and bubbly. If you like the top browned, place under a broiler for 1-3 minutes (keep an eye on it). Serve with lemon wedges and French bread.\r\n\r\nNote: if using fresh shrimp, arrange for presentation. Starting from the outer edge of a 14-inch oval gratin dish, arrange the shrimp in a single layer cut side down with the tails curling up and towards the center of the dish. Pour the remaining marinade over the shrimp. ",
        "ingredients": [
            "2\/3 cup panko\r",
            "1\/4 teaspoon red pepper flakes\r",
            "1\/2 lemon, zested and juiced\r",
            "1 extra-large egg yolk\r",
            "1 teaspoon rosemary, minced\r",
            "3 tablespoon parsley, minced\r",
            "4 clove garlic, minced\r",
            "1\/4 cup shallots, minced\r",
            "8 tablespoon unsalted butter, at room temperature\r",
            "2 tablespoon dry white wine\r",
            "Freshly ground black pepper\r",
            "Kosher salt\r",
            "3 tablespoon olive oil\r",
            "2 pound frozen shrimp"
        ],
        "tags": [
            "seafood",
            "shrimp",
            "main"
        ]
    },
    "4": {
        "id": "4",
        "name": "Strawberries Romanov (La Madeleine copycat)",
        "source": "http:\/\/cookeatshare.com\/recipes\/la-madeleine-s-strawberries-romanov-318025",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Wash strawberries and cut the tops off. Let strawberries drain.  Mix together heavy whipping cream, powdered sugar, and the brandy. Beat with a mixer till this becomes thick.  Place strawberries into glasses and spoon over the sauce.\r\n",
        "ingredients": [
            "2 tbsp powdered sugar\r",
            "1\/2 pt heavy whipping cream\r",
            "1 lb strawberries, (2 pints)\r",
            "4 tbsp brandy"
        ],
        "tags": [
            "fruit",
            "dessert",
            "strawberries",
            "copycat",
            "untried"
        ]
    },
    "5": {
        "id": "5",
        "name": "Tomato Basil Soup (La Madeleine copycat)",
        "source": "http:\/\/cookeatshare.com\/recipes\/la-madeleine-s-tomato-basil-soup-318026",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Combine tomatoes, juice\/and or possibly stock in saucepan. Simmer 30 min. Puree, along with the basil leaves, in small batches, in blender or food processor or use an immersion blender in the pan.\r\n\r\nReturn to saucepan and add in cream and butter, while stirring over low heat. Garnish with basil leaves and serve with your favorite bread.",
        "ingredients": [
            "4 c tomatoes, minced, peeled, and cored\r",
            "4 cup vegetable stock\r",
            "12 basil leaves\r",
            "1 c heavy cream\r",
            "1\/4 lb unsalted butter\r",
            "Salt\r",
            "1\/4 tsp black pepper"
        ],
        "tags": [
            "soup",
            "tomatoes",
            "copycat",
            "main"
        ]
    },
    "7": {
        "id": "7",
        "name": "John Thorne's Pecan Pie",
        "source": "http:\/\/chowhound.chow.com\/topics\/281175#1495442",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 12,
        "comments": "Does not use corn syrup",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat oven to 350F. In a large saucepan, heat the brown sugar, golden syrup and butter to the boiling point. Stirring constantly and scraping back any foam that clings to the side of the pan, let this mixture boil for about 1 minute. Remove from the heat and let cool while, in a separate bowl, you beat the eggs until creamy. \r\n\r\nWhen the boiled syrup has cooled, beat in the eggs, salt and pecans. Pour into the unbaked pie shell and bake for about 50 minutes.\r\n\r\nNotes:\r\n\r\n* A little cream (about 1\/4 to 1\/2 cup) mixed into a pecan pie filling before baking gives it a richer, lighter texture. \r\n\r\n* For a sweeter, lighter pie: add more sugar and use fewer pecans; for a denser, less sweet pie: add more pecans and use less sugar. \r\n\r\n* The buttery flavour and the lard-induced flakiness of a butter and lard crust make it the perfect one for a perfect pecan pie. And a Southern pecan pie authority I know suggests that you roll out the dough a little thicker than usual; a thick, richly shortened crust provides an appetizing balance to the sweetness of the filling. ",
        "ingredients": [
            "1\/4 tsp salt \r",
            "3 eggs \r",
            "4 tbsp butter \r",
            "2 tbsp dark rum \r",
            "2\/3 cup golden syrup \r",
            "1 cup dark brown sugar, well-packed\r",
            "2 cup pecans, chopped \r",
            "9-inch unbaked pie shell"
        ],
        "tags": [
            "dessert",
            "pie",
            "untried"
        ]
    },
    "8": {
        "id": "8",
        "name": "Smoked Salmon Ebelskivers",
        "source": "Ebelskivers by Kevin Crafts",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 1080,
        "servings": 3,
        "comments": "If dill is not available, add 1 tsp of Old Bay seasoning to the batter in place of the salt and pepper.",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat oven to 200F.\r\n\r\nIn a large bowl, whisk together the flour, sugar, baking powder, salt, and pepper. In a small bowl, lightly whisk the egg yolks, then whisk in the milk, 2 tablespoons of melted butter and lemon juice. Add the yolk mixture to the flour mixture and, using a wooden spoon, stir until well blended. The batter will be lumpy.\r\n\r\nIn a clean bowl, using an electric mixer on high speed, beat the egg whites until stiff, but not dry, peaks form. Using a silicone spatula, fold about one-third of the egg whites into the batter to lighten it, then fold in the rest just until no white streaks remain. Stir in fresh dill.\r\n\r\nBrush the wells of the ebelskiver pan with some of the remaining melted butter and place over medium heat. When the butter starts to bubble, add about 1 tablespoon batter to each well. Working quickly, carefully spoon about 1\/2 teaspoon of the smoked salmon into the center of each pancake, then spoon about 1\/2 teaspoon of the cream cheese on top. Top each with another 1 tablespoon batter. (Alternatively, gently mix the cream cheese and salmon together. Spoon about 1 teaspoon into the center of each pancake)\r\n\r\nCook until the bottoms of the pancakes are lightly browned and crisp, 3-5 minutes. Use 2 short wooden skewers to turn all the  pancakes and cook until lightly browned on the second side, about 3 minutes longer.\r\n\r\nTransfer the finished pancakes to a platter and keep warm  in the oven while you repeat to make 2 more batches. Serve right away.",
        "ingredients": [
            "1 cup all-purpose flour\r",
            "1 1\/2 tsp sugar\r",
            "1\/2 tsp baking powder\r",
            "1\/4 tsp salt\r",
            "1\/2 tsp pepper, freshly ground\r",
            "2 large eggs, separated\r",
            "1 cup milk\r",
            "3 tbsp unsalted butter, melted and slightly cooled, divided use\r",
            "1 tsp fresh lemon juice\r",
            "1\/4 cup fresh dill, chopped and firmly packed\r",
            "3 1\/2 tbsp smoked salmon, minced (about 4 oz)\r",
            "3 1\/2 tbsp whipped-style cream cheese, at room temperature\r",
            "2 servings [cocktail sauce](http:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=id50)"
        ],
        "tags": [
            "salmon",
            "ebelskivers",
            "main"
        ]
    },
    "9": {
        "id": "9",
        "name": "Godiva Angel Pie",
        "source": "everyrecipe.com",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 12,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "TO MAKE SHELL: Preheat oven to 300 degrees. In mixer bowl, beat egg whites until foamy. Beat in salt and cream of tartar and beat until soft peaks form. Add sugar, a tablespoon at a time, beating after each addition. Continue until very stiff peaks form. Fold in nuts and vanilla. Lightly butter a metal 8-inch pie plate. (Do NOT use glass.) Spoon meringue into pan lightly, building up the edges to come at least 1\/2 inch above the side of the pan. Bake in preheated 300 degree oven for 35 to 40 minutes until light brown. Cool completely before adding filling. TO MAKE FILLING: Melt chocolate and water in a pan over hot, but not boiling, water, stirring occasionally, to blend. Add vanilla and chocolate mixture (cooled) to whipped cream and pile into meringue shell, swirling top with spatula. Be sure to cool the chocolate mixture before adding to the whipped cream. If it is too warm, the mixture will thin out. If this happens, chill until it is thick enough to put in shell.",
        "ingredients": [
            "4 (1 oz.) squares Godiva cooking chocolate or 4 oz. Baker's German sweet chocolate\r",
            "1\/2 tsp vanilla\r",
            "1 cup pecans, finely chopped\r",
            "1\/2 cup sugar\r",
            "1\/8 tsp cream of tartar\r",
            "1\/8 tsp salt\r",
            "2 egg whites, at room temperature\r",
            "3 tbsp water\r",
            "1 tsp vanilla\r",
            "1 cup heavy cream, whipped"
        ],
        "tags": [
            "chocolate",
            "dessert",
            "pie",
            "untried"
        ]
    },
    "10": {
        "id": "10",
        "name": "Spaetzle",
        "source": "foodnetwork.com",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "Dough recipe from Emeril, sauce recipe from Guy Fieri",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Bring a saucepan of salted water it a boil, reduce the heat, and maintain a simmer. In a bowl, stir all the ingredients together (eggs, flour, milk, salt, baking powder, and nutmeg). Place a colander over the pan, pour about1\/4 of the batter into the colander, and press through the holes with a plastic spatula into the hot water. When the spatzle starts to float to the surface, cover the pan and keep covered until the spatzle appears to swell and is fluffy. Remove the dumplings and repeat the procedure with the remaining batter.\r\n\r\nIn a medium saute pan, add butter, and melt over medium heat until butter turns a light brown. Add garlic and cook until it becomes lightly colored. Add spaetzle to the pan to heat through. Add parsley, cheese, salt and pepper, to taste.",
        "ingredients": [
            "2 teaspoon fresh parsley, chopped\r",
            "1 teaspoon garlic, minced\r",
            "3 tablespoon butter\r",
            "1 pinch nutmeg\r",
            "1\/4 teaspoon baking powder\r",
            "1 teaspoon salt\r",
            "1\/2 cup milk\r",
            "1 1\/2 cup flour, sifted\r",
            "2 eggs, slightly beaten\r",
            "2 tablespoon finely grated Parmesan, plus extra for garnish\r",
            "Salt and freshly ground black pepper"
        ],
        "tags": [
            "german",
            "noodles",
            "sides"
        ]
    },
    "11": {
        "id": "11",
        "name": "Pot Roast Carbonnade",
        "source": "Melissa D'Arabian, FoodNetwork",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "I like to serve this over mashed potatoes.",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat the oven to 325 degrees F.\r\n\r\nIn a large Dutch oven over medium-low heat, add the bacon and cook until it renders its fat and almost becomes crispy. Remove it with a slotted spoon to a plate. Add the onions, season with salt and pepper, to taste, and cook over low heat until they are deep in color and caramelized, about 30 minutes.\r\n\r\nRemove the onions to a plate, leaving as much fat in the pot as possible. Add the vegetable oil and mix it with the bacon fat. Raise the heat to high. Season the beef liberally with salt and pepper and sear, in batches, until nicely browned on both sides.\r\n\r\nOnce the meat is browned, add the first batch of meat back to the pan along with the onions, carrots and bacon. Sprinkle in the flour and stir. Cook for 1 minute before deglazing the pan with the beer. Add the remaining ingredients and bring the mixture to a simmer. Cover the pot and put it in the oven to braise until the beef is tender, about 2 hours. Remove the pot from the oven and transfer the pot roast to a serving dish.",
        "ingredients": [
            "1\/2 pound bacon, cut into large lardons\r",
            "2 medium onions, sliced\r",
            "Kosher salt and freshly ground black pepper\r",
            "1 tablespoon vegetable oil\r",
            "1 1\/2 pound beef chuck, cut into large cubes\r",
            "5 carrots, peeled and cut into large chunks\r",
            "1 tablespoon all-purpose flour\r",
            "12 ounce beer (dark or light)\r",
            "6 prunes\r",
            "1 tablespoon dried thyme\r",
            "1 cup beef stock"
        ],
        "tags": [
            "beef",
            "main"
        ]
    },
    "12": {
        "id": "12",
        "name": "Old Fashion Vegetable Soup",
        "source": "Lee Ann Foulger",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 6,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a large soup pot, brown ground beef and onion, drain off fat.  Add remaining ingredients EXCEPT for last 3 items (canned vegetables).  Simmer on low heat until vegetables are tender, about an hour.  Add canned vegetables and simmer 5 minutes.  Remove bay leaf and serve.",
        "ingredients": [
            "1 pound ground beef\r",
            "1 cup onion, chopped\r",
            "1 cup potatoes, diced\r",
            "1 cup carrots, sliced\r",
            "1 cup celery, diced\r",
            "2 16oz can diced tomatoes in juice (or substitute 2 small cans of tomato sauce)\r",
            "4 cup water\r",
            "1\/4 tsp dried basil, crushed\r",
            "1\/4 tsp dried thyme\r",
            "1 bay leaf\r",
            "1\/2 tsp salt\r",
            "1\/4 tsp pepper\r",
            "1\/2 tsp garlic powder\r",
            "2 tablespoon beef bouillon\r",
            "1 16oz can corn\r",
            "1 16oz can green beans\r",
            "1 16oz can green peas"
        ],
        "tags": [
            "soup",
            "beef",
            "family_recipes",
            "main"
        ]
    },
    "13": {
        "id": "13",
        "name": "Onion Pie",
        "source": "Houston Chronicle 1\/18\/2006",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 6,
        "comments": "only 4 cups onions? Needs more crust - try 1.25 cups cracker crumbs? Experiment with red pepper - try 1\/4tsp.",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat the oven to 400 degrees halfway through onion cooking.\r\n\r\nSlice the onions and saute in 4 tablespoons butter over medium-low heat; the longer you cook them - as long as 35 minutes - the sweeter they will be.  Sprinkle in crushed red pepper.\r\n\r\nMelt the remaining 4 tablespoons butter.  Mix with the crushed crackers, then press the mixture into the bottom and sides of a glass pie plate to form a crust.  Prebake crust for 10 minutes.\r\n\r\nLightly beat the eggs and milk together in a small bowl.\r\n\r\nSpoon the onions into the crust, then pour the egg mixture over them.  Sprinkle with Parmesan.\r\n\r\nBake for 30-40 minutes until set and golden.",
        "ingredients": [
            "1\/2 cup grated Parmesan cheese\r",
            "1\/2 stack Keebler Club Crackers, crushed\r",
            "2 eggs\r",
            "1 cup milk\r",
            "1\/2 teaspoon crushed red pepper flakes, or to taste\r",
            "1\/2 cup butter, divided use\r",
            "3 large onions"
        ],
        "tags": [
            "onion",
            "casserole",
            "main",
            "vegetarian"
        ]
    },
    "14": {
        "id": "14",
        "name": "Godiva Dark Chocolate Cheesecake",
        "source": "Godiva.com, Chef Morgan Wilson",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 10,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a food processor with a blade attachment, cream the cheese until smooth and then add in sugar. Pulse a couple times to incorporate sugar and cocoa powder. Add in eggs and yolks pulsing a couple times again and scrape down to ensure all is smooth and uniform. With machine running, pour in melted Godiva Chocolate in a steady stream until all in, and finish by pulsing in the crème fraiche. Pour batter into a 10\" x 10\" baking pan and bake at 325 for 30, minutes or until custard is set and a toothpick inserted in center can be removed cleanly. The top may caramelize or brown slightly, which is not an issue. Once set, remove from oven and allow cheesecake to cool completely. Wrap the pan with plastic and reserve in cooler to set and chill completely.\r\n\r\nOnce the cheesecake is cold and firm, remove it from the pan and place in a mixer bowl with a paddle attachment. Beat the cake for a few moments to soften and smooth out the custard. Place smoothed custard into a piping bag with a plain tip and pipe into the bottom of a plastic lined half cylinder mold. Tap the mold to ensure the custard is solid and then flatten out to top. Freeze the mold to harden the custard for unmolding. Once the cake can be unmolded, remove from the pan and cut into 1½\" sections. Brush some tempered Godiva Dark Chocolate onto a strip of acetate and, while it is still fluid, smooth over the top of the molded cheesecake. Once the chocolate has cooled and completely crystallized, remove the acetate, revealing a shiny and textured chocolate finish.",
        "ingredients": [
            "2 1\/2 cup cream cheese, room temperature\r",
            "1\/2 cup sugar\r",
            "1 3\/4 tablespoon cocoa powder\r",
            "5 tablespoon Godiva 85% Dark Chocolate Callets\r",
            "2 eggs\r",
            "2 egg yolks\r",
            "1 3\/4 tablespoon crème faiche"
        ],
        "tags": [
            "cheesecake",
            "dessert",
            "pie",
            "chocolate",
            "untried"
        ]
    },
    "15": {
        "id": "15",
        "name": "Greek Salad",
        "source": "Food Network (two different recipes)",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "Dried oregano can also be substituted for the fresh in the salad mix.  Only use 1\/2-1 teaspoon of the dried.",
        "calories": 3057,
        "fat": 297,
        "satfat": 63,
        "carbs": 78,
        "fiber": 23,
        "sugar": 34,
        "protein": 42,
        "instructions": "In a small bowl, whisk together the lemon juice, garlic, salt, and oil. Set aside.   In a large bowl lightly toss the lettuce with the olives, cheese, cucumber, tomatoes, onion, oregano, and black pepper. Let sit up to 2 hours.  To serve, toss salad with dressing and place sliced chicken on top.",
        "ingredients": [
            "6 tablespoon lemon juice\r",
            "2 clove garlic, minced\r",
            "2 teaspoon kosher salt, plus more to taste\r",
            "1 cup extra-virgin olive oil, preferably Greek\r",
            "<hr>\r",
            "1 head romaine lettuce, trimmed of tough stems and torn into bite-sized pieces\r",
            "1 cup kalamata olives, about 6oz\/cup\r",
            "1\/2 pound Feta cheese, crumbled\r",
            "1 cucumber, trimmed, cut into 1 inch chunks\r",
            "1 1\/2 cup grape tomatoes, halved\r",
            "1 small red onion, cut into 1\/2-inch wedges, soaked in cold water for 5 minutes and drained\r",
            "2 teaspoon dried oregano\r",
            "Freshly ground black pepper"
        ],
        "tags": [
            "main",
            "greek",
            "salad",
            "dressing"
        ]
    },
    "16": {
        "id": "16",
        "name": "Flaky Buttermilk Biscuits",
        "source": "Cooks Illustrated (All-Time Best Recipes 2010)",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 12,
        "comments": "For soured milk, add 1 tbsp lemon juice or white vinegar to 1 cup milk",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Adjust oven rack to lower-middle position; heat oven to 450 degrees.  \r\n\r\nWhisk flour, baking power, baking soda, and salt in large bowl.\r\n\r\nAdd shortening to flour mixture; break up chunks with fingertips until only pea-sized pieces remain.  Working in batches, drop butter slices into flour mixture and toss to coat; pick up each slice of butter and press between floured fingertips into flat, nickel-sized pieces.  Repeat until all butter is incorporated; toss to combine.  Freeze mixture (in bowl) until chilled, about 15 minutes.\r\n\r\nSpray 24-square-inch work surface with nonstick cooking spray; spread spray evenly across surface with kitchen towel or paper towel.  Sprinkle 1\/3 cup of extra flour across sprayed area; gently spread flour across work surface with palm to form thin, even coating.  Add all but 2 tablespoons of buttermilk to flour mixture; stir briskly with fork until ball forms and no dry bits of flour are visible, adding remaining buttermilk as needed (dough will be sticky and shaggy but should clear sides of bowl).  With rubber spatula, transfer dough onto center of prepared work surface, dust surface lightly with flour, and, with floured hands, bring dough together into cohesive ball.\r\n\r\nPat dough into approximate 10-inch square; roll into 18- by 14-inch rectangle about 1\/4 inch thick, dusting dough and rolling pin with flour as needed.  Using bench scraper or thin metal spatula, fold dough into thirds, brushing any excess flour from surface; lift short end of dough and fold in thirds again to form approximate 6- by 4-inch rectangle.  Rotate dough 90 degrees, dusting work surface underneath with flour; roll and fold dough again, dusting with flour as needed.\r\n\r\nRoll dough into 10-inch square about 1\/2 inch thick; flip dough and cut nine 3-inch rounds with floured biscuit cutter, dipping cutter back into flour after each cut.  Carefully invert and transfer rounds to ungreased baking sheet, spaced 1 inch apart.  Gather dough scraps into ball; roll and fold once or twice until scraps form smooth dough.  Roll dough into 1\/2-inch-thick round; cut 3 more 3-inch rounds and transfer to baking sheet.  Discard excess dough.\r\n\r\nBrush biscuit tops with melted butter.  Bake, without opening oven door, until tops are golden brown and crisp, 15 to 17 minutes.  Let cool on baking sheet 5 to 10 minutes before serving.",
        "ingredients": [
            "8 tablespoon unsalted butter, cold, lightly floured and cut into 1\/8-inch slices\r",
            "2 tablespoon vegetable shortening, cut into 1\/2-inch chunks\r",
            "1 teaspoon salt\r",
            "1 tablespoon baking powder\r",
            "1\/2 teaspoon baking soda\r",
            "2 1\/2 cup unbleached all-purpose flour\r",
            "2 tablespoon butter, melted\r",
            "1 1\/4 cup buttermilk, cold"
        ],
        "tags": [
            "biscuits",
            "bread",
            "sides"
        ]
    },
    "17": {
        "id": "17",
        "name": "Grilled Portobello Mushrooms Stacked with Fresh Spinach and Shaved Manchego Cheese",
        "source": "http:\/\/www.foodnetwork.com\/recipes\/bobby-flay\/grilled-portobello-mushrooms-stacked-with-fresh-spinach-and-shaved-manchego-cheese-recipe\/index.html",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "May want to only do 8 if mushroom caps are large.",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Heat grill to high. Brush mushroom caps on both sides with oil and season with salt and pepper. Grill, cap side down, until slightly charred, about 4 to 5 minutes. Turn the mushrooms over and continue grilling until just cooked through, about 3 to 4 minutes longer.\r\n\r\nStack the ingredients on each of 4 salad plates starting with a mushroom cap, a slice of cheese, some spinach, and a drizzle of Sherry Vinaigrette. Add another mushroom cap, more vinaigrette, spinach, and another slice of cheese. Place a third mushroom cap on top and finish by drizzling with additional vinaigrette and garnishing with chopped chives, if desired.\r\n\r\n[Sherry Vinaigrette](http:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=18)",
        "ingredients": [
            "4 ounce manchego cheese, thinly sliced into 8 pieces\r",
            "3 cup baby spinach, washed and dried\r",
            "1 teaspoon freshly ground black pepper\r",
            "1 teaspoon kosher salt\r",
            "2 tablespoon olive oil\r",
            "12 portobello mushroom caps, wiped clean\r",
            "2 tablespoon fresh chives, finely chopped, for garnish, optional\r",
            "1 serving [Sherry Vinaigrette](http:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=18)"
        ],
        "tags": [
            "vegetarian",
            "main",
            "mushrooms",
            "cheese"
        ]
    },
    "18": {
        "id": "18",
        "name": "Sherry Vinaigrette",
        "source": "http:\/\/www.foodnetwork.com\/recipes\/bobby-flay\/grilled-portobello-mushrooms-stacked-with-fresh-spinach-and-shaved-manchego-cheese-recipe\/index.html",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 1,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Whisk together the shallot, vinegar, mustard, salt, and pepper in a small bowl. Slowly whisk in the oil until emulsified.",
        "ingredients": [
            "1 small shallot, finely chopped\r",
            "1\/4 cup sherry vinegar or balsamic vinegar\r",
            "2 teaspoon Dijon mustard\r",
            "1\/4 teaspoon kosher salt\r",
            "1\/4 teaspoon freshly ground black pepper\r",
            "1\/2 cup olive oil"
        ],
        "tags": [
            "dressing",
            "components"
        ]
    },
    "19": {
        "id": "19",
        "name": "Margherita Salad",
        "source": "Adapted from Food Network Magazine (Chicken Parmesan Salad)",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "I like to use home made bread crumbs instead of store bought.  They stay crispier on the salad.",
        "calories": 2883,
        "fat": 164,
        "satfat": 54,
        "carbs": 120,
        "fiber": 15,
        "sugar": 27,
        "protein": 227,
        "instructions": "Puree the plum tomato, sun-dried tomatoes, vinegar, garlic, oregano, a basil leaves and parmesan in a blender, drizzling in the sun-dried tomato oil until smooth. Add 2 to 3 tablespoons water, if needed to make a pour-able dressing; season with salt and pepper.\r\n\r\nHeat the olive oil in a large skillet over medium-high heat. Add the breadcrumbs, season with salt and pepper and cook, stirring occasionally, until golden, about 2 minutes. Add the remaining parmesan and the parsley and cook until toasted, about 1 more minute.\r\n\r\nToss the salad greens, mozzarella, and remaining basil in a large bowl. Toss with the dressing, then sprinkle with the breadcrumb mixture.",
        "ingredients": [
            "1 plum tomato, halved\r",
            "4 sun-dried tomatoes packed in oil\r",
            "2 tablespoon oil from the sun-dried tomato jar\r",
            "2 tablespoon red wine vinegar\r",
            "1 clove garlic\r",
            "1\/2 teaspoon dried oregano\r",
            "1\/4 bunch fresh basil, torn\r",
            "2 tbsp parmesan, grated\r",
            "Kosher salt and freshly ground pepper\r",
            "<hr>\r",
            "2 tablespoon extra-virgin olive oil\r",
            "1 cup breadcrumbs\r",
            "2 tablespoon chopped fresh parsley\r",
            "1\/4 cup parmesan, grated\r",
            "<hr>\r",
            "8 cup Italian-blend salad greens\r",
            "3\/4 bunch fresh basil, chiffonade\r",
            "8 ounce bocconcini (mozzarella), quartered"
        ],
        "tags": [
            "salad",
            "dressing",
            "main"
        ]
    },
    "21": {
        "id": "21",
        "name": "Mexican Ensalada",
        "source": "Yuri Elkaim",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 1335,
        "fat": 62,
        "satfat": 9,
        "carbs": 172,
        "fiber": 37,
        "sugar": 13,
        "protein": 35,
        "instructions": "In small bowl, whisk together dressing ingredients.\r\n\r\nChop up additional ingredients bite size and add to a medium bowl.\r\n\r\nCombine dressing and all ingredients in a large bowl, toss, and serve.\r\n\r\nIncludes recipe for [basil-lime vinaigrette](http:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=id6).\r\n\r\nAlternate dressing (for 2 servings):\r\n1\/2 lemon, juiced; 1 tbsp apple cider vinegar; 2 tbsp olive oil; 2 tablespoons cilantro, chopped",
        "ingredients": [
            "1 lime, zested and juiced\r",
            "1 tablespoon balsamic vinegar\r",
            "1\/4 cup basil leaves, chopped\r",
            "1\/2 teaspoon cumin\r",
            "2 tablespoon extra-virgin olive oil\r",
            "Kosher salt and freshly ground black pepper\r",
            "<hr>\r",
            "1\/2 cucumber, cubed\r",
            "1 avocado, cubed\r",
            "1 red bell pepper, cubed\r",
            "1\/2 cup black beans, rinsed and drained\r",
            "1 tomato, cubed\r",
            "1\/2 cup brown rice, cooked"
        ],
        "tags": [
            "salad",
            "mexican",
            "FUF",
            "main",
            "vegetarian"
        ]
    },
    "28": {
        "id": "28",
        "name": "Guacamole",
        "source": "Yuri Elkaim",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 8,
        "comments": "",
        "calories": 1552,
        "fat": 120,
        "satfat": 16,
        "carbs": 72,
        "fiber": 64,
        "sugar": 16,
        "protein": 24,
        "instructions": "1. Place all ingredients in a bowl with a flat bottom and mash it with a potato masher.  Alternatively, you can mix everything briefly in a food processor.\r\n2. Stir well and keep refrigerated. This dish will brown on the areas exposed to air within a few hours, so serve it shortly after making it or just stir again before serving.",
        "ingredients": [
            "4 ripe avocados\r",
            "2 roma tomates, diced fine\r",
            "1\/2 red onion, minced\r",
            "1\/2 handful cilantro, minced\r",
            "2 clove garlic, minced\r",
            "1 lime, juiced\r",
            "Pinch of sea salt\r",
            "1 jalapeno, seeded and minced fine (optional)"
        ],
        "tags": [
            "dip",
            "appetizer",
            "mexican",
            "FUF",
            "sides"
        ]
    },
    "30": {
        "id": "30",
        "name": "Sweet Almond Date Smoothie",
        "source": "Yuri Elkaim",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 716,
        "fat": 25,
        "satfat": 2,
        "carbs": 123,
        "fiber": 12,
        "sugar": 90,
        "protein": 9,
        "instructions": "Combine all ingredients in blender. Blend until smooth.",
        "ingredients": [
            "1 banana\r",
            "2 tbsp almond butter\r",
            "6 dates\r",
            "1 tsp maple syrup\r",
            "2 tsp cinnamon\r",
            "2 cup almond milk, or skim milk"
        ],
        "tags": [
            "smoothie",
            "FUF",
            "breakfast"
        ]
    },
    "32": {
        "id": "32",
        "name": "Super Protein Salad",
        "source": "Yuri Elkaim",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 1,
        "comments": "",
        "calories": 684,
        "fat": 35,
        "satfat": 5,
        "carbs": 73,
        "fiber": 20,
        "sugar": 13,
        "protein": 24,
        "instructions": "Combine olive oil, vinegar, mustard, salt and pepper to taste. Toss with other ingredients in a bowl and serve.",
        "ingredients": [
            "2 cup salad greens\r",
            "1\/4 cucumber, sliced\r",
            "1\/2 cup grape tomatoes\r",
            "1\/4 cup black beans, drained and rinsed\r",
            "1\/4 cup chickpeas, drained and rinsed\r",
            "1 tbsp pistachios\r",
            "2 tbsp dried cranberries\r",
            "<hr>\r",
            "salt and pepper, to taste\r",
            "2 tbsp olive oil\r",
            "1 tbsp red wine vinegar\r",
            "1 tsp Dijon mustard"
        ],
        "tags": [
            "salad",
            "beans",
            "FUF",
            "main"
        ]
    },
    "36": {
        "id": "36",
        "name": "The Shake",
        "source": "Yuri Elkaim",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 639,
        "fat": 22,
        "satfat": 4,
        "carbs": 81,
        "fiber": 18,
        "sugar": 46,
        "protein": 38,
        "instructions": "Combine all ingredients in blender. Blend until smooth.",
        "ingredients": [
            "1 scoop protein powder (optional)\r",
            "1 tbsp ground flax seeds\r",
            "2 tbsp hemp seeds\r",
            "2 tbsp peanut butter\r",
            "1 banana\r",
            "1 cup raspberries\r",
            "1 cup blueberries\r",
            "1 1\/2 cup milk"
        ],
        "tags": [
            "smoothie",
            "FUF",
            "breakfast"
        ]
    },
    "40": {
        "id": "40",
        "name": "Apple Carrot Salad",
        "source": "Yuri Elkaim",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "Great with pork!",
        "calories": 880,
        "fat": 74,
        "satfat": 9,
        "carbs": 32,
        "fiber": 8,
        "sugar": 19,
        "protein": 27,
        "instructions": "1. In small bowl, whisk olive oil, vinegar, and lemon juice.\r\n2. Combine salad ingredients in a medium bowl. Pour dressing over salad. Slice eggs and place on top.",
        "ingredients": [
            "1\/2 cup walnuts, chopped\r",
            "1 apple, chopped\r",
            "4 carrots, spiralized or grated in food processor\r",
            "1 tbsp apple cider vinegar\r",
            "2 tbsp olive oil\r",
            "1\/2 lemon, juiced\r",
            "salt and pepper, to taste\r",
            "2 eggs"
        ],
        "tags": [
            "raw",
            "salad",
            "FUF",
            "vegetarian",
            "main"
        ]
    },
    "42": {
        "id": "42",
        "name": "Extreme Green Salad",
        "source": "figandcherry.com",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "(formally \"Spinach and avocado salad with sesame wasabi dressing\")",
        "calories": 558,
        "fat": 44,
        "satfat": 6,
        "carbs": 40,
        "fiber": 0,
        "sugar": 0,
        "protein": 13,
        "instructions": "1. Place all the salad ingredients, except the sesame seeds, into a large bowl or platter.\r\n\r\n2. Whisk together all the dressing ingredients in a small bowl. Drizzle over the salad and toss lightly to coat.\r\n\r\n3. Sprinkle with sesame seeds and serve.",
        "ingredients": [
            "4 handful baby spinach leaves\r",
            "1 cup edamame\r",
            "1 large avocado, diced\r",
            "1\/2 cucumber, finely sliced into half moons\r",
            "3 tablespoon sesame seeds\r",
            "1\/2 lime (or orange if you prefer a sweeter dressing), juiced\r",
            "1\/2 teaspoon wasabi paste\r",
            "1 tablespoon soy sauce\r",
            "2 teaspoon sesame oil\r",
            "black pepper, to taste"
        ],
        "tags": [
            "salad",
            "asian",
            "vegetarian",
            "main"
        ]
    },
    "48": {
        "id": "48",
        "name": "Berry Sauce",
        "source": "Yuri Elkaim",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 300,
        "servings": 1,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Lightly warm berries and maple syrup in a saucepan\r\n2. Pour over pancakes\/dessert as desired",
        "ingredients": [
            "1\/2 cup mixed berries\r",
            "2 tbsp maple syrup"
        ],
        "tags": [
            "sauce",
            "components",
            "berries"
        ]
    },
    "51": {
        "id": "51",
        "name": "Popeye's Muscle Salad",
        "source": "Yuri Elkaim",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 1,
        "comments": "",
        "calories": 536,
        "fat": 46,
        "satfat": 7,
        "carbs": 31,
        "fiber": 9,
        "sugar": 17,
        "protein": 12,
        "instructions": "Combine all ingredients in a bowl, toss, and serve.\r\n\r\nUse whatever vinaigrette you want.",
        "ingredients": [
            "1 cup baby spinach\r",
            "1 cup salad greens\r",
            "1 carrots, shredded\r",
            "1\/2 avocado, diced\r",
            "1 hard boiled eggs, peeled and carefully sliced\r",
            "2 tbsp pecans, chopped\r",
            "2 tbsp dried cranberries\r",
            "<hr>\r",
            "1 1\/2 tbsp olive oil\r",
            "2 tsp vinegar\r",
            "1 tsp dijon mustard\r",
            "salt and pepper"
        ],
        "tags": [
            "salad",
            "FUF",
            "spinach",
            "main"
        ]
    },
    "54": {
        "id": "54",
        "name": "Breakfast Mediterranean Scramble",
        "source": "Rachel Atkins",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 1,
        "comments": "",
        "calories": 282,
        "fat": 18,
        "satfat": 6,
        "carbs": 13,
        "fiber": 4,
        "sugar": 5,
        "protein": 17,
        "instructions": "Heat oil in a small non-stick skillet. Once hot, add veggies and saute until soft. Meanwhile, beat greek seasoning and feta into eggs. Once veggies are at desired doneness, add egg mixture to skillet and gently stir until cooked. Serve immediately.",
        "ingredients": [
            "1 tsp olive oil\r",
            "1 cup chopped veggies, your choice\r",
            "2 eggs, lightly beaten\r",
            "1\/2 tsp greek seasoning\r",
            "1\/4 cup feta cheese"
        ],
        "tags": [
            "breakfast"
        ]
    },
    "55": {
        "id": "55",
        "name": "Best Oatmeal Ever",
        "source": "Yuri Elkaim",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 1,
        "comments": "",
        "calories": 376,
        "fat": 14,
        "satfat": 2,
        "carbs": 57,
        "fiber": 9,
        "sugar": 21,
        "protein": 11,
        "instructions": "1. To prepare, once oatmeal has been sufficiently cooked, add diced apples and nut butter. Stir for 2-3 minutes.\r\n2. Serve into a bowl and mix in cinnamon, flax seeds, maple syrup\/agave. Stir and enjoy!",
        "ingredients": [
            "1\/2 cup quick-cooking oats, cooked to your liking\r",
            "1\/2 apple, diced\r",
            "1\/2 tsp cinnamon\r",
            "1 tbsp maple syrup\r",
            "1 tbsp nut butter\r",
            "1 tbsp ground flax seed"
        ],
        "tags": [
            "breakfast"
        ]
    },
    "56": {
        "id": "56",
        "name": "Lovely Lentils",
        "source": "Yuri Elkaim",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Pour coconut oil and chopped garlic into a saucepan, over medium heat, and sauté the garlic until lightly browned.\r\n2. Add vegetable broth to the saucepan, allowing everything to simmer for about 5 minutes.\r\n3. Add 1 cup of water along with lentils and allow to simmer (uncovered) for about 20-30 minutes until they are soft. Add rosemary and drizzle olive oil near the end.",
        "ingredients": [
            "1 cup green lentils, rinsed\r",
            "2 clove garlic, minced\r",
            "500 ml vegetable broth\r",
            "250 ml water\r",
            "2 tbsp coconut oil\r",
            "1 tsp fresh or dried rosemary\r",
            "1 tbsp olive oil"
        ],
        "tags": [
            "lentils",
            "FUF",
            "sides"
        ]
    },
    "57": {
        "id": "57",
        "name": "Sweet Mashed Potatoes",
        "source": "Yuri Elkaim",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. In a pot that covers the potatoes with water, bring to a boil. The sweet potatoes are done when they are fork tender.\r\n2. Mash the potatoes with a hand mixer (or fork or masher) and slowly add in butter and milk until potatoes are creamy and mashed to your preferred consistency. Add a touch of cinnamon for added flavour.",
        "ingredients": [
            "2 large sweet potatoes, peeled and chopped\r",
            "1\/2 stick butter\r",
            "1 cup milk\r",
            "salt and pepper, to taste\r",
            "1 tsp cinnamon (optional)"
        ],
        "tags": [
            "potatoes",
            "FUF",
            "sides"
        ]
    },
    "61": {
        "id": "61",
        "name": "Steakhouse steaks",
        "source": "http:\/\/www.foodnetwork.com\/recipes\/ina-garten\/steakhouse-steaks-recipe\/index.html",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat the oven to 400 degrees F.\r\n\r\nHeat a large, well-seasoned cast iron skillet over high heat until very hot, 5 to 7 minutes.\r\n\r\nMeanwhile, pat the steaks dry with a paper towel and brush them lightly with vegetable oil. Combine the fleur de sel and cracked pepper on a plate and roll the steaks in the mixture, pressing lightly to evenly coat all sides.\r\n\r\nWhen the skillet is ready, add the steaks and sear them evenly on all sides for about 2 minutes per side, for a total of 10 minutes.\r\n\r\nTop each steak with a tablespoon of butter, if using, and place the skillet in the oven. Cook the steaks until they reach 120 degrees F for rare or 125 degrees F for medium-rare on an instant-read thermometer. (To test the steaks, insert the thermometer sideways to be sure you're actually testing the middle of the steak.)\r\n\r\nRemove the steaks to a serving platter, cover tightly with aluminum foil and allow to rest at room temperature for 10 minutes. Serve hot with [Roquefort Cheese Sauce](http:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=62) on the side.",
        "ingredients": [
            "1 tablespoon coarsely cracked black peppercorns\r",
            "1 tablespoon fleur de sel\r",
            "2 tablespoon vegetable oil\r",
            "2 (10-ounce) filet mignon\r",
            "2 tablespoon unsalted butter, at room temperature, optional\r",
            "2 servings [Roquefort Cheese Sauce](http:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=62)"
        ],
        "tags": [
            "beef",
            "main"
        ]
    },
    "62": {
        "id": "62",
        "name": "Roquefort Cheese Sauce",
        "source": "http:\/\/www.foodnetwork.com\/recipes\/ina-garten\/steakhouse-steaks-recipe\/index.html",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "Use your favorite blue cheese",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Bring the heavy cream to a boil in a small heavy-bottomed saucepan over medium-high heat. Cook at a low boil, stirring occasionally, until the mixture has become thick and creamy, about 20 minutes. Remove the pan from the heat, add the cheese, salt, pepper and chives and whisk rapidly until the cheese melts.",
        "ingredients": [
            "1 1\/2 cup heavy cream\r",
            "2 ounce French Roquefort cheese, crumbled (4 ounces with rind)\r",
            "1\/2 teaspoon kosher salt\r",
            "1\/4 teaspoon freshly ground black pepper\r",
            "1 tablespoon chives, chopped"
        ],
        "tags": [
            "sauce",
            "cheese",
            "components"
        ]
    },
    "63": {
        "id": "63",
        "name": "Stove top mac and cheese",
        "source": "Alton Brown",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 6,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a large pot of boiling, salted water cook the pasta to al dente and drain. Return to the pot and melt in the butter. Toss to coat.\r\n\r\nWhisk together the eggs, milk, hot sauce, salt, pepper, and mustard. Stir into the pasta and add the cheese. Over low heat continue to stir for 3 minutes or until creamy.\r\n\r\n(This recipe originally called for 6oz milk.  It is reduced as an experiment.)",
        "ingredients": [
            "Fresh black pepper\r",
            "1 teaspoon kosher salt\r",
            "1\/2 teaspoon hot sauce\r",
            "4 ounce evaporated milk\r",
            "2 eggs\r",
            "4 tablespoon butter\r",
            "1\/2 pound elbow macaroni\r",
            "1\/4 teaspoon dry mustard\r",
            "10 ounce sharp cheddar, shredded"
        ],
        "tags": [
            "cheese",
            "noodles",
            "main",
            "vegetarian"
        ]
    },
    "id1": {
        "id": "id1",
        "name": "The Original Chex Party Mix",
        "source": "http:\/\/www.chex.com\/recipes\/RecipeView.aspx?RecipeId=6709&CategoryId=343",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 24,
        "comments": "",
        "calories": 3610,
        "fat": 179,
        "satfat": 68,
        "carbs": 468,
        "fiber": 41,
        "sugar": 50,
        "protein": 64,
        "instructions": "Heat oven to 250. Place butter in large roasting pan and melt in the oven. Mix together cereals, nuts, pretzels and bagel chips in a large bowl. Remove pan from oven and mix seasonings into the melted butter. Add cereal mix and stir well to coat with seasoned butter. Place in the oven and bake for 1 hour, stirring every 15 minutes. Spread mix out to cool before storing.",
        "ingredients": [
            "3 cup Corn Chex® cereal\r",
            "3 cup Rice Chex® cereal\r",
            "3 cup Wheat Chex® cereal\r",
            "1 cup mixed nuts\r",
            "1 cup bite-size pretzels\r",
            "1 cup garlic-flavor bite-size bagel chips or regular-size bagel chips, broken into 1-inch pieces\r",
            "6 tablespoon butter or margarine\r",
            "2 tablespoon Worcestershire sauce\r",
            "1 1\/2 teaspoon seasoned salt\r",
            "3\/4 teaspoon garlic powder\r",
            "1\/2 teaspoon onion powder"
        ],
        "tags": [
            "snack",
            "party"
        ]
    },
    "id3": {
        "id": "id3",
        "name": "Handmade Pasta",
        "source": "napastyle.com",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 961,
        "fat": 20,
        "satfat": 4,
        "carbs": 157,
        "fiber": 6,
        "sugar": 1,
        "protein": 35,
        "instructions": "Sift flour and semolina into a medium bow.  Mix in salt.  Add eggs and olive oil, and beginning in the center, mix with two fingers in a circular motion until flour is combined with eggs.  Do not overmix.  Remove dough from bowl and gather into a ball.  On a lightly-floured board, knead gently with the heels of your hands, folding dough over onto itself until it forms a smooth mass.  Pat into a ball, flatten slightly, wrap in waxed paper or plastic wrap, and refrigerate for 30 minutes or as long as overnight.\r\n\r\nWork on a lightly floured surface.  Keep the dough lightly dusted with flour.  Roll dough into a sheet about 1\/16-inch thick.  Gently roll dough up into a cylinder.  With a slicing knife, cut crosswise in 1\/4-inch slices.  Dust dough with semolina and unwrap noodles.  Cover with a tea towel until ready to cook.  (The past may be made an hour ahead of time or frozen for up to 1 month.  Defrost in refrigerator.)  Fresh pasta will cook, in boiling salted water, in about 2-3 minutes.",
        "ingredients": [
            "1 cup all-purpose flour\r",
            "1\/2 cup semolina\r",
            "1\/4 tsp salt\r",
            "2 eggs, at room temperature\r",
            "2 tsp extra-virgin olive oil"
        ],
        "tags": [
            "noodles",
            "pasta",
            "components",
            "untried"
        ]
    },
    "id4": {
        "id": "id4",
        "name": "Emeril Essence Creole Seasoning",
        "source": "Emeril Lagasse",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "Yield 2\/3 cup",
        "calories": 184,
        "fat": 4,
        "satfat": 1,
        "carbs": 39,
        "fiber": 15,
        "sugar": 9,
        "protein": 8,
        "instructions": "Combine all ingredients thoroughly.",
        "ingredients": [
            "2 1\/2 tablespoon paprika\r",
            "2 tablespoon salt\r",
            "2 tablespoon garlic powder\r",
            "1 tablespoon black pepper\r",
            "1 tablespoon onion powder\r",
            "1 tablespoon cayenne pepper\r",
            "1 tablespoon dried oregano\r",
            "1 tablespoon dried thyme"
        ],
        "tags": [
            "seasoning",
            "components",
            "untried"
        ]
    },
    "id5": {
        "id": "id5",
        "name": "Vegetarian Chili",
        "source": "Emeril Lagasse",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 8,
        "comments": "Nutrition information is without any toppings",
        "calories": 1560,
        "fat": 40,
        "satfat": 0,
        "carbs": 248,
        "fiber": 80,
        "sugar": 56,
        "protein": 72,
        "instructions": "In a large (6qt), heavy pot, heat the oil over medium-high heat. Add the onions, bell peppers, garlic, and serrano peppers, and cook, stirring, until soft, about 3 minutes. \r\n\r\nAdd the zucchini and mushrooms, and cook, stirring, until soft and the vegetables give off their liquid and start to brown around the edges, about 6 minutes. Add the chili powder, cumin, salt and cayenne, and cook, stirring, until fragrant, about 30 seconds. \r\n\r\nAdd the tomatoes and stir well. Add the beans, tomato sauce, and vegetable stock, stir well, and bring to a boil. Reduce the heat to medium-low and simmer, stirring occasionally, for about 20 minutes.\r\n\r\nRemove from the heat and stir in the cilantro and lime juice. Adjust the seasoning, to taste.\r\n\r\nTo serve, place 1\/4 cup of brown rice in the bottom of each bowl. Ladle the chili into the bowls over the rice. Top each serving with a dollop of sour cream and spoonful of avocado or [guacamole](http:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=28). Sprinkle with [Essence](http:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=id4) and green onions and serve.",
        "ingredients": [
            "2 tablespoon canola oil\r",
            "1 1\/2 cup yellow onions, chopped\r",
            "1 cup red bell peppers, chopped\r",
            "2 tablespoon garlic, minced\r",
            "2 serrano peppers, stemmed, seeded, and minced\r",
            "1 medium zucchini, stem ends trimmed and cut into small dice\r",
            "5 large portobello mushrooms, stemmed, wiped clean and cubed\r",
            "2 tablespoon chili powder\r",
            "1 tablespooon ground cumin\r",
            "1 1\/4 teaspoon salt\r",
            "1\/4 teaspoon cayenne\r",
            "4 large tomatoes, peeled, seeded and chopped\r",
            "2 can black beans, rinsed and drained\r",
            "1 15oz can tomato sauce\r",
            "1 cup vegetable stock, or water\r",
            "1 lime, juiced\r",
            "1\/4 cup cilantro, chopped\r",
            "<hr>\r",
            "Cooked brown rice, accompaniment\r",
            "Sour cream or strained plain yogurt, garnish\r",
            "Diced avocado or guacamole, garnish\r",
            "Essence, garnish\r",
            "Chopped green onions, garnish"
        ],
        "tags": [
            "chili",
            "soup",
            "vegetarian",
            "main"
        ]
    },
    "id6": {
        "id": "id6",
        "name": "Basil-Lime Vinaigrette",
        "source": "Giada De Laurentiis",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 489,
        "fat": 51,
        "satfat": 7,
        "carbs": 16,
        "fiber": 4,
        "sugar": 3,
        "protein": 2,
        "instructions": "In a small bowl, combine the lime zest, lime juice, balsamic vinegar, basil, and cumin. Slowly add the oil, whisking constantly until the mixture thickens. Season with salt and pepper, to taste.",
        "ingredients": [
            "2 limes, zested and juiced\r",
            "2 tablespoon balsamic vinegar\r",
            "1\/2 cup basil, chopped\r",
            "1 teaspoon ground cumin\r",
            "1\/4 cup extra-virgin olive oil\r",
            "Kosher salt and freshly ground black pepper"
        ],
        "tags": [
            "dressing",
            "components"
        ]
    },
    "id8": {
        "id": "id8",
        "name": "Lentil Soup",
        "source": "Alton Brown",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 8,
        "comments": "",
        "calories": 2259,
        "fat": 43,
        "satfat": 7,
        "carbs": 304,
        "fiber": 144,
        "sugar": 27,
        "protein": 159,
        "instructions": "Place the olive oil into a large 6-quart Dutch oven and set over medium heat. Once hot, add the onion, carrot, celery and salt and sweat until the onions are translucent, approximately 6 to 7 minutes. Add the lentils, tomatoes, broth, coriander, cumin and pepper and stir to combine. Increase the heat to high and bring just to a boil. Reduce the heat to low, cover and cook at a low simmer until the lentils are tender, approximately 35 to 40 minutes. Using a stick blender, puree to your preferred consistency (optional). Serve immediately.",
        "ingredients": [
            "2 tablespoon olive oil\r",
            "1 cup onion, chopped\r",
            "1\/2 cup carrot, finely chopped\r",
            "1\/2 cup celery, finely chopped\r",
            "2 teaspoon kosher salt\r",
            "1 pound lentils, picked and rinsed\r",
            "1 cup tomatoes, peeled and chopped\r",
            "2 quart vegetable broth\r",
            "1\/2 teaspoon coriander, freshly ground\r",
            "1\/2 teaspoon cumin, freshly ground and toasted\r",
            "1\/2 teaspoon black pepper, freshly ground"
        ],
        "tags": [
            "soup",
            "lentils",
            "main"
        ]
    },
    "id9": {
        "id": "id9",
        "name": "Natural sports drink",
        "source": "Yuri Elkhaim",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 1,
        "comments": "",
        "calories": 168,
        "fat": 0,
        "satfat": 0,
        "carbs": 44,
        "fiber": 0,
        "sugar": 36,
        "protein": 0,
        "instructions": "Mix together",
        "ingredients": [
            "2 cup water\r",
            "1\/2 lemon, juiced\r",
            "1\/2 lime, juiced\r",
            "4 tbsp maple syrup\r",
            "pinch of sea salt"
        ],
        "tags": [
            "FUF",
            "drink"
        ]
    },
    "id12": {
        "id": "id12",
        "name": "Vegetable Stock",
        "source": "Martha Stewart Magazine April 2011",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 6,
        "comments": "Yields 6 cups",
        "calories": 216,
        "fat": 1,
        "satfat": 0,
        "carbs": 50,
        "fiber": 10,
        "sugar": 16,
        "protein": 6,
        "instructions": "1. Cook leeks, carrots, onion, and garlic, covered stirring occasionally in a medium saucepan over medium heat for 10 minutes.\r\n2. Add water, parsley, thyme, bay leaf, and peppercorns. Raise heat to high. Bring to a boil, reduce heat. Simmer, uncovered, for 30 minutes. Pour through a cheesecloth-lined strainer; discard solids.\r\n\r\nStorage: stock can be refrigerated for up to 2 days or frozen for up to 3 months.",
        "ingredients": [
            "2 leeks, white and pal-green parts only, cut into 1-inch rounds, rinsed well\r",
            "2 carrots, cut into 1-inch rounds\r",
            "1 small onion, cut into 1-inch pieces\r",
            "3 garlic cloves\r",
            "8 cup water\r",
            "5 sprig flat-leaf parsley\r",
            "2 sprig thyme\r",
            "1 dried bay leaf\r",
            "2 teaspoon whole black peppercorns, crushed"
        ],
        "tags": [
            "soup",
            "stock",
            "vegetarian",
            "components"
        ]
    },
    "id14": {
        "id": "id14",
        "name": "Grilled garlic-lime fish tacos",
        "source": "Everyday Food magazine June 2011",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "Yields 12 tacos",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Heat a grill or grill pan to medium-high. Clean and lightly oil hot grill. In a medium bowl, whisk together olive oil, garlic, and lime juice. Add fish and turn once to coat; let sit 5 minutes. Remove fish from marinade, letting excess drip off. Season with salt and pepper and grill until flesh is opaque throughout, 12 minutes, flipping once. With a fork, break fish into large pieces and serve with tortillas and [salsa fresca](http:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=id10).",
        "ingredients": [
            "vegetable oil, for grill\r",
            "1 tablespoon extra-virgin olive oil\r",
            "2 clove garlic, finely chopped\r",
            "1 tablespoon fresh lime juice\r",
            "1 1\/4 pound skinless firm white-fleshed fish fillets, such as striped bass or cod (about 1 inch thick)\r",
            "coarse salt and ground pepper\r",
            "4 large flour tortillas, warmed or lightly toasted\r",
            "1 serving [Salsa fresca](http:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=id172)"
        ],
        "tags": [
            "tacos",
            "fish",
            "mexican",
            "grill",
            "main"
        ]
    },
    "id15": {
        "id": "id15",
        "name": "Spicy Rice Casserole",
        "source": "Betty Crocker",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 1294,
        "fat": 46,
        "satfat": 12,
        "carbs": 186,
        "fiber": 14,
        "sugar": 26,
        "protein": 44,
        "instructions": "Preheat oven to 425 degrees.\r\n\r\nMix rice, oats, onion, bread crumbs, milk, basil, oregano, cayenne, and egg.  Press mixture into small baking dish.  Mix panko and parmesan, put on top of mixture.  Bake for 20 minutes or until crispy or browned.  (If topping starts browning too soon, cover loosely with aluminum foil.)\r\n\r\nServe with marinara sauce.",
        "ingredients": [
            "2 cup cooked rice\r",
            "1\/2 cup quick-cooking oats\r",
            "1\/2 cup onion, chopped\r",
            "1\/4 cup dry bread crumbs\r",
            "1\/4 cup milk\r",
            "1 tbsp basil, chopped\r",
            "2 tsp oregano, chopped\r",
            "1\/8 tsp cayenne pepper\r",
            "1 large egg, beaten\r",
            "1\/2 cup panko\r",
            "1\/4 cup parmesan cheese\r",
            "4 serving [marinara sauce](http:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=id34)"
        ],
        "tags": [
            "vegetarian",
            "rice",
            "main"
        ]
    },
    "id17": {
        "id": "id17",
        "name": "Citrus Rice Salad",
        "source": "Super Natural Cooking by Heidi Swanson",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "Try different seasonal variations: cranberry vinaigrette with toasted walnuts; basil dressing with heirloom tomatoes and corn; lemon juice with olive oil, asparagus, favas, and shelled peas.",
        "calories": 3379,
        "fat": 221,
        "satfat": 32,
        "carbs": 303,
        "fiber": 58,
        "sugar": 25,
        "protein": 81,
        "instructions": "To make the dressing, combine the orange zest and juice, lemon juice, and shallot. Whisk in the olive oil and season with a few pinches of salt and a few grinds of pepper.\r\n\r\nToss the hot rice with the spinach, pine nuts, citrus dressing, then top with the feta. Taste for seasoning and sprinkle with a bit more salt if needed.",
        "ingredients": [
            "3 cup cooked brown rice, hot\r",
            "3 cup spinach leaves, stemmed and well rinsed\r",
            "1 cup toasted pine nuts\r",
            "1\/2 cup crumbled feta cheese\r",
            "<hr>\r",
            "1 orange, zested and juiced\r",
            "1 tablespoon fresh lemon juice\r",
            "1 tablespoon shallot, minced\r",
            "1\/2 cup extra-virgin olive oil\r",
            "salt and freshly ground pepper"
        ],
        "tags": [
            "vegetarian",
            "rice",
            "main"
        ]
    },
    "id18": {
        "id": "id18",
        "name": "Straw and Hay Fettuccine Tangle",
        "source": "Super Natural Cooking by Heidi Swanson",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 900,
        "servings": 4,
        "comments": "The asparagus puree can be made ahead of time; store in the refrigerator in a jar topped with a layer of olive oil.",
        "calories": 2338,
        "fat": 112,
        "satfat": 20,
        "carbs": 276,
        "fiber": 20,
        "sugar": 20,
        "protein": 88,
        "instructions": "Bring a large pot of water to a rolling boil.\r\n\r\nMeanwhile, make asparagus pesto.\r\n\r\nSalt the pasta water well and cook the pasta until just tender. Drain and toss immediately with 1 cup of the asparagus pesto (1\/4 cup per serving), stirring in more afterward depending on how heavily coated you like your pasta. Serve sprinkled with the remaining toasted pine nuts, a dusting of Parmesan, and a quick drizzle of extra-virgin olive oil.",
        "ingredients": [
            "4 serving [asparagus pesto](http:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=id436)",
            "1\/4 cup toasted pine nuts\r",
            "4 tbsp parmesan, grated\r",
            "12 oz dried pasta"
        ],
        "tags": [
            "vegetarian",
            "pasta",
            "main"
        ]
    },
    "id19": {
        "id": "id19",
        "name": "Green-packed Stir Fry with Fresh Herbs",
        "source": "Super Natural Cooking by Heidi Swanson",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 770,
        "fat": 32,
        "satfat": 4,
        "carbs": 82,
        "fiber": 14,
        "sugar": 12,
        "protein": 40,
        "instructions": "Cook the rice, if it is not already.\r\n\r\nWhen you have all your ingredients prepped, arrange them within arm's reach of the stove. Heat a small splash of sesame oil in a wok or large nonstick pan over medium-high heat. When the oil is hot, add the tofu and cook for a couple of minutes, until the tofu is golden. Remove from the pan. (You can also cook the tofu in a dry nonstick or well seasoned pan.)\r\n\r\nAdd another splash of oil to the wok and, as soon as it's hot, add the asparagus and stir for 2 minutes.  Add the white part of the green onions and chiles, and stir for another 2 minutes.  Add the green part of the green onions, and stir for another 2 minutes.  Add the garlic and ginger, and stir for 30 seconds, then add the cashews and spinach and stir for another minute, or until the spinach wilts and collapses. \r\n\r\nReturn the tofu to the pan. Stir in the stir-fry sauce. Cook for another minute, stirring constantly.\r\n\r\nRemove from heat and stir in the mint and basil. Season with enough soy sauce to make the flavors pop, starting with a splash.\r\n\r\nServe over cooked rice.\r\n\r\nNutrition information does not include stir-fry sauce.",
        "ingredients": [
            "1 cup cooked rice\r",
            "Sesame oil\r",
            "8 oz extra-firm tofu, cut into slices 1-inch long and as thick as a pencil\r",
            "4 clove garlic, minced\r",
            "5 green onions, chopped with white and green parts separated\r",
            "1 tbsp fresh ginger, peeled and minced\r",
            "1\/2 jalapeno, deseeded and chopped\r",
            "1\/2 bunch thin asparagus (about 1\/2 pound), trimmed and cut diagonally into 1-inch slices\r",
            "1\/2 cup cashews, coarsely chopped\r",
            "2 1\/2 cup spinach leaves, stemmed\r",
            "2 tablespoon fresh mint, slivered\r",
            "2 tablespoon fresh basil, slivered\r",
            "2 servings stir-fry sauce"
        ],
        "tags": [
            "vegetarian",
            "asian",
            "main"
        ]
    },
    "id20": {
        "id": "id20",
        "name": "Apple-Brie Panini",
        "source": "Food Network Magazine",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 1,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat a skillet with 1 tablespoon butter (or oil) on medium-low.\r\n\r\nSpread Dijon mustard on the inside of a split piece of baguette. Fill with the brie and apple slices.\r\n\r\nAdd sandwich to skillet, the press a heavy pan on top to weigh it down. Cook until golden and crisp, 3 to 4 minutes per side. Add more butter to the skillet, if needed, for second side.",
        "ingredients": [
            "Dijon mustard\r",
            "Baguette\r",
            "2 oz brie cheese, sliced\r",
            "1\/4 green apple, thinly sliced\r",
            "2 tablespoon unsalted butter"
        ],
        "tags": [
            "sandwich",
            "main",
            "test"
        ]
    },
    "id21": {
        "id": "id21",
        "name": "Shredded Green Beans",
        "source": "Super Natural Cooking by Heidi Swanson",
        "preptime": 1200,
        "waittime": 0,
        "cooktime": 180,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Slice the beans on a diagonal into roughly 1\/8-inch pieces. If you are using a food processor, do them a handful at a time. Either way, the result should be tiny, angular zeroes.\r\n\r\nHeat the olive oil in a large skillet over medium-high heat. Add the beans and stir until coated with oil, then add the water. Cover and cook 2 or 3 minutes, until the beans are brightly colored and tender; give the pan a good shake midway through to ensure even cooking. Remove from the heat and stir in the zests and half of the chives. Season to taste with salt and pepper and serve garnished with the remaining chives.",
        "ingredients": [
            "3\/4 pound green beans, tops and tails trimmed\r",
            "2 tablespoon extra-virgin olive oil or clarified butter\r",
            "2 tablespoon water\r",
            "1 lemon, zested\r",
            "1 lime, zested\r",
            "1\/4 cup chives, chopped\r",
            "Salt and freshly ground pepper"
        ],
        "tags": [
            "vegetables",
            "vegetarian",
            "sides"
        ]
    },
    "id22": {
        "id": "id22",
        "name": "Hot Cocoa",
        "source": "Food Network Magazine",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 300,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Prepare mix ahead of time. One serving is 1\/4 cup mix per cup of milk.\r\n\r\nBring milk to a simmer in a saucepan over medium heat. Whisk cocoa\/sugar mix into the milk. Add the chopped chocolate and reduce heat to low and simmer, stirring, until the chocolate melts and the cocoa is thick, about 2 minutes. Divide among mugs and garnish each with homemade marshmallows or whipped cream.",
        "ingredients": [
            "3\/4 cup sugar\r",
            "1\/2 cup unsweetened cocoa powder\r",
            "1 tsp vanilla extract\r",
            "1\/4 tsp salt\r",
            "<hr>",
            "4 cup milk\r",
            "4 oz chocolate, chopped fine"
        ],
        "tags": [
            "drink",
            "chocolate"
        ]
    },
    "id25": {
        "id": "id25",
        "name": "Pesto Orzo with Peas",
        "source": "Food Network Magazine - 50 Things to Make with Pesto",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Cook pancetta in a skilled with olive oil until crisp.  Remove with slotted spoon.\r\n\r\nMeanwhile, bring 1 quart of water to a boil. Add 1 tbsp salt and orzo. Cook about 5 minutes or until al dente.\r\n\r\nAdd frozen peas and water to the skillet; simmer until tender (about 5 minutes). Drain and return to skillet.\r\n\r\nStir in pesto, orzo, pancetta, and parmesan, and heat through.",
        "ingredients": [
            "4 oz pancetta, diced\r",
            "12 oz frozen peas\r",
            "1 cup water\r",
            "4 servings [pesto](http:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=id99)",
            "1 cup orzo, uncooked\r",
            "2 tbsp Parmesan, grated"
        ],
        "tags": [
            "peas",
            "pasta",
            "main"
        ]
    },
    "id26": {
        "id": "id26",
        "name": "Roasted potatoes and tomatoes",
        "source": "Food Network Magazine May 2011",
        "preptime": 600,
        "waittime": 0,
        "cooktime": 1500,
        "servings": 6,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Put a baking sheet in the oven and preheat to 450.\r\n\r\nCut potatoes lengthwise into eighths. Toss with olive oil, tomatoes, rosemary, garlic cloves, salt and pepper. Put cut-side down on the hot baking sheet and roast 15 minutes. Flip the mixture and roast 10 more minutes.",
        "ingredients": [
            "1 1\/2 pound red potatoes\r",
            "2 tbsp olive oil\r",
            "1 pint grape tomatoes\r",
            "3 sprig rosemary\r",
            "3 garlic cloves, smashed\r",
            "salt and pepper"
        ],
        "tags": [
            "sides",
            "potatoes"
        ]
    },
    "id27": {
        "id": "id27",
        "name": "Almond Caesar salad with croutons",
        "source": "Food Network Magazine May 2011",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 1562,
        "fat": 117,
        "satfat": 21,
        "carbs": 88,
        "fiber": 14,
        "sugar": 11,
        "protein": 53,
        "instructions": "For croutons: Toss bread with olive oil, almonds, parmesan, lemon zest, salt and pepper. Spread on a baking sheet and bake at 425, about 8 minutes.\r\n\r\nFor dressing: Meanwhile, process almonds, parmesan, anchovies, and garlic in a food processor until finely chopped. Add dijon and lemon juice, pulse motor until just combined. With motor running, drizzle in olive oil until thoroughly combined. Season with salt and pepper.\r\n\r\nToss dressing with lettuce and croutons.",
        "ingredients": [
            "4 cup Italian bread, cubed\r",
            "2 tbsp olive oil\r",
            "2 tbsp sliced almonds\r",
            "2 tbsp Parmesan, grated\r",
            "1\/2 lemon, zested\r",
            "salt and pepper\r",
            "<hr>\r",
            "1\/4 cup sliced almonds\r",
            "1\/4 cup Parmesan, grated\r",
            "3 anchovies\r",
            "1 garlic clove\r",
            "2 tsp dijon mustard\r",
            "1 lemon, juiced\r",
            "1\/4 cup olive oil\r",
            "6 cup lettuce"
        ],
        "tags": [
            "salad",
            "main"
        ]
    },
    "id28": {
        "id": "id28",
        "name": "Spiced Apple Sauce",
        "source": "Cook with Jamie by Jamie Oliver",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "Substitute 1 lemon for 1\/2 orange",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a small saucepan gently melt the butter for a minute with the orange zest and juice, the sugar, cinnamon, grated nutmeg and cloves. Stir until the butter foams, then stir in the apples. Place a lid on top and cook for 15-20 minutes on a medium to low heat until you have a soft, sludgy sauce. Taste and add a bit more sugar if you want. Serve warm or room temperature.",
        "ingredients": [
            "1 tbsp unsalted butter\r",
            "1\/2 orange, zested and juiced\r",
            "2 tbsp sugar\r",
            "1\/4 tsp ground cinnamon\r",
            "1\/4 nutmeg, grated\r",
            "1\/4 tsp ground cloves\r",
            "2 good eating apples, peeled, cored and chopped into 1 inch dice\r",
            "1 cooking apple, peeled, cored and chopped into 1 inch dice"
        ],
        "tags": [
            "sides",
            "apple"
        ]
    },
    "id29": {
        "id": "id29",
        "name": "Schnitzel",
        "source": "Cook with Jamie by Jamie Oliver",
        "preptime": 1200,
        "waittime": 0,
        "cooktime": 300,
        "servings": 2,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "To prepare your meat, put the escalopes on to a chopping board, put a piece of wax paper on top and bat the meat with the bottom of a saucepan to flatten in a little - you want to get it to about 1\/4 inch thick.\r\n\r\nTo breadcrumb your meat, get yourself four large plates and lay them out in a line in the front of you. From left to right, you want to have your slat and pepper in one, flour in the second, beaten egg in the third and your fine breadcrumbs in the fourth. It's very simple...season the pieces of meat and dip them into the flour, shaking off any excess, then put them into the egg, dripping off any excess, and into the breadcrumbs, patting them over both sides and pressing down quite firmly. Gently shake off any excess and put the meat on a board or clean plate ready to be cooked.\r\n\r\nHeat a heavy frying pan, add a couple of good glugs of olive oil and, when it's good and hot, put both pieces of pork into the pan. Cook for 2 minutes or so, then carefully start to shake and agitate the pan to cover them in the hot oil. Turn the pork over and continue to cook for a couple of minutes until both sides are crisp and golden brown. Remove to a tray line with paper towels and season with salt and pepper. Put a schnitzel on to each of your serving plates. Put a little pile of cornichon matchsticks and some watercress leaves on top and serve with a big lob of apple sauce, a squeeze of lemon juice and a drizzle of extra virgin olive oil.",
        "ingredients": [
            "2 5.5oz pork escalopes\r",
            "Salt and pepper\r",
            "Flour\r",
            "1 large egg, beaten\r",
            "1 1\/2 cup breadcrumbs\r",
            "olive oil\r",
            "10 cornichons, optional for garnish, drained and cut in to matchsticks\r",
            "1 bunch watercress, washed and dried\r",
            "1 lemon, optional for serving"
        ],
        "tags": [
            "pork",
            "german",
            "main"
        ]
    },
    "id30": {
        "id": "id30",
        "name": "Oregano Marinated Chicken",
        "source": "http:\/\/www.foodnetwork.com\/recipes\/dave-lieberman\/greek-salad-with-oregano-marinated-chicken-recipe2\/index.html",
        "preptime": 1800,
        "waittime": 14400,
        "cooktime": 900,
        "servings": 6,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "To marinate the chicken: In a non-reactive dish, combine the lemon juice, olive oil, oregano, salt, and pepper and mix together. Add the chicken breasts to the dish and rub both sides in the mixture. Cover the dish with plastic wrap and let marinate in the refrigerator for at least 30 minutes and up to 4 hours.\r\n\r\nTo cook the chicken: Heat a nonstick skillet or grill pan over high heat. Add the chicken breasts and cook, turning once, until well browned, about 4 to 5 minutes on each side or until cooked through. Let the chicken rest on a cutting board for a few minutes before slicing it into thin strips.",
        "ingredients": [
            "4 (6 to 7-ounce) boneless skinless chicken breasts\r",
            "10 grinds black pepper\r",
            "1\/2 tsp salt\r",
            "2 tablespoon extra-virgin olive oil\r",
            "1 teaspoon dried oregano\r",
            "1 lemon, juiced"
        ],
        "tags": [
            "main",
            "chicken"
        ]
    },
    "id32": {
        "id": "id32",
        "name": "Black bean and cheese tacos",
        "source": "Everyday Food June 2011",
        "preptime": 600,
        "waittime": 0,
        "cooktime": 420,
        "servings": 2,
        "comments": "",
        "calories": 1512,
        "fat": 60,
        "satfat": 20,
        "carbs": 182,
        "fiber": 38,
        "sugar": 10,
        "protein": 62,
        "instructions": "In a small pot, heat oil over medium. Add onion and garlic and cook until onion is soft and garlic is fragrant, 3 minutes. Add cumin and cook until fragrant, 1 minute. Add beans, water, salt, and pepper, and simmer until beans are heated through, 3 minutes. Mash in pan with wooden spoon.\r\n\r\nSeason to taste with salt and pepper if needed. Serve with tortillas, cheese, avocado, lettuce, and jalapenos.",
        "ingredients": [
            "1 tsp extra-virgin olive oil\r",
            "1\/2 small yellow onion, diced small\r",
            "2 garlic cloves, roughly chopped\r",
            "1\/2 tsp ground cumin\r",
            "1 can black beans, rinsed and drained\r",
            "1\/2 cup water\r",
            "coarse salt and ground pepper\r",
            "<hr>\r",
            "4 flour tortillas, warmed or lightly toasted\r",
            "1 cup Monterey Jack cheese, shredded (1 cup ≈ 3 oz)\r",
            "1 avocado, pitted, peeled and thinly sliced\r",
            "1 cup packed shredded romaine lettuce"
        ],
        "tags": [
            "vegetarian",
            "mexican",
            "main"
        ]
    },
    "id33": {
        "id": "id33",
        "name": "Joan's Broccoli Madness",
        "source": "Souplantation\/Sweet Tomatoes blog",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 6,
        "comments": "",
        "calories": 2348,
        "fat": 144,
        "satfat": 28,
        "carbs": 227,
        "fiber": 20,
        "sugar": 125,
        "protein": 59,
        "instructions": "Mix the first five ingredients in a large bowl.\r\nIn a second bowl, beat dressing ingredients together gently until smooth.\r\nToss the salad with the dressing approximately 10 minutes before serving to allow flavors to meld. Serve on chilled salad dishes.",
        "ingredients": [
            "1 bunch broccoli, raw\r",
            "½ cup bacon, cooked and crumbled\r",
            "½ cup cashews\r",
            "1\/3 cup raisins\r",
            "¼ cup red onion, chopped\r",
            "1 cup mayonnaise\r",
            "1\/3 cup sugar\r",
            "2 tablespoon apple cider vinegar"
        ],
        "tags": [
            "sides",
            "untried"
        ]
    },
    "id34": {
        "id": "id34",
        "name": "Marinara Sauce",
        "source": "Ebelskivers by Kevin Crafts",
        "preptime": 300,
        "waittime": 0,
        "cooktime": 1200,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a large frying pan over medium heat, saute the garlic in the olive oil until fragrant, about 1 minute. Stir in the red pepper flakes, basil, oregano, and tomatoes and bring to a simmer. Reduce the heat to low and simmer until thickened, about 20 minutes. Season to taste.\r\n\r\nMakes about 2 1\/2 cups (20 fl oz\/625mL)",
        "ingredients": [
            "2 clove garlic, minced\r",
            "2 tbsp extra-virgin olive oil\r",
            "1 tsp dried basil\r",
            "1 tsp dried oregano\r",
            "1 15oz can crushed Italian tomatoes\r",
            "Salt and freshly ground pepper"
        ],
        "tags": [
            "sauce",
            "italian",
            "components"
        ]
    },
    "id35": {
        "id": "id35",
        "name": "Creamy tomato soup",
        "source": "Based on Food Network Magazine’s “Triple grilled cheese with tomato soup”, Sept 2010",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 892,
        "fat": 84,
        "satfat": 12,
        "carbs": 32,
        "fiber": 4,
        "sugar": 20,
        "protein": 8,
        "instructions": "Combine the olive oil, onion, garlic, celery, tomatoes, sugar, and salt in a saucepan. Cook over medium heat, stirring occasionally, until the vegetables are tender, about 25 minutes. Puree until smooth (or desired consistency), or transfer to a regular blender in batches and puree. Pour back into saucepan and add milk and basil. Add salt and pepper to taste. For vegans or non-creamy soup, thin with water if needed.",
        "ingredients": [
            "1\/4 cup extra-virgin olive oil\r",
            "1 medium onion, finely chopped\r",
            "1 clove garlic, chopped\r",
            "1 small inner stalk celery, chopped\r",
            "2 pound tomatoes, chopped\r",
            "1\/2 teaspoon sugar\r",
            "1 tsp salt\r",
            "1 tablespoon fresh basil (or 1\/2 teaspoon dried basil), chopped\r",
            "1 cup milk, half-and-half, or cream\r",
            "Kosher salt and freshly ground black pepper"
        ],
        "tags": [
            "soup",
            "main",
            "vegetarian"
        ]
    },
    "id36": {
        "id": "id36",
        "name": "Triple Grilled Cheese",
        "source": "Based on Food Network Magazine’s “Triple grilled cheese with tomato soup”, Sept 2010.",
        "preptime": 600,
        "waittime": 0,
        "cooktime": 480,
        "servings": 4,
        "comments": "",
        "calories": 1848,
        "fat": 104,
        "satfat": 60,
        "carbs": 132,
        "fiber": 8,
        "sugar": 8,
        "protein": 100,
        "instructions": "Combine all three cheeses in a bowl. Divide evenly among 4 bread slices and top with the remaining bread. Heat 1 tablespoon butter in a large skillet or griddle over medium heat. Cook the sandwiches in batches, adding the remaining butter as needed, until the cheese melts and the bread is golden, 3-4 minutes per side. Serve the sandwiches with the soup.",
        "ingredients": [
            "1 cup shredded muenster cheese (about 4 oz)\r",
            "1 cup shredded mozzarella cheese (about 4 oz)\r",
            "1\/2 cup grated Parmesan cheese (about 1 oz)\r",
            "8 slices thick sandwich bread\r",
            "2 tablespoon unsalted butter"
        ],
        "tags": [
            "sandwich",
            "cheese",
            "main"
        ]
    },
    "id37": {
        "id": "id37",
        "name": "Vegetarian Steamed Dumplings",
        "source": "http:\/\/www.foodnetwork.com\/recipes\/alton-brown\/vegetarian-steamed-dumplings-recipe\/index.html",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat the oven to 200 degrees F.\r\n\r\nCut the tofu in half horizontally and lay between layers of paper towels. Place on a plate, top with another plate, and place a weight on top (a 14-ounce can of vegetables works well). Let stand 20 minutes. After 20 minutes, cut the tofu into 1\/4-inch cubes and place in a large mixing bowl. Add the carrots, cabbage, red pepper, scallions, ginger, cilantro, soy sauce, hoisin, sesame oil, egg, salt, and pepper. Lightly stir to combine.\r\n\r\nTo form the dumplings, remove 1 wonton wrapper from the package, covering the others with a damp cloth. Brush the edges of the wrapper lightly with water. Place 1\/2 rounded teaspoon of the tofu mixture in the center of the wrapper. Shape as desired. Set on a sheet pan and cover with a damp cloth. Repeat procedure until all of the filling is gone.\r\n\r\nUsing a steaming apparatus of your choice, bring 1\/4 to 1\/2-inch of water to a simmer over medium heat. Spray the steamer's surface lightly with the non-stick vegetable spray to prevent sticking. Place as many dumplings as will fit into a steamer, without touching each other. Cover and steam for 10 to 12 minutes over medium heat. Remove the dumplings from the steamer to a heatproof platter and place in oven to keep warm. Repeat until all dumplings are cooked.\r\n\r\nTo make dipping sauce, whisk together ingredients in a small bowl.",
        "ingredients": [
            "1\/2 pound firm tofu\r",
            "1\/2 cup carrots, coarsely grated\r",
            "1\/2 cup Napa cabbage, shredded\r",
            "2 tablespoon red bell pepper, finely chopped\r",
            "2 tablespoon green onions, finely chopped\r",
            "2 teaspoon fresh ginger, finely minced\r",
            "1 tablespoon cilantro, chopped\r",
            "1 tablespoon soy sauce\r",
            "1 tablespoon hoisin sauce\r",
            "2 teaspoon sesame oil\r",
            "1 egg, lightly beaten\r",
            "1 teaspoon kosher salt\r",
            "1\/4 teaspoon freshly ground black pepper\r",
            "Bowl of water, plus additional water for steamer\r",
            "40 small wonton wrappers\r",
            "Non-stick vegetable spray, for the steamer\r",
            "<hr>\r",
            "1 1\/2 tablespoon soy sauce\r",
            "1 tablespoon seasoned rice vinegar\r",
            "1 teaspoon sesame oil\r",
            "1\/2 teaspoon sriracha"
        ],
        "tags": [
            "vegetarian",
            "asian",
            "main"
        ]
    },
    "id38": {
        "id": "id38",
        "name": "Soba salad with asparagus and shrimp",
        "source": "Everyday Food June 2011",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "Also try with other veggies and proteins",
        "calories": 1928,
        "fat": 24,
        "satfat": 4,
        "carbs": 292,
        "fiber": 12,
        "sugar": 23,
        "protein": 156,
        "instructions": "1. In a large pot of boiling salted water, cook asparagus until crisp-tender, about 3 minutes. With a slotted spoon or mesh strainer, transfer asparagus to a colander and rinse under cool water to stop the cooking. Transfer asparagus to a medium bowl. Return water to a boil; add shrimp and cook until pink and opaque throughout, about 2 minutes. Transfer shrimp to bowl with asparagus. Return water to a boil; add noodles and cook according to package instructions. Drain noodles and rinse under cool water.\r\n\r\n2. Meanwhile, in a small bowl, whisk together soy sauce oil, vinegar, and sugar. Divide noodles among four bowls and drizzle with dressing. Top with asparagus and shrimp and sprinkle with scallions and basil.",
        "ingredients": [
            "Sea salt\r",
            "1 pound asparagus, trimmed\r",
            "1 pound frozen large shrimp (peeled and deveined), thawed\r",
            "3\/4 pound soba noodles\r",
            "3 tablespoon soy sauce\r",
            "1 tablespoon toasted sesame oil\r",
            "1 tablespoon rice vinegar\r",
            "1 tablespoon sugar\r",
            "3 green onions, thinly sliced\r",
            "1 cup fresh basil leaves, chiffonade"
        ],
        "tags": [
            "noodles",
            "shrimp",
            "main"
        ]
    },
    "id39": {
        "id": "id39",
        "name": "Tofu and Sweet Potato Jambalaya",
        "source": "Betty Crocker's Cookbook",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 1590,
        "fat": 28,
        "satfat": 4,
        "carbs": 296,
        "fiber": 40,
        "sugar": 30,
        "protein": 76,
        "instructions": "1. Drain tofu; cut into 3\/4-inch cubes. Carefully press cubes between paper towels to remove as much water as possible.\r\n2. Heat oil in 12-inch skillet over medium heat. Cook tofu in oil 6 to 8 minutes, turning frequently, until light golden brown. Remove tofu from skillet; set aside.\r\n3. Add sweet potato and garlic to skillet. Cook 2 to 3 minutes, stirring occasionally, just until sweet potato begins to brown. Stir in broth, rice, Worcestershire sauce and red pepper. Heat to boiling; reduce heat. Cover and simmer 10 minutes.\r\n4. Stir in beans. Cover and cook 8 to 10 minutes, stirring occasionally, until rice is tender and liquid is absorbed. Stir in tofu and onions. Cook 1 to 2 minutes or until heated through.",
        "ingredients": [
            "14 oz firm tofu\r",
            "1 tablespoon olive oil\r",
            "1 large sweet potato, peeled and cut into 1\/2-inch cubes\r",
            "2 clove garlic, finely chopped\r",
            "2 cup vegetable broth\r",
            "3\/4 cup uncooked regular long-grain white rice\r",
            "2 tablespoon Worcestershire sauce\r",
            "1\/4 teaspoon ground red pepper\r",
            "1 can black beans (15 oz), rinsed and drained\r",
            "12 medium green onions, sliced"
        ],
        "tags": [
            "vegetarian",
            "main"
        ]
    },
    "id43": {
        "id": "id43",
        "name": "Parker's split pea soup",
        "source": "http:\/\/www.foodnetwork.com\/recipes\/ina-garten\/parkers-split-pea-soup-recipe\/index.html",
        "preptime": 600,
        "waittime": 0,
        "cooktime": 5400,
        "servings": 6,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a 4-quart stockpot on medium heat, saute the onions and garlic with the olive oil, oregano, salt, and pepper until the onions are translucent, 10 to 15 minutes. Add the carrots, potatoes, 1\/2 pound of split peas, and chicken stock. Bring to a boil, then simmer uncovered for 40 minutes. Skim off the foam while cooking. Add the remaining split peas and continue to simmer for another 40 minutes, or until all the peas are soft. Stir frequently to keep the solids from burning on the bottom. Taste for salt and pepper. Serve hot.",
        "ingredients": [
            "1 cup yellow onions, chopped\r",
            "2 clove garlic, minced\r",
            "1\/8 cup good olive oil\r",
            "1\/2 teaspoon dried oregano\r",
            "1 1\/2 teaspoon kosher salt\r",
            "1 teaspoon freshly ground black pepper\r",
            "4 carrots, medium-diced\r",
            "3 small red boiling potatoes, unpeeled and medium-diced\r",
            "1 pound dried split green peas\r",
            "8 cup chicken stock"
        ],
        "tags": [
            "main",
            "peas",
            "soup"
        ]
    },
    "id44": {
        "id": "id44",
        "name": "Wild Mushroom Risotto",
        "source": "Bride and Groom First and Forever Cookbook by Barber and Whiteford",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 2700,
        "servings": 2,
        "comments": "",
        "calories": 1508,
        "fat": 70,
        "satfat": 20,
        "carbs": 166,
        "fiber": 8,
        "sugar": 20,
        "protein": 48,
        "instructions": "Bring the stock to a simmer in a small saucepan over medium-high heat. Reduce the heat to low, cover, and keep the stock hot.\r\n\r\nHeat the olive oil in a large heavy-bottomed saucepan over medium-high heat. Add the onion and saute, stirring frequently with a wooden spoon for 2 minutes. Add the mushrooms and cook until tender and slightly brown, about 8 minutes. Add the garlic and cook for 2 minutes more. Add the rice and stir well, about 30 seconds. Add the wine and simmer, stirring constantly until the liquid is absorbed, 2 to 3 minutes. Add 3\/4 cup of the hot stock, reduce the heat to medium, and cook, stirring frequently, until the stock is absorbed. Add the remaining hot stock 3\/4 cup at a time, stirring frequently and allowing each addition to be fully absorbed before adding more, until the rice is just tender and the risotto is creamy. The total cooking time is 20 to 25 minutes.\r\n\r\nStir in 1\/4 cup cheese, the thyme, and butter. If the rice appears dry, add up to 1\/4 cup water to loosen the risotto slightly. Season with salt and pepper to taste.\r\n\r\nDivide the risotto between 2 large bowls and drizzle with truffle oil, if desired. Sprinkle with the remaining 2 tablespoons cheese and the chives.",
        "ingredients": [
            "3 1\/2 cup vegetable stock (or chicken stock)\r",
            "2 1\/2 tablespoon olive oil\r",
            "1 small yellow onion, diced\r",
            "8 oz shiitake or cremini mushrooms, cleaned and sliced (if using shiitakes, discard stems)\r",
            "1 tbsp garlic, roughly chopped\r",
            "3\/4 cup arborio rice\r",
            "1\/2 cup dry white wine\r",
            "3\/8 cup Parmesan cheese, grated, divided use\r",
            "1\/2 tsp thyme\r",
            "1 tbsp unsalted butter\r",
            "Salt and freshly ground pepper\r",
            "Truffle oil, for drizzling, optional\r",
            "1 tbsp parsley, chopped"
        ],
        "tags": [
            "main",
            "risotto",
            "mushrooms",
            "vegetarian"
        ]
    },
    "id45": {
        "id": "id45",
        "name": "Roasted Salmon with Walnut-Pepper Relish",
        "source": "Food Network Magazine October 2011",
        "preptime": 1200,
        "waittime": 0,
        "cooktime": 900,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Make the relish: preheat the oven to 350. Spread the walnuts on a baking sheet and bake until toasted 7 to 10 minutes. Let cool, then finely chop and transfer to a bowl. Add the cayenne, lemon juice, honey, roasted red pepper, walnut oil, olive oil and parsley. Add salt and black pepper to taste and toss to combine. (The relish can be made up to 1 day ahead; cover and refrigerate.)\r\n\r\n2. Make the salmon: Raise the oven temperature to 425. Combine the remaining olive oil and parsley, the chives, lemon zest, salt and black pepper to taste in a bowl. Rub the herb mixture *all* over the salmon. Lay skin-side down in a baking dish and roast until just cooking through, 12 to 14 minutes (for 3 lbs). Let rest 5 minutes, then transfer to a platter and top with the relish.",
        "ingredients": [
            "1\/2 cup walnuts\r",
            "Pinch of cayenne pepper\r",
            "1 tbsp lemon juice\r",
            "1 tsp honey\r",
            "2 tbsp diced roasted red pepper\r",
            "1 tbsp walnut oil\r",
            "1 tbsp extra-virgin olive oil\r",
            "2 tbsp parsley, chopped\r",
            "1\/2 tsp salt\r",
            "black pepper\r",
            "<hr>\r",
            "1 tbsp extra-virgin olive oil\r",
            "2 tbsp parsley, chopped\r",
            "2 tbsp chives, chopped\r",
            "1 tsp lemon zest\r",
            "1\/2 tsp salt\r",
            "black pepper\r",
            "2 lb salmon filet (about 1.5 inches thick)"
        ],
        "tags": [
            "salmon",
            "main"
        ]
    },
    "id46": {
        "id": "id46",
        "name": "Brown rice, chickpea, feta, and mint salad",
        "source": "Martha Stewart Living September 2011",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 996,
        "fat": 60,
        "satfat": 18,
        "carbs": 138,
        "fiber": 10,
        "sugar": 8,
        "protein": 36,
        "instructions": "1. Mix rice with 1 tbsp lemon juice while warm.\r\n\r\n2. Combine rice and chickpeas in a bowl. Stir in lemon zest, remaining juice, and oil. Let cool.\r\n\r\n3. Stir in cheese, tomatoes, mint, and onion. Season with salt. Refrigerate until ready to serve.\r\n\r\nCan be refrigerated for up to 2 days.",
        "ingredients": [
            "1 1\/2 cup cooked brown rice\r",
            "2 1\/2 tbsp lemon juice\r",
            "1 cup chickpeas, drained and rinsed\r",
            "2 tsp lemon zest\r",
            "3 tbsp olive oil\r",
            "1\/2 cup feta cheese, crumbled\r",
            "1\/2 cup grape or cherry tomatoes, halved\r",
            "1\/2 cup fresh mint\r",
            "1\/4 small red onion, chopped\r",
            "Salt"
        ],
        "tags": [
            "rice",
            "salad",
            "main"
        ]
    },
    "id49": {
        "id": "id49",
        "name": "Greek yogurt with homemade honeycomb",
        "source": "Gordon Ramsay",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. For the honeycomb: Line a shallow baking tray with parchment paper. Place the honey, liquid glucose, water and sugar in a large heavy-based saucepan and heat gently, stirring occasionally until the sugar dissolves. Increase the heat and cook until the mixture starts to turn a light golden colour. Mix in the baking soda. The mixture will erupt into a foaming mass. Pour immediately into the prepared baking tray.\r\n\r\n2. Leave to cool, then place in the fridge to set. This takes approx 6-10 mins. Break up with the end of a rolling pin and store in an airtight jar if not using immediately.\r\n\r\n3. Using a blender, blitz the raspberries and blueberries together with little caster sugar until smooth. Add a drop of lavender essence. Strain the mixture through a sieve to create a fresh coulis. Taste to check consistency and flavour, add a spoonful of water or sugar as necessary.\r\n\r\n4. Lightly mix almost all of the honeycomb through the yoghurt. Spoon into individual serving glasses and pour the coulis on top. Garnish with lavender flowers and a sprinkling of the remaining honeycomb. Serve immediately.",
        "ingredients": [
            "600 ml Greek yogurt\r",
            "100 g blueberries\r",
            "100 g raspberries\r",
            "2 tsp caster sugar\r",
            "Lavender essence, suitable for culinary use\r",
            "Dried lavender flowers, suitable for culinary use\r",
            "75 g clear honey\r",
            "140 g liquid glucose\r",
            "400 g sugar\r",
            "5 tbsp water\r",
            "2 tbsp baking powder"
        ],
        "tags": [
            "dessert",
            "candy",
            "untried"
        ]
    },
    "id50": {
        "id": "id50",
        "name": "Cocktail Sauce",
        "source": "Ina Garten",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 6,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Combine all ingredients.",
        "ingredients": [
            "1\/2 cup chili sauce (American, like Heinz)\r",
            "1\/2 cup ketchup\r",
            "3 tablespoon prepared horseradish\r",
            "2 teaspoon fresh lemon juice\r",
            "1\/2 teaspoon Worcestershire sauce\r",
            "1\/4 teaspoon hot sauce"
        ],
        "tags": [
            "condiment",
            "sauce",
            "components"
        ]
    },
    "id51": {
        "id": "id51",
        "name": "Heinz Chili Sauce",
        "source": "All over the internet",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Whisk all the ingredients together in a small saucepan, place over medium heat.\r\n\r\nWhen mixture begins to bubble reduce heat to low and simmer for 30 minutes. Cover and cool. Refrigerate when cold",
        "ingredients": [
            "1 cup tomato puree\r",
            "2 tablespoon agave nectar\r",
            "1\/4 cup white vinegar\r",
            "2 teaspoon dried onion flakes\r",
            "2 teaspoon granulated sugar\r",
            "1 teaspoon salt\r",
            "1 teaspoon lemon juice\r",
            "1\/8 teaspoon garlic powder"
        ],
        "tags": [
            "copycat",
            "condiment",
            "sauce",
            "components"
        ]
    },
    "id52": {
        "id": "id52",
        "name": "Spinach souffle",
        "source": "http:\/\/www.bbc.co.uk\/food\/recipes\/spinachsouffle_74749",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 900,
        "fat": 78,
        "satfat": 16,
        "carbs": 22,
        "fiber": 6,
        "sugar": 4,
        "protein": 44,
        "instructions": "Preheat the oven to 425F with the pan in the oven, and toast the pine nuts. \r\n\r\nWhisk the egg whites in a clean bowl to form stiff peaks. In a separate bowl, mix the egg yolks with the spinach, tomato, goat cheese, salt, and pepper to combine. Gently fold the egg whites into the spinach mixture. \r\n\r\nSpray the hot pan with oil, then spoon the mixture in and sprinkle with the pine nuts.\r\n\r\nBake in the oven for 10 minutes, or until well risen, golden, and firm. Serve.\r\n\r\nRather than fresh spinach, one can use 3.5oz per serving cooked spinach, chopped or pureed.",
        "ingredients": [
            "4 eggs, separated\r",
            "4 cup spinach, chopped fine\r",
            "2 sundried tomatoes, chopped fine\r",
            "1\/4 cup feta or goat cheese, crumbled\r",
            "1\/4 tsp salt\r",
            "1\/4 tsp pepper, or to taste\r",
            "1\/2 cup pine nuts, toasted"
        ],
        "tags": [
            "spinach",
            "breakfast"
        ]
    },
    "id53": {
        "id": "id53",
        "name": "Roasted Shallot Vinaigrette",
        "source": "http:\/\/www.myrecipes.com\/recipe\/garden-herb-salad-with-roasted-shallot-vinaigrette-10000001197173\/",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 1,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat oven to 400°.\r\nWrap shallot in foil. Bake at 400° for 35 minutes; cool for 10 minutes. Peel and mince. Combine shallot, vinegar, oil, sugar, mustard, salt, and pepper in a large bowl; stir well with a whisk.",
        "ingredients": [
            "1 medium shallot, peeled\r",
            "2 tablespoon red wine vinegar\r",
            "1 tablespoon extravirgin olive oil\r",
            "1 teaspoon sugar\r",
            "1 teaspoon Dijon mustard\r",
            "1\/4 teaspoon salt\r",
            "1\/4 teaspoon black pepper"
        ],
        "tags": [
            "dressing",
            "components"
        ]
    },
    "id55": {
        "id": "id55",
        "name": "Peanut Noodle Salad",
        "source": "Food Network Magazine Nov 2011",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 600,
        "servings": 4,
        "comments": "",
        "calories": 1908,
        "fat": 80,
        "satfat": 12,
        "carbs": 200,
        "fiber": 12,
        "sugar": 48,
        "protein": 40,
        "instructions": "Thinly slice the bell pepper and scallions.  Roughly chop the basil, cilantro, mint, and peanuts.\r\n\r\nCook noodles according to package instructions.  Transfer to a serving bowl.\r\n\r\nWhisk the lime juice soy sauce, peanut butter, brown sugar, and vegetable oil in a medium bowl until smooth.  Pour the dressing over the noodles.  (If possible, do this when the noodles are hot - it helps melt the peanut butter, which will still be chunky in the dressing.)  \r\n\r\nAdd the bell pepper , scallions, basil, cilantro, and mint and toss to combine.  Season with salt and sprinkle with the peanuts.",
        "ingredients": [
            "8 ounce rice vermicelli noodles\r",
            "6 tbsp lime juice\r",
            "3 tbsp soy sauce, low-sodium\r",
            "3 tbsp peanut butter, creamy\r",
            "3 tbsp dark brown sugar\r",
            "3 tbsp vegetable oil\r",
            "<hr>",
            "1 red bell pepper, small and thinly sliced\r",
            "1\/2 cup green onions\r",
            "1\/2 cup basil\r",
            "1\/2 cup cilantro\r",
            "1\/2 cup mint\r",
            "kosher salt\r",
            "1\/3 cup roasted peanuts"
        ],
        "tags": [
            "salad",
            "asian",
            "main"
        ]
    },
    "id57": {
        "id": "id57",
        "name": "Artichoke, Leek, and Potato Casserole",
        "source": "Martha Stewart's Everyday Food October 2011",
        "preptime": 1500,
        "waittime": 0,
        "cooktime": 2700,
        "servings": 6,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat oven to 425°.\r\n\r\nIn a large skillet, heat 1 tbsp oil over medium-high.  Add leeks and celery; cook until softened, 8 minutes.  Add artichokes, broth, and cheese and stir to combine.  Remove skillet from heat, add lemon juice, and season with salt and pepper.\r\n\r\nBrush a 1 1\/2-quart baking dish with oil.  Arrange half the potato slices in a single layer, overlapping slightly; season with salt and pepper.  Top with artichoke mixture and smooth top . Layer with remaining potatoes, brush with 2 tsp oil, and season with salt and pepper.\r\n\r\nBake until sauce is bubbling and potatoes are golden and tender, 35 to 40 minutes.  Let cool 10 minutes before serving.",
        "ingredients": [
            "1 tbsp olive oil\r",
            "2 tsp olive oil\r",
            "2 leeks, white and green parts only; sliced into thin half-moons and rinsed well\r",
            "3 celery stalks, thinly sliced\r",
            "18 oz frozen artichoke hearts, thawed, squeezed, and coarsely chopped\r",
            "1\/2 cup chicken broth\r",
            "8 oz Neufchatel cheese, room temperature\r",
            "2 tbsp lemon juice\r",
            "course salt and ground pepper\r",
            "2 medium russet potatoes, very thinly sliced"
        ],
        "tags": [
            "main",
            "vegetarian"
        ]
    },
    "id58": {
        "id": "id58",
        "name": "Broccoli with Parmesan and Walnuts",
        "source": "Martha Stewart's Everyday Food October 2011",
        "preptime": 600,
        "waittime": 0,
        "cooktime": 600,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a large skillet, heat olive oil over medium-high.  Add broccoli, trimmed and cut into florets, and cook until broccoli begins to brown, 4 minutes.  Add garlic and cook, stirring occasionally, until broccoli is crisp and tender and garlic begins to brown, 3 minutes.\r\n\r\nAdd red pepper flakes, season with salt and pepper, and transfer to serving bowl.  Toss with lemon zest, lemon juice, parmesan, and walnuts.  Serve warm or at room temperature.",
        "ingredients": [
            "2 tbsp extra-virgin olive oil\r",
            "1 head broccoli\r",
            "1 clove garlic, thinly sliced\r",
            "1\/4 tsp red pepper flakes\r",
            "salt and pepper\r",
            "2 tsp grated lemon zest\r",
            "1 tbsp fresh lemon juice\r",
            "1\/4 cup parmesan, grated\r",
            "1\/2 cup walnuts, toasted and chopped"
        ],
        "tags": [
            "sides"
        ]
    },
    "id63": {
        "id": "id63",
        "name": "Emeril's strawberry lemonade",
        "source": "Everyday Food June 2011",
        "preptime": 600,
        "waittime": 2700,
        "cooktime": 120,
        "servings": 6,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. In a medium saucepan, bring water and sugar to a boil over medium-high. Reduce to a simmer and cook, stirring occasionally, until sugar dissolves, 2 minutes. Transfer to a pitcher and refrigerated until cool, about 45 minutes. Add lemon juice and stir to combine.\r\n\r\n2. In a blender, puree strawberries until smooth. Pour through a fine-mesh sieve into a pitcher with lemon syrup, pressing on solid. Stir well to combine.\r\n\r\n3. To serve, stir in seltzer and divide among ice-filled glasses. Trop with lemon slices and mint.",
        "ingredients": [
            "2 cup water\r",
            "1 cup sugar\r",
            "1 cup fresh lemon juice, (about 6 lemons=1 cup juice)\r",
            "1 lemon, sliced for serving\r",
            "1 pound strawberries, hulled and halved (about  cups)\r",
            "16 oz seltzer, chilled\r",
            "mint, for serving"
        ],
        "tags": [
            "drink",
            "untried"
        ]
    },
    "id64": {
        "id": "id64",
        "name": "Pizza bianca",
        "source": "Everyday Food June 2011",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 1968,
        "fat": 96,
        "satfat": 36,
        "carbs": 212,
        "fiber": 8,
        "sugar": 0,
        "protein": 104,
        "instructions": "Preheat oven to 500. Lightly dust a work surface, rolling pin, and a baking sheet with flour. Roll dough out to a 13-inch round and transfer to sheet.\r\n\r\nIn a small bowl, stir together ricotta, oil and garlic; season with salt and pepper. Spread ricotta mixture on dough, leaving a 1\/2-inch border. Top with mozzarella, then Parmesan. Brush oil on edge of dough. Bake until crust is golden and cheese is melted and browned in spots, 12 to 14 minutes. \r\n\r\nIn a small bowl, toss arugula with oil and season to taste with salt and pepper. Top pizza with arugula and serve.",
        "ingredients": [
            "all-purpose flour, for dusting and rolling\r",
            "1 pound pizza dough, thawed if frozen\r",
            "1 teaspoon extra-virgin olive oil, for brushing\r",
            "<hr>\r",
            "1\/2 cup whole-milk ricotta cheese\r",
            "1 tablespoon extra-virgin olive oil\r",
            "1 garlic clove, minced\r",
            "salt and freshly ground pepper\r",
            "<hr>\r",
            "6 oz mozzarella, shredded\r",
            "1 oz Parmesan, grated (or Pecorino Romano)\r",
            "2 oz baby arugula\r",
            "1 tsp extra-virgin olive oil"
        ],
        "tags": [
            "pizza",
            "vegetarian",
            "main"
        ]
    },
    "id65": {
        "id": "id65",
        "name": "Smoky Sweet-Potato Soup",
        "source": "Martha Stewart Living October 2011",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 10,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Heat oil in a large pot over medium heat.  Cook garlic and leek until soft and translucent, about 4 minutes.  Add apple, celery, and ginger, and cook for 3 minutes.  Add sweet potatoes and stock, and simmer until sweet potatoes are tender, about 15 minutes.  \r\n\r\nAdd chipotle chiles.  Puree until smooth.  Season with salt and pepper.  Sprinkle with pepitas before serving.",
        "ingredients": [
            "3 tbsp olive oil\r",
            "3 clove garlic\r",
            "1 small leek, white and pale-green parts only, thinly slice and rinsed well\r",
            "1 tart green apple, cut into 1\" chunks\r",
            "1 celery stalk, thinly sliced\r",
            "1 tsp ginger, finely grated\r",
            "2 lb sweet potatoes, peeled and cut into 1\" cubes\r",
            "6 cup chicken stock\r",
            "1\/2 chipotle in adobo sauce\r",
            "salt and pepper\r",
            "1\/2 cup salted pepitas"
        ],
        "tags": [
            "soup",
            "main"
        ]
    },
    "id66": {
        "id": "id66",
        "name": "Green goddess dressing",
        "source": "Everyday Food June 2011",
        "preptime": 600,
        "waittime": 0,
        "cooktime": 0,
        "servings": 16,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a medium bowl, whisk together buttermilk, sour cream, and mayonnaise. Whisk in remaining ingredients. Season to taste with salt and pepper.",
        "ingredients": [
            "1 cup buttermilk\r",
            "1\/2 cup sour cream\r",
            "1\/4 cup mayonnaise\r",
            "1\/2 avocado, mashed until smooth\r",
            "1\/4 cup fresh chives, finely chopped\r",
            "2 tbsp fresh lemon juice\r",
            "2 tbsp fresh parsley, chopped\r",
            "Salt and freshly ground pepper"
        ],
        "tags": [
            "dressing",
            "components",
            "untried"
        ]
    },
    "id67": {
        "id": "id67",
        "name": "Creamy roasted garlic dressing",
        "source": "Everyday Food June 2011",
        "preptime": 2700,
        "waittime": 0,
        "cooktime": 0,
        "servings": 16,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a medium bowl, whisk together buttermilk, sour cream, and mayonnaise. Whisk in remaining ingredients. Season to taste with salt and pepper.",
        "ingredients": [
            "1 cup buttermilk\r",
            "1\/2 cup sour cream\r",
            "1\/4 cup mayonnaise\r",
            "1 small head roasted garlic, skins removed and cloves mashed until smooth\r",
            "Salt and freshly ground pepper"
        ],
        "tags": [
            "dressing",
            "components",
            "untried"
        ]
    },
    "id68": {
        "id": "id68",
        "name": "Creamy ranch dressing",
        "source": "Everyday Food June 2011",
        "preptime": 600,
        "waittime": 0,
        "cooktime": 0,
        "servings": 16,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Whisk together all ingredients in bowl. Season to taste with salt and pepper.",
        "ingredients": [
            "1 cup buttermilk\r",
            "1\/2 cup sour cream\r",
            "1\/4 cup mayonnaise\r",
            "1 1\/2 tsp fresh thyme, chopped\r",
            "1 garlic clove, minced\r",
            "Pinch cayenne pepper\r",
            "Salt and freshly ground pepper"
        ],
        "tags": [
            "dressing",
            "components",
            "untried"
        ]
    },
    "id69": {
        "id": "id69",
        "name": "Creamy blue cheese dressing",
        "source": "Everyday Food June 2011",
        "preptime": 300,
        "waittime": 0,
        "cooktime": 0,
        "servings": 16,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Whisk together all ingredients in a bowl. Season to taste with salt and pepper.",
        "ingredients": [
            "1 cup buttermilk\r",
            "1\/2 cup sour cream\r",
            "1\/4 cup mayonnaise\r",
            "3 oz blue cheese, crumbled\r",
            "Salt and freshly ground pepper"
        ],
        "tags": [
            "dressing",
            "components",
            "untried"
        ]
    },
    "id70": {
        "id": "id70",
        "name": "Creamy peppercorn-Parmesan dressing",
        "source": "Everyday Food June 2011",
        "preptime": 300,
        "waittime": 0,
        "cooktime": 0,
        "servings": 16,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Whisk together all ingredients.",
        "ingredients": [
            "1 cup buttermilk\r",
            "1\/2 cup sour cream\r",
            "1\/4 cup mayonnaise\r",
            "2 oz Parmesan, finely grated\r",
            "1 tsp pepper, coarsely ground\r",
            "Salt, to taste"
        ],
        "tags": [
            "dressing",
            "components",
            "untried"
        ]
    },
    "id73": {
        "id": "id73",
        "name": "Cherry-lime cups",
        "source": "Everyday Food June 2011",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 6,
        "comments": "",
        "calories": 2136,
        "fat": 102,
        "satfat": 60,
        "carbs": 294,
        "fiber": 6,
        "sugar": 0,
        "protein": 42,
        "instructions": "1. Make crust: preheat oven to 350. Lightly butter six standard muffin cups. In a food processor, process butter, flour, sugar, and salt until mixture resembles coarse meal. Add yolks and vanilla and process until dough comes together when pressed (dough will be crumbly).\r\n\r\n2. Divide dough into 6 pieces. Roll each into a ball and place in a muffin cup, pressing evenly into bottom and up sides. Place a paper cupcake liner into each muffin cup over dough and fill with pie weights or dried beans. Bake until edges are dry, 15 minutes. Carefully remove liners and weights; bake until crusts are dry and barely golden, 5 to 7 minutes.\r\n\r\n3. Meanwhile, make filling: in a medium bowl, whisk together eggs, flour, sugar, lime juice, and salt. Place 3 cherry halves into each crust and divide filling among each. Bake until filling is set, about 25 minutes. With the tip of a knife or small offset spatula, remove cups from pan. Let cool completely on a wire rack.\r\n\r\nTo store, refrigerate in an airtight container, up to 1 day.",
        "ingredients": [
            "7 tbsp unsalted butter, cold and cut into pieces, plus more for pan\r",
            "1 1\/3 cup all-purpose flour, spooned and leveled\r",
            "1\/4 cup sugar\r",
            "1\/2 tsp coarse salt\r",
            "2 egg yolks\r",
            "1\/2 tsp vanilla extract\r",
            "<hr>\r",
            "2 eggs, lightly beaten\r",
            "3 tbsp all-purpose flour\r",
            "2\/3 cup sugar\r",
            "5 tbsp fresh lime juice\r",
            "1\/4 tsp coarse salt\r",
            "9 cherries, halved and pitted"
        ],
        "tags": [
            "dessert",
            "lime"
        ]
    },
    "id74": {
        "id": "id74",
        "name": "Roasted salsa",
        "source": "Everyday Food June 2011",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 480,
        "servings": 3,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Heat broiler, with rack in top position. Place tomatoes, onion halves, jalapenos, and garlic in a single layer on a rimmed baking sheet.\r\n\r\n2. Broil until vegetables are blistered and slightly softened, rotating sheet and flipping vegetables frequently, 6 to 8 minutes (garlic may need to be removed earlier if it is browning too quickly.)\r\n\r\n3. Discard garlic skins. In a food processor, pulse garlic and vegetables until coarsely pureed. Add lime juice, season with salt and pepper, and pulse to combine.\r\n\r\n4. Transfer salsa to a bowl and stir in cilantro.\r\n\r\nYields 3 cups. Refrigerate up to 3 days or freeze up to 3 months.\r\n\r\nFor green salsa, use 1 1\/2 lbs tomatillos and omit lime juice.",
        "ingredients": [
            "1 1\/2 lb tomatoes\r",
            "1 medium white onion, halved\r",
            "3 jalapenos\r",
            "3 garlic cloves, unpeeled\r",
            "3 tbsp fresh lime juice\r",
            "salt and freshly ground pepper\r",
            "1\/4 cup fresh cilantro, chopped"
        ],
        "tags": [
            "salsa",
            "components",
            "appetizer",
            "untried"
        ]
    },
    "id75": {
        "id": "id75",
        "name": "Shrimp and edamame with lime",
        "source": "Everyday Food June 2011",
        "preptime": 1800,
        "waittime": 0,
        "cooktime": 480,
        "servings": 4,
        "comments": "",
        "calories": 1388,
        "fat": 28,
        "satfat": 4,
        "carbs": 120,
        "fiber": 20,
        "sugar": 0,
        "protein": 152,
        "instructions": "Cook rice according to package instructions. Meanwhile, in a large nonstick skillet, heat oil over medium-high. Add shrimp and garlic and cook, stirring occasionally, 4 minutes. Add edamame and scallion whites and cook until shrimp are opaque and garlic is golden, about 3 minutes. Add scallion greens ad lime juice and cook 1 minute. Season to taste with salt and pepper; serve with rice and lime wedges, if desired.",
        "ingredients": [
            "1 cup long-grain rice, such as jasmine or basmati\r",
            "1 tbsp extra-virgin olive oil\r",
            "1 1\/4 lb medium shrimp, peeled and deveined\r",
            "1 large clove garlic, minced\r",
            "2 cup frozen shelled edamame, thawed (from a 10 oz package)\r",
            "5 green onions, halved lengthwise and cut into 1-inch pieces, white and green parts separated\r",
            "1 tbsp fresh lime juice, plus wedges for serving (optional)\r",
            "salt and freshly ground pepper"
        ],
        "tags": [
            "shrimp",
            "seafood",
            "main"
        ]
    },
    "id79": {
        "id": "id79",
        "name": "Strawberries and cream bars",
        "source": "Everyday Food June 2011",
        "preptime": 1500,
        "waittime": 21600,
        "cooktime": 0,
        "servings": 12,
        "comments": "",
        "calories": 1680,
        "fat": 60,
        "satfat": 36,
        "carbs": 288,
        "fiber": 24,
        "sugar": 0,
        "protein": 36,
        "instructions": "1. In a blender, combine strawberries, 3\/4 cup sugar, and a pinch of salt and puree until smooth. Pour into a 9x13 baking dish. Transfer to freezer and scrape with a fork every 30 minutes until mixture is thick and slushy, 2 hours. Smooth top with rubber spatula.\r\n\r\n2. In a large bowl, using and electric mixer, beat egg whites on high until foamy. With mixer on medium, gradually add 3\/4 cup sugar. Increase speed to high and beat until stiff, glossy peaks form, 3 minutes. In another medium bowl, beat cream and vanilla on high until stiff peaks form, 1 to 2 minutes. With rubber spatula, gently fold whipped cream into egg white mixture. Pour over strawberry mixture and smooth top with rubber spatula. Freeze until firm, about 4 hours (or, covered, up to 3 days), before cutting into 12 squares.",
        "ingredients": [
            "2 lb strawberries, hulled, halved if large (6 cups)\r",
            "1 1\/2 cup sugar\r",
            "coarse salt\r",
            "7 egg whites\r",
            "2\/3 cup cold heavy cream\r",
            "1 tsp vanilla extract"
        ],
        "tags": [
            "dessert",
            "untried",
            "strawberries"
        ]
    },
    "id81": {
        "id": "id81",
        "name": "Frozen chocolate mousse trifles",
        "source": "Everyday Food June 2011",
        "preptime": 1500,
        "waittime": 10800,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 1188,
        "fat": 52,
        "satfat": 36,
        "carbs": 160,
        "fiber": 12,
        "sugar": 0,
        "protein": 36,
        "instructions": "1. In a medium bowl, toss together cake and brandy, if desired. In another medium bowl, using and electric mixer, beat egg whites on high until foamy. With mixer on medium, gradually add sugar. Increase speed to high and beat until stiff, glossy peaks form, 2 minutes. With a rubber spatula, gently fold cocoa powder into egg white mixture.\r\n\r\n2. In another medium bowl, beat cream on high until stiff peaks form, 3 minutes. Gently fold whipped cream into egg white mixture.\r\n\r\n3. Fill each of four small glasses with 1\/4 cup cake and top with heaping 1\/4 cup mousse. Repeat to make a second layer with remaining cake and mousse. Freeze until firm, 3 hours (or up to overnight). Let sit 10 minutes at room temperature, then finely grate chocolate over tops to serve.",
        "ingredients": [
            "2 cup chocolate angel food cake, crumbled (5 oz)\r",
            "1 tbsp brandy (optional)\r",
            "4 egg whites\r",
            "1\/2 cup sugar\r",
            "1\/3 cup unsweetened cocoa powder, sifted\r",
            "1\/2 cup heavy cream, cold\r",
            "1\/2 oz bittersweet chocolate"
        ],
        "tags": [
            "dessert",
            "chocolate",
            "untried"
        ]
    },
    "id82": {
        "id": "id82",
        "name": "Frozen lemon souffle",
        "source": "Everyday Food June 2011",
        "preptime": 1500,
        "waittime": 23400,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 1732,
        "fat": 100,
        "satfat": 48,
        "carbs": 196,
        "fiber": 0,
        "sugar": 0,
        "protein": 56,
        "instructions": "1. Wrap outside of a 3.5-cup souffle mold or four 6-ounce ramekins with parchment, extending 2 to 3 inches above rim (it should fit snugly). Secure with tape, set aside.\r\n\r\n2. In a medium saucepan, whisk together granulated sugar, lemon zest and juice, egg yolks, and salt over medium-high. Cook, whisking constantly, until mixture is thick enough to coat the back of a spoon and small bubbles form around edge of pan, about 5 minutes (do not boil). Immediately remove from heat while continuing to whisk. Pour through a fine-mesh sieve into a heatproof bowl, pressing on lemon curd with a rubber spatula.\r\n\r\n3. Place plastic wrap directly against surface of curd and refrigerate until cool, about 30 minutes (or up to overnight).\r\n\r\n4. In a large bowl, using an electric mixer, beat egg whites on high until stiff peaks form, 2 minutes. Gently fold egg whites into cooled lemon curd. In the same large bowl, beat cream on high until stiff peaks form, 1 to 2 minutes. Gently fold whipped cream into lemon curd mixture. Pour into mold and freeze until firm, 6 hours (or up to overnight). To serve, remove parchment, top with raspberries and dust with confectioners' sugar.",
        "ingredients": [
            "1 cup granulated sugar\r",
            "1 tbsp lemon zest, grated\r",
            "3\/4 cup lemon juice\r",
            "8 large eggs, whites and yolks separated\r",
            "1\/4 tsp salt\r",
            "2\/3 cup heavy cream, cold\r",
            "1 1\/2 cup raspberries, about 6 oz\r",
            "confectioners' sugar, for dusting"
        ],
        "tags": [
            "lemon",
            "dessert",
            "untried"
        ]
    },
    "id83": {
        "id": "id83",
        "name": "Coconut lime semifreddo",
        "source": "Everyday Food June 2011",
        "preptime": 1800,
        "waittime": 21600,
        "cooktime": 0,
        "servings": 12,
        "comments": "",
        "calories": 3684,
        "fat": 276,
        "satfat": 204,
        "carbs": 288,
        "fiber": 12,
        "sugar": 0,
        "protein": 48,
        "instructions": "1. Line a 4.5x8.5-inch loaf pan with parchment, leaving a 4-inch overhang on all sides. Prepare a large bowl of ice water. In a medium saucepan, combine coconut milk and condensed milk and bring to a boil over  high. Reduce heat and cook at a rapid simmer, stirring frequently until thickened, 10 minutes. Remove from heat and stir in lime zest and salt. Place saucepan in bowl of ice water and stir until mixture is cool, 4 minutes.\r\n\r\n2. In a large bowl, using an electric mixer, beat cream on high until stiff peaks from, 2 minutes. Gently fold whipped cream into coconut milk mixture. Pour into loaf pan; evenly sprinkle coconut over top. Freeze until firm, 6 hours (or covered, up to 3 days). Let sit 20 minutes at room temperature. Invert onto a serving platter; peel away parchment. Layer mango on top and serve.",
        "ingredients": [
            "1 13.5oz can unsweetened coconut milk\r",
            "1 14oz can sweetened condensed milk\r",
            "1 tbsp lime zest, grated\r",
            "1\/4 tsp coarse salt\r",
            "1 1\/2 cup heavy cream, cold\r",
            "1\/2 cup sweetened shredded coconut, toasted\r",
            "1\/2 ripe mango, thinly sliced"
        ],
        "tags": [
            "icecream",
            "coconut",
            "untried",
            "dessert"
        ]
    },
    "id84": {
        "id": "id84",
        "name": "Sweet cherry granita",
        "source": "Everyday Food June 2011",
        "preptime": 600,
        "waittime": 21600,
        "cooktime": 0,
        "servings": 12,
        "comments": "",
        "calories": 1320,
        "fat": 0,
        "satfat": 0,
        "carbs": 276,
        "fiber": 24,
        "sugar": 0,
        "protein": 12,
        "instructions": "1. In a blender, puree cherries, sugar, and lemon juice until sugar is dissolved and mixture is smooth. Pour into an 8-inch square baking dish. Freeze 6 hours, scraping with fork every hour (mixture should be icy and fluffy).\r\n\r\n2. To serve, pour 1 tablespoon liqueur into each of 12 small bowls or glasses. Top with 1\/2 cup granita and a small dollop of whipped cream, if desired. Serve immediately.",
        "ingredients": [
            "2 lb cherries, stemmed and pitted, or 3 bags (12 oz each) frozen cherries, thawed\r",
            "1\/2 cup sugar\r",
            "1 tbsp lemon juice\r",
            "3\/4 cup almond-flavored liqueur, such as Disaronno (optional)\r",
            "whipped cream or mascarpone cheese (optional), for serving"
        ],
        "tags": [
            "granita",
            "dessert",
            "untried",
            "cherries"
        ]
    },
    "id86": {
        "id": "id86",
        "name": "Raspberry-lemon thumbprint cookies",
        "source": "Emeril Lagasse",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat the oven to 350 degrees F. Lightly butter 2 large baking sheets.\r\n\r\nIn a small bowl, combine the jam and Chambord. Stir to combine.\r\n\r\nIn a medium bowl, combine the flour, baking powder, and salt and whisk to blend.\r\n\r\nIn a large bowl using an electric mixer, beat the butter and sugar until light and creamy. Beat in the egg yolks, lemon zest, lemon juice and vanilla. Add the flour mixture in 2 additions and beat just until moist clumps form. Gather the dough together into a ball.\r\n\r\nPinch off the dough to form 1-inch balls. Place on the prepared baking sheets, spacing 1-inch apart. Use your floured index finger or 1\/2 teaspoon measuring spoon to create depressions in the center of each ball. Fill each indentation with nearly 1\/2 teaspoon of the jam mixture. Bake until golden brown, about 20 minutes.\r\n\r\nTransfer the cookies to wire racks to cool completely.\r\n\r\nYield: 2 dozen",
        "ingredients": [
            "1\/2 cup raspberry jam or jelly\r",
            "1 tablespoon Chambord or kirsch\r",
            "2 1\/4 cup all-purpose flour\r",
            "1 teaspoon baking powder\r",
            "1\/4 teaspoon salt\r",
            "1 cup butter, at room temperature\r",
            "2\/3 cup sugar\r",
            "2 egg yolks\r",
            "1 tablespoon lemon zest\r",
            "1 tablespoon lemon juice\r",
            "1 teaspoon pure vanilla extract"
        ],
        "tags": [
            "cookies",
            "raspberry",
            "dessert"
        ]
    },
    "id88": {
        "id": "id88",
        "name": "Glazed carrots",
        "source": "Martha Stewart Living Nov 2011",
        "preptime": 600,
        "waittime": 0,
        "cooktime": 300,
        "servings": 8,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Melt butter in large saute pan over medium heat. Add carrots, orange juice, and thyme; cook, stirring occasionally, until carrots are tender, about 5 minutes. Season with salt and pepper. Serve warm.",
        "ingredients": [
            "2 tbsp unsalted butter\r",
            "2 lb baby carrots, trimmed\r",
            "1 1\/2 cup fresh orange juice, from 4-5 oranges\r",
            "1\/2 tsp fresh thyme leaves\r",
            "Salt and freshly ground pepper"
        ],
        "tags": [
            "sides",
            "untried"
        ]
    },
    "id89": {
        "id": "id89",
        "name": "Baby Brussels sprouts with wild rice and pecans",
        "source": "Martha Stewart Living Nov 2011",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 8,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Bring a large saucepan of water to a boil. Stir in wild rice, reduce to a simmer, and cook (uncovered) until tender, about 40 minutes. Drain rice.\r\n\r\n2. Meanwhile, melt 2 tbsp (or 2\/3) of the butter in a large saute pan over medium heat. Toast pecans, stirring frequently, until fragrant, about 5 minutes. With a slotted spoon, transfer pecans to a plate, and season with salt.\r\n\r\n3. Add remaining butter, the pearl onions, and the water to pan; simmer until water is evaporated and onions are tender and pale golden, about 10 minutes.\r\n\r\n4. Trim Brussels sprouts, then score an X into the bottom of each one. Place in a  steaming basket or colander set in a saucepan filled with 1 inch of water. Bring water to a boil, then reduce to a simmer; cover and steam until just tender enough to pierce with the tip of a sharp knife, 6 to 8 minutes.\r\n\r\n5. In a bowl, whisk together sherry vinegar, maple syrup, and mustard. Add rice, Brussels sprouts, and onions; toss to coat, and season with salt and pepper. Coarsely chop pecans and add just before serving, warm or at room temperature.",
        "ingredients": [
            "2 cup wild rice\r",
            "3 tbsp unsalted butter, divided use\r",
            "3\/4 cup pecans\r",
            "Salt\r",
            "5 oz red pearl onions, peeled and halved through root end (about 1 cup=5 oz)\r",
            "1\/2 cup water\r",
            "1 lb baby Brussels sprouts\r",
            "2 tbsp sherry vinegar\r",
            "3 tbsp pure maple syrup\r",
            "2 tsp Dijon mustard"
        ],
        "tags": [
            "vegetarian",
            "main"
        ]
    },
    "id90": {
        "id": "id90",
        "name": "Pumpkin mousse",
        "source": "Martha Stewart Living Nov 2011",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 10,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. In a small saucepan, sprinkle gelatin over the cold water, and let soften 5 minutes. Cook softened gelatin over medium heat, swirling pan, just until gelatin is dissolved; do not let boil. Let cool completely.\r\n\r\n2. Place pumpkin puree in a large bowl. Stir in softened gelatin, then add egg yolks, maple syrup, nutmeg, vanilla, ginger, allspice, salt, white pepper, and rum. Whisk until fully blended.\r\n\r\n3. With an electric mixer on medium speed, whisk egg whites and the sugar to soft peaks. Gently fold egg-white mixture into pumpkin mixture to combine. Whip heavy cream on medium high to stiff peaks, then gently but thoroughly fold into pumpkin mixture.\r\n\r\n4. Divide mousse among 8 to 10 glasses; refrigerate until set, at least 2 hours, or up to 1 day, covered with plastic wrap. If desired, top each with a dollop of sweetened whipped cream and a pastry leaf before serving.\r\n\r\nFood safety note: the eggs in this recipe are not cooked",
        "ingredients": [
            "1 envelope unflavored powdered gelatin\r",
            "1\/4 cup cold water\r",
            "5\/8 cup canned unsweetened pumpkin puree, 1\/2 cup plus 2 tbsp\r",
            "4 large eggs, separated\r",
            "3\/8 cup maple syrup, 1\/4 cup plus 2 tbsp\r",
            "1\/2 tsp pure vanilla extract\r",
            "1\/2 tsp ground ginger\r",
            "1\/2 tsp ground allspice\r",
            "1\/4 tsp salt\r",
            "Pinch of freshly ground white pepper\r",
            "2 tbsp dark rum\r",
            "1\/4 cup sugar\r",
            "1 cup heavy cream\r",
            "Sweetened whipped cream, for serving (optional)\r",
            "Pastry leaves for garnish (optional; see [Pate Brisee recipe](http:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=id101))"
        ],
        "tags": [
            "dessert",
            "pumpkin",
            "untried"
        ]
    },
    "id93": {
        "id": "id93",
        "name": "Salted caramel six layer chocolate cake",
        "source": "Martha Stewart Living Nov 2011",
        "preptime": 2700,
        "waittime": 3600,
        "cooktime": 2100,
        "servings": 12,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Preheat oven to 350F. Make the cake: butter three 9-inch round cake pans, and dust with flour, tapping out excess. Sift flour, granulated sugar, cocoa, baking soda, baking powder, and 1 1\/2 teaspoons salt into the bowl of a mixer. Beat on low speed until just combined. Raise speed to medium and add eggs, buttermilk, warm water, oil, and vanilla. Beat until smooth, about 3 minutes.\r\n\r\n2. Divide batter among pans. Bake until cakes are set and a toothpick inserted into the center of each comes out clean, about 35 minutes. Let cool in pans set on a wire rack for 15 minutes. Turn out cakes onto racks and let cool completely.\r\n\r\n3. Make the caramel: Combine granulated sugar, corn syrup, and water in a medium saucepan over high heat. Cook, without stirring, until mixture is dark amber, about 14 minutes. Remove from heat, and carefully pour in cream (mixture will bubble violently); stir until smooth. Return to heat, and cook until a candy thermometer reaches 238F, about 2 minutes. Pour caramel into a medium bowl, stir in 1 teaspoon coarse salt, and let cool slightly, about 15 minutes. Stir in butter, 1 tablespoon at a time. Let cool completely.\r\n\r\n4. Meanwhile, make the frosting: whisk together cocoa and warm water in a bowl until cocoa dissolves. Beat butter, confections' sugar, and a generous pinch of coarse salt in a clean bowl with a mixer on medium speed until pale and fluffy. Gradually beat in melted chocolate and then cocoa mixture until combined. Let stand for 30 minutes before using.\r\n\r\n5. Trim tops of cakes using a serrated knife to creat a level surface. Cut each in half horizontally to form 2 layers. Transfer 1 layer to a serving platter and spread 3\/4 cup caramel over top. Top with another cake layer, and repeat with remaining caramel and cake layers, leaving top uncovered. Refrigerate until set, about 1 hour.\r\n\r\n6. Frost top and sides of cake in a swirling motion. Sprinkle with sea salt.\r\n\r\nMake ahead: Caramel can be refrigerated for up to 3 days. Bring to room temperature before using. Cake layers can be refrigerated for up to 3 days (they actually taste better when refrigerated and have a better texture for stacking).\r\n\r\nStorage: Frosted cake can be refrigerated for up to 3 days.",
        "ingredients": [
            "Unsalted butter, room temperature, for pans\r",
            "3 cup all-purpose flour, plus more for pans\r",
            "3 cup granulated sugar\r",
            "1 1\/2 cup unsweetened Dutch-process cocoa powder\r",
            "1 tbsp baking soda\r",
            "1 1\/2 tsp baking powder\r",
            "Salt\r",
            "4 large eggs 1 1\/2 cups buttermilk\r",
            "1 1\/2 cup warm water\r",
            "5\/8 cup safflower oil, 1\/2 cup plus 2 tbsp\r",
            "2 tsp pure vanilla extract\r",
            "<hr>",
            "4 cup granulated sugar\r",
            "1\/4 cup light corn syrup\r",
            "1\/4 cup water\r",
            "2 cup heavy cream\r",
            "Salt\r",
            "2 stick unsalted butter, cold, cut into tablespoons\r",
            "<hr>",
            "3\/8 cup Dutch-process cocoa powder, 1\/4 cup plus 2 tbsp\r",
            "3\/8 cup warm water\r",
            "2 stick unsalted butter, room temperature\r",
            "1\/2 cup confectioners' sugar\r",
            "Salt\r",
            "1 lb semisweet chocolate, chopped, melted, and cooled\r",
            "Flaked sea salt, such as Maldon, for garnish"
        ],
        "tags": [
            "dessert",
            "cake",
            "untried"
        ]
    },
    "id95": {
        "id": "id95",
        "name": "Cranberry almond muffins",
        "source": "Martha Stewart Living Nov 2011",
        "preptime": 1200,
        "waittime": 600,
        "cooktime": 1200,
        "servings": 16,
        "comments": "",
        "calories": 2096,
        "fat": 48,
        "satfat": 16,
        "carbs": 384,
        "fiber": 32,
        "sugar": 208,
        "protein": 64,
        "instructions": "1. Preheat oven to 350F. Line 16 cups of two 12-cup muffin tins with baking cups and lightly coat each with cooking spray.\r\n2. Whisk together sugar, flours, baking soda, and salt in a large bowl. Whisk together milk, yogurt, eggs, and orange zest and juice in a medium bowl. Fold milk mixture into flour mixture, then gently fold in cranberries until combined.\r\n3. Spoon batter into baking cups until each is three-quarters full. Sprinkle with almonds. Bake until a toothpick inserted into the center of each comes out clean, about 20 minutes. Transfer pans to wire racks, and let cool for 10 minutes. Turn out muffins onto racks and let cool completely.",
        "ingredients": [
            "Vegetable oil cooking spray\r",
            "1 1\/4 cup sugar\r",
            "1 cup whole-wheat flour\r",
            "3\/4 cup all-purpose flour\r",
            "3\/4 cup almond flour\r",
            "1 tsp baking soda\r",
            "1\/4 tsp salt\r",
            "2\/3 cup nonfat milk\r",
            "2\/3 cup plain low-fat yogurt\r",
            "2 large eggs\r",
            "1 orange, zested and juiced\r",
            "1 cup cranberries, fresh or frozen\r",
            "1\/2 cup sliced almonds"
        ],
        "tags": [
            "muffins",
            "breakfast",
            "untried"
        ]
    },
    "id96": {
        "id": "id96",
        "name": "Hazelnut pear muffins",
        "source": "Martha Stewart Living Nov 2011",
        "preptime": 1200,
        "waittime": 600,
        "cooktime": 1200,
        "servings": 16,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Preheat oven to 350F. Line 16 cups of two 12-cup muffin tins with baking cups and lightly coat each with cooking spray.\r\n2. Whisk together sugar, flours, baking soda, and salt in a large bowl. Whisk together milk, yogurt, eggs, and orange zest and juice in a medium bowl. Fold milk mixture into flour mixture, then gently fold in pears until combined.\r\n3. Spoon batter into baking cups until each is three-quarters full. Sprinkle with hazelnuts. Bake until a toothpick inserted into the center of each comes out clean, about 20 minutes. Transfer pans to wire racks, and let cool for 10 minutes. Turn out muffins onto racks and let cool completely.",
        "ingredients": [
            "Vegetable oil cooking spray\r",
            "1 1\/4 cup sugar\r",
            "1 cup whole-wheat flour\r",
            "3\/4 cup all-purpose flour\r",
            "3\/4 cup hazelnut flour\r",
            "1 tsp baking soda\r",
            "1\/4 tsp salt\r",
            "2\/3 cup nonfat milk\r",
            "2\/3 cup plain low-fat yogurt\r",
            "2 large eggs\r",
            "1 orange, zested and juiced\r",
            "1 1\/2 Bosc pears, peeled, cored and chopped to make 2 cups\r",
            "1\/2 cup hazelnuts, coarsely chopped"
        ],
        "tags": [
            "muffins",
            "breakfast",
            "untried"
        ]
    },
    "id97": {
        "id": "id97",
        "name": "Hazelnut pastry dough",
        "source": "Martha Stewart Living Nov 2011",
        "preptime": 1200,
        "waittime": 4200,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Pulse flour, hazelnuts, and 1\/4 teaspoon salt in a food processor until combined. Add butter, and pulse until mixture resembles coarse meal, about 10 seconds. Drizzle 1\/4 cup ice water evenly over mixture and pulse until it just begins to hold together (dough should not be wet or sticky). If dough is too dry, add more water, 1 tablespoon at a time, and pulse.\r\n\r\n2. Divide dough in half, and shape each half into a rectangle. Wrap in plastic wrap. Refrigerate until firm, about 1 hour. Let stand for 10 minutes before rolling.\r\n\r\nMake ahead: Dough can be refrigerated overnight or frozen for up to 3 months. Let chilled dough stand at room temperature for 10 minutes and fozen dough thaw before using.",
        "ingredients": [
            "1 3\/4 cup all-purpose flour\r",
            "1\/2 cup toasted skinned hazelnuts, ground\r",
            "Salt\r",
            "2 stick unsalted butter, cut into pieces\r",
            "1\/4 cup ice water"
        ],
        "tags": [
            "pastry",
            "dessert",
            "components",
            "untried"
        ]
    },
    "id99": {
        "id": "id99",
        "name": "Pesto",
        "source": "Based on 'Pesto' from Betty Crocker's Cookbook, 9th ed.",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 10,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Place pine nuts in a skillet over medium-low heat. Stir or toss frequently until toasted. Cool before using.\r\n\r\nPlace basil, pine nuts, and garlic in food processor or blender. Pulse until finely chopped. With motor running, slowly drizzle in olive oil. Blend a few minutes, stopping occasionally to scrape sides, until smooth.\r\n\r\nStir in grated Parmesan. Taste for seasoning and add salt and pepper to taste, if desired. Yields about 1 1\/4 cup pesto.",
        "ingredients": [
            "1\/4 cup pine nuts\r",
            "2 cup firmly packed basil leaves\r",
            "3 clove garlic\r",
            "1\/2 cup best quality extra-virgin olive oil\r",
            "3\/4 cup freshly grated Parmesan cheese\r",
            "Salt and freshly ground pepper, to taste"
        ],
        "tags": [
            "pesto",
            "vegetarian",
            "components"
        ]
    },
    "id101": {
        "id": "id101",
        "name": "Pate brisee",
        "source": "Martha Stewart Living Nov 2011",
        "preptime": 900,
        "waittime": 3600,
        "cooktime": 0,
        "servings": 1,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Pulse flour, sugar, and salt in a food processor until combined. dd butter, and pulse until mixture resembles coarse meal, about 10 seconds. Drizzle 1\/4 cup ice water evenly over mixture. Pulse until mixture holds together when pressed between 2 fingers (dough should not be wet or sticky). If dough is too dry, add more water, 1 tablespoon at a time, and pulse.\r\n\r\n2. Shape dough into 1 large disk or 2 small disks, and wrap in plastic wrap. Refrigerate until firm, at least 1 hour. Dough can be refrigerated overnight or frozen for up to 3 months.\r\n\r\nTo make pastry leaves for garnishing: roll out dough to a 1\/4-inch thickness on a lightly floured surface and cut out leaves using floured leaf-shaped cookie cutters. Bake on a parchment-lined baking sheet at 350F, rotating sheet halfway throuh, until pale gold, about 12 minutes.",
        "ingredients": [
            "2 1\/2 cup all-purpose flour\r",
            "1 tbsp sugar\r",
            "1 tsp salt\r",
            "2 1\/4 stick unsalted butter, cold and cut into small pieces\r",
            "1\/4 to 1\/2 cup ice water"
        ],
        "tags": [
            "pastry",
            "components",
            "untried"
        ]
    },
    "id104": {
        "id": "id104",
        "name": "Tex-mex rice and black eyed peas",
        "source": "Food Network Magazine Nov 2011",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 2168,
        "fat": 88,
        "satfat": 32,
        "carbs": 264,
        "fiber": 44,
        "sugar": 32,
        "protein": 84,
        "instructions": "1. Cook the rice as the label directs. Meanwhile, heat the olive oil in a medium saucepan over medium-high heat. Add the salsa and cumin and cook, stirring, until the salsa is soft, about 5 minutes. Add the black-eyed peas, plus the liquid from one of the cans and 1\/4 cup water. Cook, stirring occasionally, until the beans are creamy and tender, about 12 minutes.\r\n\r\n2. Fluff the rice with a fork and divide among bowls. Add the spinach and cilantro to the black-eyed pea mixture and stir until wilted, about 1 minute; spoon evenly over the rice. Top each serving with a few avocado slices, some cheese and more salsa. Serve with sour cream or Greek yogurt, if desired.",
        "ingredients": [
            "1 cup uncooked brown rice\r",
            "1 tbsp extra-virgin olive oil\r",
            "1 cup fresh salsa, plus more for topping\r",
            "1\/2 tsp ground cumin\r",
            "2 14oz cans black-eyed peas, 1 undrained; 1 drained and rinsed\r",
            "3 cup baby spinach\r",
            "1\/4 cup fresh cilantro, chopped\r",
            "1 avocado, halved, pitted and sliced\r",
            "1 cup shredded cheddar cheese\r",
            "Sour cream or Greek yogurt, for serving (optional)"
        ],
        "tags": [
            "vegetarian",
            "main"
        ]
    },
    "id105": {
        "id": "id105",
        "name": "Baked eggs and beans on toast",
        "source": "Food Network Magazine Nov 2011",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 2236,
        "fat": 80,
        "satfat": 20,
        "carbs": 268,
        "fiber": 48,
        "sugar": 0,
        "protein": 116,
        "instructions": "1. Preheat the oven to 375F. Heat olive oil in a large ovenproof skillet over medium-high heat. Add the onion and cook, stirring, until golden, about 5 minutes. Add the tomato paste and cook, stirring, 1 more minute. Stir in the vinegar, honey mustard, Worcestershire sauce, water, and salt and pepper to taste. Bring to a simmer, then add the beans, plus the liquid from one of the cans. Cook until the beans are soft, about 5 more minutes.\r\n\r\n2. Make eight indentations in the bean mixture and crack an egg into each. Sprinkle with salt and pepper and transfer to the oven. Bake until the egg whites are set, 10 to 14 minutes. (For 2 servings, 8-9 minutes. Whites should still be slightly \"jiggly\" when you remove from oven.)\r\n\r\n3. Meanwhile, heat a large skillet over medium-high heat. Brush the bread with olive oil on both sides and toast in the skillet, 1 minute per side. Toss the tomatoes, parsley and remaining olive oil, and salt and pepper to taste in a bowl. Divide the toast among plates; top each with 2 eggs, some beans and the tomato salad.",
        "ingredients": [
            "1 1\/2 tbsp extra-virgin olive oil, plus more for brushing\r",
            "1\/2 small onion, chopped\r",
            "1 tbsp tomato paste\r",
            "2 tbsp apple cider vinegar\r",
            "1 tbsp honey mustard\r",
            "2 tsp Worcestershire sauce\r",
            "1\/2 cup water\r",
            "Kosher salt and freshly ground pepper\r",
            "2 can navy beans, 1 undrained; 1 drained and rinsed\r",
            "8 large eggs\r",
            "<hr>\r",
            "8 thick slices crusty bread\r",
            "2 cup grape tomatoes, halved\r",
            "1\/4 cup fresh parsley, chopped\r",
            "1\/2 tbsp olive oil"
        ],
        "tags": [
            "vegetarian",
            "main"
        ]
    },
    "id107": {
        "id": "id107",
        "name": "Warm shrimp and potato salad",
        "source": "Food Network Magazine Nov 2011",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 1800,
        "servings": 4,
        "comments": "",
        "calories": 1720,
        "fat": 96,
        "satfat": 24,
        "carbs": 94,
        "fiber": 12,
        "sugar": 0,
        "protein": 116,
        "instructions": "1. Preheat the oven to 400F. Toss the potatoes and bell pepper with olive oil, salt and pepper to taste in a shallow baking dish. Roast 15 minutes. Meanwhile, toss the shrimp with the garlic, oregano, paprika, olive oil, salt, and pepper to taste in a medium bowl.\r\n\r\n2. Add the shrimp to the baking dish. Roast, stirring once, until the shrimp are just cooked through and the potatoes are golden brown, 12 to 15 more minutes.\r\n\r\n3. Toss the romaine in a serving bowl with the lemon juice, olive oil, and salt and pepper to taste. Add the warm shrimp and vegetables and toss to combine. Top with the feta.",
        "ingredients": [
            "1 lb small red-skinned potatoes, halved\r",
            "1 red bell pepper, thinly sliced\r",
            "1 tbsp extra-virgin olive oil\r",
            "1\/2 tsp salt\r",
            "Freshly ground pepper\r",
            "<hr>\r",
            "1 lb medium shrimp, peeled, deveined and halved crosswise\r",
            "2 clove garlic, chopped\r",
            "1 tsp dried oregano\r",
            "1\/2 tsp paprika\r",
            "1 tbsp extra-virgin olive oil\r",
            "1\/4 tsp salt\r",
            "<hr>\r",
            "4 cup romaine lettuce, torn into bite-sized pieces\r",
            "1 1\/2 tbsp fresh lemon juice\r",
            "3 tbsp extra-virgin olive oil\r",
            "1\/2 cup crumbled feta cheese"
        ],
        "tags": [
            "shrimp",
            "seafood",
            "salad",
            "main"
        ]
    },
    "id108": {
        "id": "id108",
        "name": "Cherry couscous pudding",
        "source": "Food Network Magazine Nov 2011",
        "preptime": 300,
        "waittime": 0,
        "cooktime": 120,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Bring milks, sugar, almond extract, and a pinch of salt to a boil in a saucepan over medium heat. Add couscous, dried cherries and cinnamon stick; cover and cook 2 minutes. Remove from the heat and let sit, covered, 8 minutes. Fluff with a fork, remove the cinnamon stick and divide among bowls. Top with toasted almond slices and honey, if desired.",
        "ingredients": [
            "1 cup skim milk\r",
            "1 cup almond milk\r",
            "1\/4 cup sugar\r",
            "1\/4 tsp almond extract\r",
            "salt\r",
            "3\/4 cup whole-wheat couscous\r",
            "1\/2 cup dried cherries\r",
            "1 stick cinnamon\r",
            "1\/4 cup sliced almonds, toasted\r",
            "honey"
        ],
        "tags": [
            "dessert",
            "cherries",
            "untried"
        ]
    },
    "id109": {
        "id": "id109",
        "name": "Spinach lasagna with mushroom ragu",
        "source": "Food Network Magazine Nov 2011",
        "preptime": 1800,
        "waittime": 900,
        "cooktime": 10920,
        "servings": 8,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Make the ragu: Soak the porcini mushrooms in 1 cup hot water until soft, about 15 minutes. Strain through a fine-mesh sieve over a bowl. Chop; reserve the liquid.\r\n\r\n2. Meanwhile, heat the olive oil in a pot over medium heat. Add the onion, carrot and celery and cook until soft, 5 minutes. Stir in the garlic and tomato paste and cook, stirring, 2 more minutes. Add the portobello and shiitake mushrooms, 1 teaspoon salt and 1\/2 teaspoon pepper; cook, stirring until the mushrooms are soft, 5 more minutes.\r\n\r\n3. Add the porcini mushrooms, cook 2 minutes. Add the reserved porcini liquid, bring to a boil and cook until reduced slightly, about 3 minutes. Add the tomatoes and their juice, 2 cups water and the bay leaves; bring to a boil, stirring occasionally. Reduce the heat to medium low, add the parsley and 1 teaspoon salt and simmer, stirring a few times, until thick, about 1 hour, 30 minutes. Discard the bay leaves. (you can make the ragu up to 1 day ahead; let cool, then cover and chill. Reheat before using.)\r\n\r\n4. Make the lasagna filling: Mix the parmesan, mozzarella and asiago; set 1 1\/2 cups of the cheese mixture aside. Combine the remaining cheese mixture in a large bowl with the ricotta, eggs, spinach, nutmeg and 1\/2 teaspoon salt.\r\n\r\n5. Preheat the oven to 375F. Bring a pot of water to a boil and add a generous amount of salt. Add the noodles and cook as the label directs. Drain and rinse under cold water; shake off the excess water.\r\n\r\n6. Spread 1 cup of the ragu in a 9-by-13-inch baking dish. Add a layer of noodles, then half of the spinach mixture and 2 cups ragu. Repeat with another layer of noodles, spinach mixture and ragu. Top with the remaining noodles and ragu and sprinkle with the reserved cheese. Cover with foil, place on a baking sheet and bake 50 minutes. Uncover and bake until golden, about 25 more minutes. Let rest before serving.",
        "ingredients": [
            "1 oz dried porcini mushrooms\r",
            "2 tbsp extra-virgin olive oil\r",
            "1 medium onion, chopped\r",
            "1 large carrot, finely chopped\r",
            "1 stalk celery, finely chopped\r",
            "4 clove garlic, chopped\r",
            "2 tbsp tomato paste\r",
            "2 portobello mushroom cap, chopped\r",
            "1 1\/2 lb shiitake mushrooms, stems removed, chopped\r",
            "Kosher salt and freshly ground pepper\r",
            "2 28oz cans whole San Marzano tomatoes, crushed by hand\r",
            "3 bay leaves\r",
            "1\/4 cup fresh parsley, chopped\r",
            "<hr>\r",
            "3 oz parmesan cheese, grated\r",
            "1 1\/2 lb part-skim mozzarella cheese, shredded\r",
            "8 oz asiago cheese, shredded\r",
            "2 lb ricotta cheese\r",
            "2 large eggs, lightly beaten\r",
            "1 lb frozen chopped spinach, thawed and squeezed dry\r",
            "1\/4 tsp nutmeg, freshly grated\r",
            "12 oz dried lasagna noodles"
        ],
        "tags": [
            "italian",
            "vegetarian",
            "main"
        ]
    },
    "id110": {
        "id": "id110",
        "name": "Chocolate chestnut mousse",
        "source": "Food Network Magazine Nov 2011",
        "preptime": 1500,
        "waittime": 28800,
        "cooktime": 0,
        "servings": 8,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Put the chocolate in a microwave-safe bowl; microwave in 30-second intervals, stirring, until melted, about 2 minutes. Blend the chestnut puree, almond extract, salt and 1 cup confectioners' sugar in a food processor until smooth. Transfer to a bowl and fold in half of the melted chocolate.\r\n\r\n2. Beat the cream and the remaining 2 tablespoons confectioners' sugar with a mixer until soft peaks form. Reserve 1\/2 cup for topping. Fold one-quarter of the remaining whipped cream into the chestnut mixture, then fold in the rest. Chill up to 8 hours.\r\n\r\n3. Divide the mousse among dessert glasses. Top with the reserved whipped cream. Remelt the remaining chocolate in the microwave, if necessary, then drizzle on top.",
        "ingredients": [
            "8 oz semisweet chocolate, chopped\r",
            "3\/4 cup chestnut puree, found in the baking aisle\r",
            "1\/4 tsp almond extract\r",
            "Pinch of salt\r",
            "1 1\/8 cup confectioners' sugar\r",
            "2 cup heavy cream"
        ],
        "tags": [
            "chocolate",
            "dessert",
            "untried"
        ]
    },
    "id111": {
        "id": "id111",
        "name": "Spicy sauteed kale with lemon",
        "source": "Everyday Food Nov 2011",
        "preptime": 300,
        "waittime": 0,
        "cooktime": 900,
        "servings": 6,
        "comments": "Add chickpeas, sesame seeds, and\/or chopped almonds?",
        "calories": 408,
        "fat": 18,
        "satfat": 0,
        "carbs": 72,
        "fiber": 12,
        "sugar": 0,
        "protein": 12,
        "instructions": "In a large skillet, heat oil and chile over medium-high. Add lemon and honey and cook, stirring until lemon begins to break down, about 2 minutes. Add kale and cook, stirring, until just wilted, about 3 minutes. Add scallions, season with salt, and cook 1 minutes. Serve warm or at room temperature.",
        "ingredients": [
            "1 tbsp vegetable oil\r",
            "1 Thai or jalapeno chile, thinly sliced\r",
            "1 lemon, thinly sliced, seed removed and slices quartered\r",
            "1 tbsp honey\r",
            "2 bunches kale (1 1\/2 lbs), tough stems and ribs removed, leaves coarsely chopped\r",
            "6 green onions, cut into 2-inch pieces\r",
            "coarse salt"
        ],
        "tags": [
            "sides",
            "vegetarian",
            "untried"
        ]
    },
    "id112": {
        "id": "id112",
        "name": "Caesar Salad Dressing",
        "source": "http:\/\/www.foodnetwork.com\/recipes\/wolfgang-puck\/caesar-salad-recipe\/index.html",
        "preptime": 1200,
        "waittime": 0,
        "cooktime": 0,
        "servings": 8,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a medium bowl, whisk together the egg yolk, lemon juice, garlic, Worcestershire, pepper flakes, mustard, and anchovies. Slowly whisk in the oils to emulsify. Season, to taste, with salt and pepper.",
        "ingredients": [
            "1 egg yolk\r",
            "3 tablespoon fresh lemon juice\r",
            "1 tablespoon minced garlic\r",
            "1\/2 teaspoon Worcestershire sauce\r",
            "1\/4 teaspoon red pepper flakes\r",
            "1 tablespoon Dijon mustard\r",
            "2 anchovy fillets, mashed\r",
            "1 cup vegetable oil\r",
            "1\/3 cup extra-virgin olive oil\r",
            "Salt and freshly ground black pepper"
        ],
        "tags": [
            "salad_dressing",
            "dressing",
            "salad"
        ]
    },
    "id113": {
        "id": "id113",
        "name": "Melomakarona - Honey Cookies with Walnuts",
        "source": "http:\/\/greekfood.about.com\/od\/cookiescakes\/r\/Melomakarona-Spiced-Honey-Cookies-With-Walnuts.htm",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 1,
        "comments": "This is an oil-based cookie recipe that produces moist cake-like cookies flavored with orange and brandy that are bathed in a sweet honey syrup and topped with chopped walnuts.",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat the oven to 350 degrees.\r\n\r\nIn a small bowl, using your fingers, combine the orange zest with the sugar – rubbing the grains as if you were playing with sand to release the orange oils into the sugar.\r\nUsing an electric mixer, beat the oil with the orange sugar until well mixed. In a separate bowl, sift the flour with the baking powder, baking soda and salt.\r\n\r\nAdd the orange juice and brandy to mixer and mix well.\r\n\r\nSlowly incorporate the flour cup by cup until the mixture forms a dough that is not too loose but not quite firm either. It will be dense and wet but not sticky. Once the flour is incorporated fully stop mixing.\r\n\r\nTo roll cookies, pinch a portion of dough off about the size of a walnut. Shape in your palms into a smooth oblong shape, almost like a small egg. Place on an ungreased cookie sheet. Shape and roll cookies until the sheet is filled.\r\n\r\nPress the tines of a large fork in a crosshatch pattern in the center of each cookie. This will flatten them slightly in the center. The cookies should resemble lightly flattened ovals when they go in the oven.\r\n\r\nBake in a preheated 350-degree oven for 25 – 30 minutes until lightly browned. (The cookies will darken when submerged in syrup.)\r\n\r\nWhile the cookies are baking, prepare the syrup.\r\n\r\nIn a saucepan, combine the honey, sugar, water, cinnamon, cloves, and lemon rind. Bring the mixture to a boil then lower the heat and simmer uncovered for about 10 to 15 minutes. Remove the cinnamon, cloves, and lemon rind and stir in lemon juice.\r\n\r\nPlace the ground walnuts in a shallow plate or bowl next to the stove top. When the cookies come out of the oven and while they are still very warm, carefully float the cookies in the syrup and allow the cookies to absorb syrup on both sides.\r\n\r\nUsing a fork or small spatula, remove the cookie from the syrup and place on a platter or plate. Press ground walnuts lightly into the tops of the cookies (syrup will help it adhere) and sprinkle lightly with ground cinnamon.\r\n\r\nDo not refrigerate Melomakarona as they will harden. Store in an airtight container at room temperature.",
        "ingredients": [
            "1 cup olive oil\r",
            "1 cup vegetable oil\r",
            "3\/4 cup sugar\r",
            "1 orange, zested\r",
            "3\/4 cup orange juice\r",
            "1\/4 cup brandy\r",
            "2 tsp baking powder\r",
            "1 tsp baking soda\r",
            "Pinch of salt\r",
            "7 1\/2 cup all-purpose flour\r",
            "3\/4 cup walnuts, ground coarsely\r",
            "Ground cinnamon for sprinkling\r",
            "<hr>\r",
            "1 cup honey\r",
            "1 cup sugar\r",
            "1 1\/2 cup water\r",
            "1 cinnamon stick\r",
            "4 whole cloves\r",
            "1 piece lemon rind, 2-inch\r",
            "1 tsp lemon juice"
        ],
        "tags": [
            "cookies",
            "dessert",
            "greek",
            "untried"
        ]
    },
    "id114": {
        "id": "id114",
        "name": "Kalitsounia Kritis: Sweet Cheese Pastries from Crete",
        "source": "http:\/\/greekfood.about.com\/od\/dessertspastriessweets\/r\/kaltsounakia.htm",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 1,
        "comments": "In Greek: καλιτσούνια Κρήτης, pronounced kah-leet-SOON-yah KREE-tees  These sweet cheese pastries use a rolled dough instead of thin phyllo sheets. Depending on how they are folded (see below), they can be baked or fried. They are holiday tradition on the Greek island of Crete, but eaten at other times as well because they're so delicious! These call for the fresh soft variety of myzithra (not the aged salty type) cheese, and if you can't find it, try Italian mascarpone or ricotta.",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Prepare the dough\r\n\r\nIn a large bowl:\r\n\r\nWhisk the dry ingredients together (sugar, baking powder, flour).\r\nAdd the oil, mixing with a spoon or hands.\r\nStir in the strained yogurt and eggs and mix with spoon until the dough begins to stiffen, adding the brandy to soften the dough as needed.\r\nKnead the dough in the bowl for approximately 10 minutes until smooth, and set aside to rest.\r\nPrepare the filling\r\n\r\nIn a separate bowl, mix the cheese, cinnamon, sugar, egg yolk, orange peel, and flour together until well blended.\r\n\r\nTo bake\r\n\r\nPreheat the oven to 350°F (180°C). Lightly grease a baking sheet.\r\n\r\nMake the pastry\r\n\r\nOn a floured surface with a rolling pin, roll a piece of dough out to a thickness of about 1\/8th of an inch. Using a 3-4 inch cutter or saucer as a guide, cut out circles. (Alternatively, take a piece of dough the size of an unshelled walnut and roll it out to a circle about 3-4 inches across.)\r\n\r\nPlace a spoonful of the cheese mixture into the center of the circle and spread out close to the edges. Raise the rim of the dough up around the cheese and, with wet fingers, pinch the edges to pull the dough in around the cheese, leaving the center open so the cheese shows.\r\n\r\nRepeat using all the dough and filling. Place the kalitsounia on the baking sheet and brush lightly with beaten egg to glaze. Bake at 350°F (180°C) for approximately 20 minutes until lightly browned (see photo). Sprinkle lightly with cinnamon.\r\n\r\nAllow to cool on the baking sheet. Kalitsounia will keep well, covered, in the refrigerator.\r\n\r\nTo fry\r\n\r\nPlace a teaspoonful of cheese mix into the center of the circle, fold the circle over into a half-moon shape. With wet fingers, crimp the edges to close securely. Preheat 1 cup of olive oil over medium heat and fry until golden on both sides. Drain on paper towels. Sprinkle with confectioner's sugar or drizzle with honey.\r\n\r\nYield: 30-36 pieces",
        "ingredients": [
            "1\/2 cup olive oil\r",
            "1\/2 cup sugar\r",
            "1\/2 cup unflavored strained yogurt\r",
            "2 eggs, beaten with a fork\r",
            "1 teaspoon baking powder\r",
            "2 3\/4 cup all-purpose flour\r",
            "1\/4 cup brandy\r",
            "<hr>\r",
            "1 2\/3 pound fresh soft myzithra cheese, (or mascarpone or ricotta)\r",
            "1\/2 teaspoon ground cinnamon\r",
            "2 tablespoon sugar\r",
            "1 egg yolk\r",
            "1 teaspoon grated orange peel\r",
            "2 tablespoon all-purpose flour\r",
            "1 egg, beaten (for glaze)\r",
            "<hr>\r",
            "ground cinnamon (for baked pastries)\r",
            "confectioner's sugar or honey (for fried pastries)"
        ],
        "tags": [
            "greek",
            "untried",
            "appetizer"
        ]
    },
    "id116": {
        "id": "id116",
        "name": "Gluten-free chocolate chips cookies",
        "source": "http:\/\/www.kingarthurflour.com\/recipes\/gluten-free-chocolate-chip-cookies-recipe",
        "preptime": 1020,
        "waittime": 3600,
        "cooktime": 660,
        "servings": 3,
        "comments": "The cookie dough needs to be refrigerated for at least 1 hour before baking (or for up to 2 days), so plan accordingly. Dough may be scooped into balls, wrapped well, and frozen for up to several months. For hot homemade cookies, FAST, simply place frozen dough balls on a baking sheet, and bake for a minute or so longer than the directions indicate. These cookies stay nice and fresh for a day or so after baking. Freeze for longer storage. To make sure your oven temperature is exactly right, bake a sample cookie first. If the cookie spreads too much, raise the oven temperature slightly. If it doesn't spread enough, lower the oven temperature slightly, or pat the dough down slightly before baking.",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1) Beat the butter, sugars, vanilla and salt till fluffy.\r\n\r\n2) Beat in the eggs one at a time, being sure to scrape down the sides and bottom of the bowl midway through to make sure everything is well combined.\r\n\r\n3) Whisk together the flour or flour blend, xanthan gum, baking powder, and baking soda.\r\n\r\n4) Beat the dry ingredients into the butter mixture, then blend in the chocolate chips and nuts. Again, scrape the bottom and sides of the bowl to be sure everything is well blended.\r\n\r\n5) Cover the bowl and refrigerate for 1 hour, or for up to 2 days.\r\n\r\n6) Preheat the oven to 350°F. Lightly grease a couple of baking sheets, or line with parchment.\r\n\r\n7) Scoop tablespoon-sized balls of dough onto the prepared baking sheets; a tablespoon cookie scoop works well here. Leave space between the cookies so they can spread.\r\n\r\n8) Bake the cookies for 9 to 11 minutes, until golden brown. Remove from the oven and let rest on the baking sheets for 5 minutes, to set, before transferring to racks to cool completely. Or allow them to cool right on the baking sheets.\r\n\r\nYield: 3 dozen cookies",
        "ingredients": [
            "1 cup butter\r",
            "1 cup brown sugar, firmly packed\r",
            "1\/2 cup granulated sugar\r",
            "2 teaspoon gluten-free vanilla extract\r",
            "1 teaspoon salt\r",
            "2 large eggs\r",
            "2 1\/3 cup King Arthur Gluten-Free Multi-Purpose Flour\r",
            "1 teaspoon xanthan gum\r",
            "1 teaspoon baking powder\r",
            "1 teaspoon baking soda\r",
            "2 cup chocolate chips\r",
            "1 1\/2 cup chopped nuts, optional"
        ],
        "tags": [
            "GF",
            "dessert",
            "cookies",
            "untried"
        ]
    },
    "id117": {
        "id": "id117",
        "name": "Homemade candy canes",
        "source": "http:\/\/blogs.kqed.org\/bayareabites\/2011\/12\/22\/diy-christmas-homemade-candy-canes\/",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 16,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat the oven to 200 degrees. Oil two large baking sheets, a bench scraper, and kitchen shears or a sharp knife. Lay a piece of parchment paper or a Silpat on the counter where the canes can dry. Move one of the baking sheets to the warm oven.\r\n\r\nMeanwhile, in a straight-sided deep saucepan off heat, combine the sugar, corn syrup, water, cream of tartar, and salt and stir them together well. Clip a candy thermometer to the side of the pot and move it onto medium-high heat. Without stirring, let the syrup come up to 305 degrees. Using a pastry brush or a paint brush dedicated to culinary use, wash down any stray sugar crystals from the side of the pot. Ready the peppermint oil, food coloring, measuring spoons, and vegetable oil. Glove thyself with either heat-retardant gloves or snug mittens covered with disposable gloves.\r\n\r\nOnce the syrup has reached temperature, pour it out onto the room temperature baking sheet. Drizzle the peppermint oil on top, and using the bench scraper, scrape the hot candy up from the bottom and fold it over onto itself to stir it through. Once it has cooled slightly, mix in the vanilla as well. Note that the peppermint scent in the air will be strong.\r\n\r\nContinuously scrape up and stir the syrup to cool it until it becomes a pliable dough. Cut the dough in half and move one piece to the baking sheet inside the warm oven. (First, we’ll “pull” the white half of the candy cane. Then we’ll color the red half.)\r\n\r\nQuickly oil your gloved hands, as it’s now time to pull the candy. Scrape up the candy dough into one piece and, working as quickly and as continuously as you can, pull it out into a rope, double it over onto itself, and twist it together. Pull it, double it, and twist it again. Keep on going this way at a quick clip, and you’ll notice that the candy will start to take on a ribbon-y sheen. This is how the candy will turn white, so keep going until the color is pure. Embrace the upper body workout. Note that anytime the candy becomes too stiff, simply warm it up again in the oven to soften.\r\n\r\nDon’t let the candy get too hard. When it’s reached a nice white color, place it onto its baking sheet and move it to the warm oven. Re-oil your bench scraper. Take out the second tray of candy dough and pour on the red food coloring -- about a third of one of those tiny bottles for a good rich color. Use your scraper fold the candy onto itself to incorporate the color completely. Note that this side of the candy cane does not need to be pulled. Move both candy cane trays to the oven and let them warm through for about 5 minutes until pliant.\r\n\r\nOnce warm and squishy enough to work with, take both pieces of candy from the oven and roll them into logs as long as the baking sheet. Cut each log into four equal pieces. Hang on to one red piece and one white piece, moving the rest of the candy back into the oven to keep warm.\r\n\r\nOn the countertop, line the red and white logs alongside one another and begin to twist from one end, stretching as you go, making the candy canes as thin or as thick as you like. Use your oiled shears or knife to cut the length of each cane. Shape the hook of the cane, and press down on the ends to taper. Set the canes aside to cool. (Know, of course, that you could also cut into sticks, rounds, or individual peppermint sucking candy). Admire the individual quality of your handiwork.\r\n\r\nRepeat this process with the remaining 3\/4 of the candy, one piece of each color at a time.\r\n\r\nAllow candy to cool until completely hard; about 15 minutes. Wrap each cane in plastic wrap to keep it from sticking. Store in an airtight jar for several months.",
        "ingredients": [
            "3 cup sugar\r",
            "1 cup corn syrup\r",
            "1\/3 cup water\r",
            "1\/2 tsp cream of tartar\r",
            "1\/8 tsp kosher salt\r",
            "Vegetable oil\r",
            "2 tsp peppermint oil, (ideally not extract, but ok to use if that’s all you have)\r",
            "1 tsp vanilla extract\r",
            "1\/3 bottle red food coloring"
        ],
        "tags": [
            "candy",
            "dessert",
            "untried"
        ]
    },
    "id118": {
        "id": "id118",
        "name": "Pecan Pie",
        "source": "",
        "preptime": 1200,
        "waittime": 0,
        "cooktime": 3000,
        "servings": 1,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Melt butter and combine with flour and corn starch.  Stir until well blended.  Combine sugar with butter mixture in sauce pan and boil for 3 minutes.  Let cool to about 120 degrees.\r\n\r\nBeat eggs and combine vanilla, cinnamon, and salt.  Blend well.\r\n\r\nComine all ingredients and blend well.  This may require a mixer since the sugar mixture will be thick.  Fold in pecans and pour into medium unbaked pastry shell.\r\n\r\nBake on cookie sheet at 350 degrees for 50 minutes.",
        "ingredients": [
            "4 tbsp butter\r",
            "1 tbsp flour\r",
            "1 tbsp corn starch\r",
            "1 cup sugar\r",
            "1 cup cane syrup, (Lyle's Golden Syrup or Steen's Cane Syrup)\r",
            "2 tsp vanilla\r",
            "2 eggs\r",
            "1 cup chopped pecans\r",
            "1 tsp cinnamon\r",
            "1\/4 tsp salt\r",
            "1 pie shell"
        ],
        "tags": [
            "pie",
            "dessert"
        ]
    },
    "id119": {
        "id": "id119",
        "name": "Asian Salad",
        "source": "Pampered Chef",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 140,
        "fat": 0,
        "satfat": 0,
        "carbs": 32,
        "fiber": 8,
        "sugar": 0,
        "protein": 2,
        "instructions": "In a small bowl, whisk together sugar, vinegar, salt and black pepper; set aside.\r\n\r\nPeel and julienne carrot and cucumber. Chop bell pepper and green onion.\r\n\r\nAdd carrot, cucumber, bell pepper and green onion to dressing mixture. Toss vegetables to coat. Serve immediately.",
        "ingredients": [
            "1 tbsp sugar\r",
            "1 tbsp white vinegar\r",
            "1\/4 tsp salt\r",
            "1\/8 tsp ground black pepper\r",
            "1 medium carrot, julienned\r",
            "1 medium cucumber, julienned\r",
            "1\/4 cup red bell pepper, chopped\r",
            "1 green onion, thinly sliced"
        ],
        "tags": [
            "salad",
            "untried",
            "asian"
        ]
    },
    "id121": {
        "id": "id121",
        "name": "Pasta with roasted vegetables and bacon",
        "source": "Martha Stewart Living Oct 2011",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 1800,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Preheat oven to 400F. Heat oil in a small skillet over medium heat. Cook bacon until crisp, about 8 minutes. Transfer to paper towels using a slotted spoon. Reserve drippings.\r\n2. Toss sweet potato, onion, and cauliflower with reserved drippings. Season with salt and pepper. Roast on a rimmed baking sheet, tossing halfway through, until tender and caramelized, about 35 minutes.\r\n3. Meanwhile, cook pasta in a large pot of salted water until al dente. Drain, reserving 1 cup cooking water. Return pasta to pot with cooking water, and toss with grated cheese and vegetables. Stir in parsley. Sprinkle bacon over top. Garnish with shaved cheese.",
        "ingredients": [
            "2 tbsp extra-virgin olive oil\r",
            "2 oz bacon, preferably slab, chopped\r",
            "1 medium sweet potato, peel and cut into 1\/2-inch cubes\r",
            "1 small onion, thinly sliced\r",
            "1\/2 head cauliflower, trimmed into 1 1\/2-inch florets (about 2 1\/2 cups)\r",
            "3\/4 tsp salt\r",
            "1\/4 tsp pepper\r",
            "8 oz orecchiette pasta\r",
            "1 1\/2 oz Parmesan cheese, finely grated (about 3\/4 cup), plus more, shaved, for garnish\r",
            "1\/2 cup fresh parsley, coarsely chopped"
        ],
        "tags": [
            "pasta",
            "main"
        ]
    },
    "id123": {
        "id": "id123",
        "name": "Pretzel shortbread bar",
        "source": "Martha Stewart Living Oct 2011",
        "preptime": 1200,
        "waittime": 3600,
        "cooktime": 1500,
        "servings": 24,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Preheat oven to 325F. Coat a 4 1\/4-by-13 1\/2-inch fluted tart pan with a removable bottom with cooking spray. Line bottom with parchment.\r\n2. Pulse 1 3\/4 cups pretzels in a food processor until powdery. Transfer 1\/2 cup to a bowl; discard any remaining pretzel powder. Stir in flour and baking powder. Transfer remaining 1 1\/2 cups pretzels to food processor and pulse a few times until coarsely chopped.\r\n3. Beat butter and sugar with a mixer on medium speed until pale and fluffy, about 5 minutes. Reduce speed to low, and beat in egg yolk, then pretzel-flour mixture, until combined. Mix in 1\/2 cup chopped pretzels.\r\n4. Press dough evenly into pan. Top dough with 1\/4 cup chopped pretzels, pressing slightly; discard any remaining pretzels.\r\n5. Bake shortbread until pale brown and firm in the center, 25 to 30 minutes. Transfer pan to a wire rack, and let shortbread cool for 1 hour. Remove shortbread from pan, and cut into 1\/2-inch wide rectangles using a serrated knife.",
        "ingredients": [
            "Cooking spray\r",
            "3 1\/4 cup salted miniature twist pretzels\r",
            "1\/2 cup all-purpose flour\r",
            "1\/2 tsp baking powder\r",
            "1 stick unsalted butter, room temperature\r",
            "1\/2 cup sugar\r",
            "1 large egg yolk"
        ],
        "tags": [
            "dessert",
            "untried"
        ]
    },
    "id125": {
        "id": "id125",
        "name": "Simple syrup",
        "source": "Martha Stewart Living Oct 2011",
        "preptime": 600,
        "waittime": 0,
        "cooktime": 1200,
        "servings": 1,
        "comments": "Add flavors by putting in citrus peel, cinnamon stick, vanilla beans, etc.",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Bring sugar and water to a boil in a small saucepan over high heat. Cook, stirring, until sugar dissolves, Let cool. Yields 1 cup.\r\n\r\nStorage: Can be refrigerated up to 1 month.",
        "ingredients": [
            "1 cup sugar\r",
            "1 cup water"
        ],
        "tags": [
            "drink"
        ]
    },
    "id126": {
        "id": "id126",
        "name": "Hot and nutty whiskey sours",
        "source": "Martha Stewart Living Oct 2011",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 1200,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Bring Nocello, whiskey, simple syrup, and lemon juice to a simmer in a medium saucepan. Divide among 4 mugs, and garnish each with a cinnamon stick.",
        "ingredients": [
            "3\/4 cup Nocello, or other walnut-flavored liquer\r",
            "1 1\/2 cup whiskey or bourbon, such as Maker's Mark\r",
            "3\/4 serving [simple syrup](http:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=id125)",
            "1\/4 cup fresh lemon juice, from 2 lemons\r",
            "4 cinnamon sticks"
        ],
        "tags": [
            "drink",
            "alcohol",
            "untried"
        ]
    },
    "id127": {
        "id": "id127",
        "name": "Three cheese macaroni",
        "source": "Martha Stewart Living Oct 2011",
        "preptime": 2400,
        "waittime": 0,
        "cooktime": 1800,
        "servings": 10,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Preheat oven to 375F. Butter 10 mini (1 cup) pie plates or a 9x13-inch baking dish. Melt 2 tbsp butter in a small saucepan over medium heat. Add breadcrumbs, and toast, stirring occasionally, until golden brown, about 5 minutes.\r\n2. Warm milk in a medium saucepan over medium heat. Meanwhile melt remaining 6 tablespoons butter in a large high-sided skillet over medium heat. Cook until butter is bubbling. Add flour. Cook, stirring, for 1 minute.\r\n3. Gradually pour warm milk into butter mixture, whisking constantly, until mixture bubbles and thickens, about 5 minutes. Remove from heat, and stir in 3 cups cheddar, 1 cup Gruyere, 1 cup fontina, 1\/2 teaspoon salt, 1\/4 teaspoon black pepper, the nutmeg, paprika, and cayenne pepper.\r\n4. Bring a large pot of water to a boil. Cook pasta until al dente. Drain, and transfer past to cheese sauce. Stir to coat. Divide mixture among mini  pie plates or to baking dish. Scatter remaining cup of cheddar, 1\/2 cup Gruyere, and 1\/2 cup fontina over top, and sprinkle with toasted breadcrumbs. Bake until cheese is melted and pasta is warmed through, about 15 minutes. Transfer to a wire rack and let cool for 5 minutes before serving.",
        "ingredients": [
            "1 stick unsalted butter, plus more for pie plates\r",
            "1 cup panko breadcrumbs\r",
            "5 cup whole milk\r",
            "1\/2 cup all-purpose flour\r",
            "10 oz sharp cheddar cheese, about 4 cups grated\r",
            "4 oz Gruyere cheese, about 1 1\/2 cups grated\r",
            "4 oz fontina cheese, about 1 1\/2 cups grated\r",
            "Salt and freshly ground black pepper\r",
            "1\/4 tsp nutmeg, freshly grated\r",
            "1\/4 tsp paprika\r",
            "1\/4 tsp cayenne pepper\r",
            "1 lb elbow macaroni"
        ],
        "tags": [
            "cheese",
            "pasta",
            "main",
            "untried"
        ]
    },
    "id128": {
        "id": "id128",
        "name": "Broken glass cupcakes",
        "source": "Martha Stewart Living Oct 2011",
        "preptime": 2700,
        "waittime": 0,
        "cooktime": 2700,
        "servings": 42,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Preheat oven to 350F. Make the cupcakes: line cupcake tins with baking cups. Sift flour, baking powder, cinnamon, nutmeg, and 3\/4 teaspoon salt into a medium bowl. Combine milk and vanilla in a measuring cup.\r\n2. Beat butter with a mixer on medium-high speed until pale and fluffy. Reduce speed to medium, and gradually add granulated sugar in a slow, steady stream. Beat until pale and fluffy, about 3 minutes. Reduce speed to low, and add flour mixture in 3 additions, alternating with milk mixture, beginning and ending with flour.\r\n3. In a clean bowl, whisk egg whites with a mixer on medium-high speed until stiff peaks form. Fold one-third of the whites into the cupcake batter. Fold in remaining egg whites in 2 batches.\r\n4. Divide batter among baking cups, filling each halfway full. Bake until a toothpick inserted into the center of each comes out clean and the tops spring back when lightly touched, 18 to 20 minutes. Let cool completely in tins set on wire racks.\r\n5. Meanwhile, make the caramel: bring granulated sugar and water to a boil in a small high-sided saucepan, stirring, until sugar dissolves. Reduce heat to medium-high, and cook until mixture just starts to turn pale gold around edges. Remove from heat, and immediately pour caramel onto a rimmed baking sheet. Working quickly, tilt pan to spread caramel to edges to make a very thin layer. Let cool to harden.\r\n6. Make the frosting: beat cream cheese and butter with a mixer on medium-high speed until pale and fluffy. Gradually add confectioners' sugar and vanilla. Beat until creamy and spreadable.\r\n7. Frost each cupcake using an offset spatula. Twist pan to release and break caramel in order for it to resemble broken glass. Place a shard or 2 of caramel \"glass\" in the center of each cupcake. Drizzle or pipe cherry preserves where caramel has entered the cupcake.\r\n\r\nMake ahead: unfrosted cupcakes can be stored at room temperature for up to 2 days. Frosting can be refrigerated for up to 4 days. Caramel can be stored at room temperature for up to 1 day, break just before using.\r\n\r\nStorage: frosted cupcakes can be refrigerated for up to 1 day. Top with caramel shards and cherry preserves just before serving.",
        "ingredients": [
            "4 1\/2 cup cake flour\r",
            "2 tbsp baking powder\r",
            "1\/2 tsp ground cinnamon\r",
            "1\/4 tsp nutmeg, freshly grated\r",
            "salt\r",
            "1 1\/2 cup whole milk\r",
            "1 tbsp pure vanilla extract\r",
            "2 1\/4 stick unsalted butter, room temperature\r",
            "2 1\/4 cup granulated sugar\r",
            "7 egg whites, room temperature\r",
            "<hr>\r",
            "1 1\/2 cup granulated sugar\r",
            "3\/4 cup water\r",
            "<hr>\r",
            "1 pound cream cheese, room temperature\r",
            "2 stick unsalted butter, room temperature\r",
            "6 cup confectioners' sugar\r",
            "1\/2 tsp pure vanilla extract\r",
            "1 cup cherry preserves, strained, for garnish"
        ],
        "tags": [
            "cupcakes",
            "dessert",
            "halloween",
            "untried"
        ]
    },
    "id131": {
        "id": "id131",
        "name": "Homemade beef stock",
        "source": "http:\/\/www.marthastewart.com\/261559\/homemade-beef-stock",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 6,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Heat the oven to 450 degrees. Make a bouquet garni by wrapping parsley, thyme, rosemary, bay leaves, and peppercorns in a piece of cheesecloth. Tie with kitchen twine, and set aside. Arrange meat, veal bones, onion, carrots, and celery in an even layer in a heavy roasting pan. Roast, turning every 20 minutes, until the vegetables and the bones are deep brown, about 1 1\/2 hours. Transfer the meat, bones, and vegetables to a large stockpot, and set aside. Pour off the fat from the roasting pan, and discard. Place the pan over high heat on the stove. Add wine, and use a wooden spoon to scrape up the brown bits; boil until the wine has reduced by half, about 5 minutes. Pour all of the liquid into the stockpot.\r\n\r\nAdd 6 quarts of cold water to the stockpot, or more if needed to cover bones. Do not add less water. Bring to a boil, then reduce to a very gentle simmer. Add the reserved bouquet garni. Liquid should just bubble up to surface. Skim the foam from the surface, and discard. Simmer over the lowest possible heat for 3 hours; a skin will form on the surface of the liquid; skim off with a slotted spoon, and discard. Repeat as needed. Add water if at any time the level drops below the bones.\r\n\r\nStrain the stock through a fine sieve into a large bowl. Discard the solids. Transfer the bowl to an ice bath, and let cool to room temperature. Transfer to airtight containers. Refrigerate for at least 8 hours, or overnight. Stock may be refrigerated for 3 days or frozen for 4 months. If storing, leave fat layer intact to seal the stock. Before using, remove the fat that has collected on the surface.",
        "ingredients": [
            "8 sprig fresh flat-leaf parsley\r",
            "6 sprig fresh thyme (or 3\/4 tsp dried thyme)\r",
            "4 sprig fresh rosemary (or 2 tsp dried rosemary)\r",
            "2 dried bay leaves\r",
            "1 tablespoon whole black peppercorns\r",
            "1 pound beef-stew meat, cubed\r",
            "5 pound veal bones, sawed into smaller pieces\r",
            "1 large onion, peel on, quartered\r",
            "2 large carrots, cut into thirds\r",
            "2 stalk celery, cut into thirds\r",
            "2 cup dry red wine"
        ],
        "tags": [
            "stock",
            "components",
            "untried"
        ]
    },
    "id132": {
        "id": "id132",
        "name": "French onion soup",
        "source": "http:\/\/www.marthastewart.com\/340253\/french-onion-soup?center=0&gallery=274637&slide=262463",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 5400,
        "servings": 4,
        "comments": "homemade beef stock: http:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=id131",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Melt butter in a large Dutch oven or heavy pot on medium-low heat. Add onions. Spread them out in as thin a layer as possible. Sprinkle with sugar, and cook, stirring just as needed to keep onions from sticking, until they are melting and soft, golden brown, and beginning to caramelize, about 1 hour. (If doing 2 servings, cook for only 30-40 minutes.)\r\n\r\nSprinkle flour over onions, and stir to coat. Add sherry, stock, and thyme, and bring to a simmer. Cook, partially covered, for about 30 minutes, to allow the flavors to combine. Season with salt and pepper to taste.  (If doing 2 servings, cook for only 15 minutes.)\r\n\r\nMeanwhile, lightly toast bread under a broiler; set aside. Ladle hot soup into six ovenproof bowls. Arrange the bowls on a baking pan. Place 1 or 2 slices of toasted bread over each bowl of soup. Sprinkle 1\/2 cup grated cheese over bread in each bowl, and place under the broiler until cheese is melted and crusty brown around the edges. Watch carefully that bread doesn't burn.  \r\n\r\n(If you don't have broiler-proof bowls, instead lightly toast the bread, then top with the cheese and broil until bubbly and browned, 4-5 minutes. Serve the soup in an ordinary bowl, topped with the bread slices.)\r\n\r\nServe immediately.",
        "ingredients": [
            "4 tablespoon unsalted butter\r",
            "2 pound yellow onions, sliced 1\/4-inch into half circles\r",
            "1 teaspoon sugar\r",
            "1 tablespoon all-purpose flour\r",
            "1\/2 cup dry sherry\r",
            "3 cup beef stock\r",
            "2 teaspoon fresh thyme, chopped or 3\/4 teaspoon dried thyme\r",
            "Salt and freshly ground black pepper\r",
            "1 small French baguette, sliced crosswise into 1\/2-inch pieces\r",
            "8 ounce Gruyere cheese, grated on the large holes of a box grater (about 3 cups)"
        ],
        "tags": [
            "soup",
            "main"
        ]
    },
    "id133": {
        "id": "id133",
        "name": "Red lentil soup with sage and bacon",
        "source": "http:\/\/www.marthastewart.com\/342138\/red-lentil-soup-with-sage-and-bacon?center=0&gallery=274637&slide=262724",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a large saucepan over medium-high heat, cook the bacon until crisp, about 3 minutes. Transfer the bacon to a piece of paper towel, and set aside. Discard all but 1 tablespoon bacon drippings from pan.\r\n\r\nAdd the garlic, onion, and carrots to saucepan. Cook vegetable mixture over medium heat until tender, about 5 minutes. Add the minced sage, and cook 1 minute more.\r\n\r\nAdd the lentils, cumin, and chicken stock; stir to combine. Simmer until lentils are cooked and falling apart, 20 to 25 minutes.\r\n\r\nTo serve, divide the hot soup among four soup plates, and garnish with the reserved bacon and additional sage.",
        "ingredients": [
            "5 slices bacon, (4 ounces), cut into 1\/4-inch dice\r",
            "2 clove garlic, finely chopped\r",
            "1 medium onion, finely chopped\r",
            "4 medium carrots, cut into 1\/4-inch dice\r",
            "6 fresh sage leaves, minced, plus more for garnish\r",
            "1 1\/2 cup red lentils\r",
            "1 teaspoon ground cumin\r",
            "5 cup homemade or low-sodium canned chicken stock"
        ],
        "tags": [
            "soup",
            "lentils",
            "main"
        ]
    },
    "id134": {
        "id": "id134",
        "name": "Green pea soup with cheddar scallion panini",
        "source": "http:\/\/www.marthastewart.com\/315072\/green-pea-soup-with-cheddar-scallion-pan?center=0&gallery=274637&slide=282036",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 1200,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a large saucepan, heat 1 tablespoon butter over medium. Add scallion whites, and cook, stirring, until softened, 1 to 2 minutes. Add peas, broth, and water. Bring to a boil; reduce heat to a simmer. Cook until peas are tender, about 5 minutes; set aside.\r\n\r\nIn a medium bowl, toss cheddar with scallion greens. Make 4 sandwiches with cheddar mixture and bread.\r\n\r\nIn a large skillet, heat 1 tablespoon butter over medium-low. Place sandwiches in skillet, and cook until golden, 3 to 4 minutes per side, adding remaining tablespoon butter to skillet to cook second side.\r\n\r\nWorking in batches, puree soup in a blender until smooth (filling blender only halfway to prevent spattering). If necessary, adjust consistency with a little bit of water. Season with salt, pepper, and lemon juice. Slice each panini into four \"fingers, and serve with soup.",
        "ingredients": [
            "3 tablespoon butter\r",
            "4 green onions, white and green parts separated and thinly sliced\r",
            "30 oz frozen peas\r",
            "2 cup chicken broth\r",
            "3 cup water\r",
            "6 oz shredded sharp white cheddar\r",
            "8 slices sandwich bread\r",
            "Coarse salt and ground pepper\r",
            "1 tablespoon fresh lemon juice"
        ],
        "tags": [
            "soup",
            "main",
            "panini"
        ]
    },
    "id136": {
        "id": "id136",
        "name": "Broccoli soup with cheddar toasts",
        "source": "http:\/\/www.marthastewart.com\/336427\/broccoli-soup-with-cheddar-toasts?center=0&gallery=274637&slide=262654",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 1168,
        "fat": 48,
        "satfat": 16,
        "carbs": 128,
        "fiber": 40,
        "sugar": 40,
        "protein": 96,
        "instructions": "Heat oil in a large pot over medium heat until hot but not smoking. Add onion, garlic, and broccoli stems; cover, and cook, stirring occasionally, until vegetables are soft, about 15 minutes. Add stock and salt; cover, raise heat to medium-high, and bring to a boil. Add broccoli florets; reduce heat, and simmer, uncovered, until florets are just tender, about 10 minutes.\r\n\r\nRemove soup from heat, and let cool, about 10 minutes. Fill a blender no more than halfway to puree soup in batches until smooth. Return soup to pot; stir in milk and cayenne. Cook over medium heat until heated through (do not boil).\r\n\r\nHeat broiler. Divide cheese among bread slices; toast under broiler until melted and golden brown, 45 to 60 seconds. Divide soup among bowls. Top each bowl with a cheese toast, and serve.",
        "ingredients": [
            "1 1\/2 tablespoon extra-virgin olive oil\r",
            "1 medium onion, coarsely chopped\r",
            "2 garlic cloves, coarsely chopped\r",
            "2 bunches broccoli (1 bunch ≈ 1½lbs), stems and florets chopped separately into 1\/2-inch pieces\r",
            "7 cup low-sodium chicken stock\r",
            "1 teaspoon coarse salt\r",
            "1 cup skim milk\r",
            "1\/8 teaspoon cayenne pepper\r",
            "2 ounce extra-sharp cheddar cheese, grated or crumbled (about 1\/2 cup)\r",
            "8 thin slices crusty baguette"
        ],
        "tags": [
            "soup",
            "main"
        ]
    },
    "id137": {
        "id": "id137",
        "name": "Coconut shrimp soup",
        "source": "http:\/\/www.marthastewart.com\/338581\/coconut-shrimp-soup?center=0&gallery=274637&slide=263811",
        "preptime": 1800,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Heat oil in a large (3-quart) saucepan over medium-low heat. Add ginger, garlic, and pepper flakes; cook, stirring, until fragrant, about 1 minute. Add carrots, coconut milk, and 3 cups water. In a small bowl, mix cornstarch and water until smooth; add to pot. Bring to a boil.\r\n\r\nBreak pasta in half; add to pot. Return to a boil, reduce heat to medium, and simmer until pasta is al dente and carrots are just tender, 3 to 4 minutes.\r\n\r\nAdd shrimp; stir until opaque, about 1 minute. Remove pot from heat, and stir in lime juice; season with salt. Ladle into serving bowls, and garnish with scallions.",
        "ingredients": [
            "1 tablespoon vegetable oil\r",
            "1 tablespoon grated fresh ginger\r",
            "2 clove garlic, minced\r",
            "1\/2 teaspoon red-pepper flakes\r",
            "1 pound carrots, peeled, halved lengthwise, and thinly sliced\r",
            "1 13.5oz can coconut milk\r",
            "1 tablespoon cornstarch\r",
            "2 tablespoon water\r",
            "4 ounce angel-hair pasta\r",
            "1 1\/2 pound large shrimp, peeled, deveined, and tails removed\r",
            "1\/4 cup freshly squeezed lime juice\r",
            "Coarse salt\r",
            "4 green onions, thinly sliced"
        ],
        "tags": [
            "soup",
            "shrimp",
            "main",
            "untried"
        ]
    },
    "id138": {
        "id": "id138",
        "name": "Creamy caramelized onion soup",
        "source": "http:\/\/www.marthastewart.com\/313343\/creamy-caramelized-onion-soup?center=0&gallery=274637&slide=261862",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 3600,
        "servings": 8,
        "comments": "Cream is optional!",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Melt 4 tablespoons butter in a large saucepan over medium heat. Add leeks, garlic, shallots, and half of the onions. Cook, stirring occasionally, until vegetables are very soft and translucent, about 10 minutes. Reduce the heat to medium-low, and cook, stirring occasionally, until vegetables are deep golden brown, about 25 minutes.\r\n\r\nAdd vermouth, stock, and 1 teaspoon salt. Bring to a boil. Reduce heat to medium-low. Simmer, stirring occasionally, 15 minutes. Let cool. Puree onion mixture in batches in a blender until smooth, about 3 minutes per batch. Set aside.\r\n\r\nMeanwhile, melt remaining 2 tablespoons butter in a medium skillet over medium-low heat. Add remaining onion. Cook, stirring occasionally, until onion is very soft and golden brown, about 45 minutes. Cover, and set aside.\r\n\r\nReturn onion puree to saucepan. Stir in cream. Reheat over medium heat, stirring, until heated through but not boiling. Season with salt, if desired. Serve, topped with caramelized onions.",
        "ingredients": [
            "6 tablespoon unsalted butter\r",
            "3 leeks, white and pale-green parts only, rinsed well and coarsely chopped\r",
            "5 garlic, thinly sliced\r",
            "7 large shallots, about 14 ounces, thinly sliced\r",
            "2 large Vidalia onions, about 20 ounces, cut into 1\/4-inch-thick slices\r",
            "3\/4 cup dry white vermouth\r",
            "4 cup homemade or low-sodium store-bought chicken stock\r",
            "Coarse salt\r",
            "1 cup heavy cream"
        ],
        "tags": [
            "onion",
            "soup",
            "main"
        ]
    },
    "id139": {
        "id": "id139",
        "name": "Hearty spinach and chickpea soup",
        "source": "http:\/\/www.marthastewart.com\/359776\/hearty-spinach-and-chickpea-soup?center=0&gallery=274637&slide=283080",
        "preptime": 2700,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Cook rice if not already done.\r\n\r\nMeanwhile, in a large saucepan or Dutch oven, heat oil over medium heat. Add onion and cook, stirring frequently, until tender, about 5 minutes. Add garlic and mushrooms and cook, stirring occasionally, until mushrooms are tender, about 5 minutes. Add broth and rosemary; bring to a boil.\r\n\r\nStir cooked rice and chickpeas into the broth; return to a boil. Reduce to a simmer, cover, and continue cooking for 5 more minutes to allow flavors to blend.\r\n\r\nStir in spinach and cook, uncovered, until just wilted, about 1 minute. Season with salt and pepper. Garnish with cheese; serve immediately.",
        "ingredients": [
            "2 cup cooked brown rice\r",
            "1 tablespoon olive oil\r",
            "1 medium onion, finely chopped\r",
            "2 clove garlic, minced\r",
            "8 ounce fresh shiitake mushrooms, stems removed, caps thinly sliced\r",
            "6 cup reduced-sodium chicken or vegetable broth\r",
            "1\/2 teaspoon dried rosemary, crumbled\r",
            "1 can chickpeas, drained and rinsed\r",
            "10 oz baby spinach leaves\r",
            "Coarse salt and ground pepper, to taste\r",
            "1\/2 cup grated Parmesan cheese"
        ],
        "tags": [
            "soup",
            "main",
            "untried"
        ]
    },
    "id140": {
        "id": "id140",
        "name": "Chervil cream",
        "source": "http:\/\/www.marthastewart.com\/335629\/chervil-cream",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Prepare an ice-water bath; set aside. Bring a medium pot of water to a boil; stir in 1 tablespoon salt. Add chervil. Return to a boil; cook until bright green, about 30 seconds. Using a slotted spoon, immediately transfer to ice-water bath. Drain, and chop coarsely.\r\n\r\nProcess chervil with 1\/4 cup cold water in a food processor until very finely chopped. Pour through a fine-mesh sieve; discard liquid. Whip cream in a medium bowl until thick and fluffy but still pourable; stir in chervil, and season with salt.",
        "ingredients": [
            "Coarse salt\r",
            "4 cup loosely packed fresh chervil, with stems (about 4 bunches)\r",
            "1\/3 cup cold heavy cream"
        ],
        "tags": [
            "condiment",
            "components",
            "untried"
        ]
    },
    "id141": {
        "id": "id141",
        "name": "Mushroom soup",
        "source": "http:\/\/www.marthastewart.com\/351301\/mushroom-soup?center=0&gallery=274637&slide=285828",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 12,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Cover dried mushrooms with 2 cups boiling water in a heatproof bowl; let stand until soft, about 30 minutes. Using a slotted spoon, transfer mushrooms to a cutting board, and finely chop; set aside. Strain soaking liquid; set aside.\r\n\r\nMelt butter in a large saucepan over medium heat. Add leeks; cook, stirring occasionally, until soft but not browned, 10 to 15 minutes. Stir in flour; cook 2 minutes. Add sherry; whisk until smooth. Whisk in stock, thyme, and reserved soaking liquid; bring to a boil. Reduce heat; simmer 5 minutes. Stir in dried and fresh mushrooms. Remove from heat.\r\n\r\nPour into a large bowl. Working in 3 batches, puree soup in a food processor, making sure there are no remaining mushroom pieces; return to pan. Bring to a simmer; cook, stirring occasionally, 15 minutes. Season with salt and pepper.\r\n\r\nStir in cream; bring just to a simmer. Season with salt. Stir in milk; cook until just heated through. Serve immediately, or refrigerate, covered, up to 3 days; reheat before serving. To serve, divide among bowls; spoon about 2 teaspoons chervil cream into each center, and sprinkle with croutons.",
        "ingredients": [
            "3\/4 cup dried Polish or porcini mushrooms (about 3\/4 ounce)\r",
            "6 tablespoon unsalted butter\r",
            "3 medium leeks (about 1 pound), white and pale-green parts only, finely chopped and rinsed well\r",
            "6 tablespoon all-purpose flour\r",
            "3\/4 cup medium sherry, such as amontillado\r",
            "5 cup homemade or low-sodium store-bought chicken stock\r",
            "1\/2 teaspoon finely chopped fresh thyme\r",
            "2 pound cremini mushrooms\r",
            "Coarse salt and freshly ground pepper\r",
            "1 cup heavy cream\r",
            "1 cup whole milk\r",
            "2 servings [Chervil Cream](http:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=id140)",
            "homemade croutons, for serving"
        ],
        "tags": [
            "mushroom",
            "main",
            "soup",
            "untried"
        ]
    },
    "id142": {
        "id": "id142",
        "name": "Harvest pumpkin soup",
        "source": "http:\/\/www.marthastewart.com\/336654\/harvest-pumpkin-soup?center=0&gallery=274637&slide=283054",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 8,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat oven to 400 degrees. Place pumpkin halves, cut sides down, on a rimmed baking sheet. Bake until soft, about 50 minutes. Scoop out flesh, and puree in a food processor (you should have 2 cups).\r\nMelt 1 tablespoon butter in a small saucepan over medium-high heat. Add reserved seeds and fibers from pumpkin, and cook for 4 minutes. Add stock, water, and thyme, and bring to a gentle simmer. Cook for 9 to 10 minutes.\r\n\r\nMeanwhile, melt remaining 5 tablespoons butter in a large saucepan over medium-high heat. Add pumpkin puree, parsnip, potato, and turnip, and cook for 5 minutes. Add shallots, and cook until soft, about 4 minutes. Add wine, and cook until liquid has reduced by half.\r\n\r\nStrain pumpkin-seed mixture, reserving broth and discarding solids. Add broth to pumpkin-wine mixture. Bring to a simmer; cook 20 minutes. Let cool.\r\n\r\nPass soup through a food mill into a clean saucepan, or puree in a food processor in small batches until smooth. (If soup does not reach desired consistency using a food processor, press it through a fine sieve to remove any remaining lumps.) Heat soup in a saucepan over medium-high heat. Stir in cream, sugar, salt, and pepper, and serve",
        "ingredients": [
            "1 small sugar pumpkin, halved, seeds and stringy fibers removed and reserved\r",
            "6 tablespoon unsalted butter\r",
            "3 cup homemade or low-sodium store-bought chicken stock\r",
            "3 cup water\r",
            "1 sprig fresh thyme\r",
            "1 small parsnip (about 4 ounces), peeled and coarsely chopped\r",
            "1 small Yukon gold potato (about 6 ounces), peeled and coarsely chopped\r",
            "1 small turnip (about 4 ounces), peeled and coarsely chopped\r",
            "2 small shallots, minced (about 1\/4 cup)\r",
            "1\/2 cup dry white wine\r",
            "3 tablespoon heavy cream\r",
            "1 teaspoon packed light-brown sugar\r",
            "2 teaspoon coarse salt\r",
            "Freshly ground pepper, to taste"
        ],
        "tags": [
            "pumpkin",
            "soup",
            "main",
            "untried"
        ]
    },
    "id144": {
        "id": "id144",
        "name": "Lighter macaroni and cheese",
        "source": "http:\/\/www.marthastewart.com\/350258\/lighter-macaroni-and-cheese?czone=food\/comfort-foods-center\/comfort-foods-dishes&lnc=c479cf380e1dd010VgnVCM1000005b09a00aRCRD&rsc=foodpromo_Homepage_Homepage_p1&center=854190&gallery=274953&slide=174814",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 8,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat oven to 400 degrees. Spread tomatoes in a single layer on 2 rimmed baking sheets. Drizzle each sheet with 1 tablespoon oil; sprinkle each with 1\/2 teaspoon thyme, and season with salt and pepper. Bake until tomatoes have softened, about 20 minutes. (Leave oven on.)\r\n\r\nProcess bread in a food processor until coarse crumbs form. Melt 1 tablespoon butter with remaining tablespoon oil in amedium skillet over medium heat. Add breadcrumbs, and toss to coat. Season with salt and pepper; set aside.\r\n\r\nBring a large pot of water to a boil over high heat. Add 1 tablespoon salt and the pasta. Cook pasta until almost al dente, about 5 minutes. Drain, and run under cold water to stop cooking. Transfer to a large bowl; set aside.\r\n\r\nWhisk 1\/2 cup stock into the flour in a medium bowl; set aside. Melt remaining tablespoon butter in a medium saucepan over medium heat. Stir in nutmeg, cayenne, remaining 1\/2 teaspoon thyme, and 1 teaspoon salt. Add milk and remaining 1 1\/2 cups stock. Whisk in flour mixture. Bring to a boil, whisking frequently. Reduce to a simmer. Cook 8 minutes, whisking frequently. Add cheeses; cook, stirring, until melted. Pour over macaroni, stirring to combine.\r\n\r\nPut eight 4 1\/2-by-1 1\/4-inch ramekins on a baking sheet. Put 2 tomato slices in bottom of each ramekin. Divide macaroni mixture evenly among ramekins. Top each with a tomato slice. Sprinkle with breadcrumbs and thyme sprigs. Bake until bubbling and golden brown, about 30 minutes. Serve immediately.",
        "ingredients": [
            "6 small vine-ripened tomatoes, cut into 24 1\/4-inch-thick slices\r",
            "3 tablespoon extra-virgin olive oil\r",
            "1 1\/2 teaspoon fresh thyme leaves, plus sprigs for sprinkling\r",
            "Coarse salt and freshly ground pepper\r",
            "5 slices white sandwich bread, with crust\r",
            "2 tablespoon unsalted butter\r",
            "1 pound elbow macaroni\r",
            "2 cup low-sodium chicken stock\r",
            "5 tablespoon all-purpose flour\r",
            "1 pinch freshly grated nutmeg\r",
            "1 pinch cayenne pepper\r",
            "2 cup low-fat (1 percent) milk\r",
            "2 1\/4 cup extra-sharp cheddar cheese, grated\r",
            "1\/2 cup Parmesan cheese, freshly grated"
        ],
        "tags": [
            "cheese",
            "pasta",
            "main",
            "untried"
        ]
    },
    "id145": {
        "id": "id145",
        "name": "Chocolate cheesecake squares",
        "source": "http:\/\/www.marthastewart.com\/316201\/chocolate-cheesecake-squares?center=854190&gallery=274953&slide=259557",
        "preptime": 900,
        "waittime": 3600,
        "cooktime": 2100,
        "servings": 9,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat oven to 325 degrees. Coat an 8-inch square baking pan with cooking spray. Line with two crisscrossed pieces of parchment or wax paper, spraying between sheets. Spray lined pan; set aside.\r\n\r\nProcess cookies in a food processor until finely ground. Gently press crumbs into bottom of prepared pan (do not rinse processor bowl).\r\n\r\nBlend cream cheese and sour cream in food processor until smooth, scraping down sides of bowl as needed. Add cocoa, cornstarch, sugar, egg, and egg white; process until smooth. Pour into pan; sprinkle with chocolate chips.\r\n\r\nBake until just set, 35 to 40 minutes; cool completely in pan. Refrigerate at least 1 hour. Invert onto a tray; peel off paper, and reinvert crust side down. Cut into 9 squares.",
        "ingredients": [
            "Nonstick cooking spray\r",
            "8 chocolate wafer cookies\r",
            "1 bar (8 ounces) reduced-fat cream cheese\r",
            "1 cup reduced-fat sour cream\r",
            "1\/3 cup unsweetened cocoa powder\r",
            "2 tablespoon cornstarch\r",
            "3\/4 cup sugar\r",
            "1 large whole egg, plus 1 large egg white\r",
            "1\/3 cup semisweet chocolate chips"
        ],
        "tags": [
            "cheesecake",
            "dessert",
            "chocolate",
            "untried"
        ]
    },
    "id146": {
        "id": "id146",
        "name": "Chocolate cinnamon pudding",
        "source": "http:\/\/www.marthastewart.com\/354105\/lighter-chocolate-cinnamon-pudding?czone=food\/comfort-foods-center\/comfort-foods-dishes&center=854190&gallery=274953&slide=257366",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 6,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Whisk cornstarch, sugar, cocoa powder, cinnamon, and salt in a medium saucepan. Add milks, whisking. Bring to a boil over medium-high heat, whisking constantly. Cook until thickened, about 1 minute. Whisk in chocolate; cook until chocolate has melted, about 1 minute.\r\n\r\nDivide evenly among six 4-ounce cups. To prevent a skin from forming, press plastic wrap onto surface of pudding. Refrigerate until set, at least 1 hour and up to overnight. Serve garnished with chocolate shavings and cinnamon sticks.",
        "ingredients": [
            "3 tablespoon cornstarch\r",
            "6 tablespoon light-brown sugar\r",
            "3 tablespoon unsweetened Dutch-process cocoa powder\r",
            "1\/2 teaspoon ground cinnamon\r",
            "1\/4 teaspoon salt\r",
            "2 1\/2 cup skim milk\r",
            "1\/2 cup evaporated skim milk\r",
            "4 ounce bittersweet chocolate\r",
            "White- and milk-chocolate, shavings, for garnish\r",
            "Cinnamon sticks, for garnish"
        ],
        "tags": [
            "chocolate",
            "pudding",
            "dessert",
            "untried"
        ]
    },
    "id147": {
        "id": "id147",
        "name": "Creepy crawly cake",
        "source": "Martha Stewart Living Oct 2011",
        "preptime": 2400,
        "waittime": 3300,
        "cooktime": 1500,
        "servings": 8,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Preheat oven to 350F. Make the cake: Coat two 9-inch cake pans with cooking spray. Line bottoms with parchment, and coat with spray. Dust with all-purpose flour, tapping out excess. Whisk together flours, baking soda, and 3\/4 teaspoon salt.\r\n2. Beat butter and sugar with a mixer on medium0high speed until pale and fluffy. Add eggs, 1 at a time, beating well after each addition. Beat in vanilla. Reduce speed to low. Beat in flour mixture in 3 additions, alternating with buttermilk, beginning and ending with flour. Beat in melted chocolate. Divide batter between pans, and smooth tops using an offset spatula.\r\n3. Bake cakes until a toothpick inserted into the centers comes out clean, 25 to 30 minutes. Turn out cakes onto racks, remove parchment, and let cool completely.\r\n4. Make the ganache: Bring cream to a gentle simmer in a small saucepan over medium-high heat. Pour over chopped chocolates and butter in a bowl. Let stand for 5 minutes. Whisk until smooth and shiny. Let stand until thickened, about 40 minutes. Transfer 1 3\/4 cups ganache to a bowl, and fold in malt balls; reserve remaining ganache.\r\n5. Transfer 1 cake to a serving platter (top side up). Spread ganache-malt ball filling on top, and top with remaining cake (top side up). Refrigerated until set, about 15 minutes. Cut a large wedge from cake to serve on another plate. Pour remaining ganache (reheat if necessary) over cake and wedge, and let drip down sides and into cut center of cake. Garnish cake and platter with rubber cockroaches.\r\n\r\nStorage: Decorated cake can be refrigerated for up to 3 days, but the ganache with not be as shiny,. Bring to room temperature before serving.",
        "ingredients": [
            "Vegetable oil cooking spray\r",
            "1 cup all-purpose flour, plus more for pans\r",
            "1 cup cake flour, not self rising\r",
            "1 tsp baking soda\r",
            "Salt\r",
            "1 3\/4 stick unsalted butter, 14 tablespoons total, room temperature\r",
            "1 1\/3 cup sugar\r",
            "3 large eggs\r",
            "1 1\/2 tsp pure vanilla extract\r",
            "1 cup low-fat buttermilk\r",
            "5 ounce semisweet chocolate, melted and cooled\r",
            "<hr>\r",
            "2 cup heavy cream\r",
            "8 oz semisweet chocolate, chopped\r",
            "8 oz bittersweet chocolate, chopped\r",
            "1 tbsp unsalted butter\r",
            "1 1\/2 cup chocolate malt balls, coarsely chopped\r",
            "garnish, rubber cockroaches (fakebugs.com)"
        ],
        "tags": [
            "cake",
            "halloween",
            "dessert",
            "chocolate",
            "untried"
        ]
    },
    "id148": {
        "id": "id148",
        "name": "Blood orange cocktails",
        "source": "Martha Stewart Living Oct 2011",
        "preptime": 600,
        "waittime": 1800,
        "cooktime": 0,
        "servings": 6,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Combine blood orange juice and liqueur in a large pitcher. Refrigerate for at least 30 minutes. Pour into test tubes (indigo.com) or small glasses.\r\n\r\nMake ahead: Cocktails can be refrigerated in pitcher overnight. Stir before using.",
        "ingredients": [
            "1 1\/2 cup fresh blood orange juice, from 7-8 blood oranges, chilled\r",
            "6 tablespoon Solerno or other blood orange liqueur"
        ],
        "tags": [
            "drink",
            "alcohol",
            "halloween",
            "untried"
        ]
    },
    "id150": {
        "id": "id150",
        "name": "Japanese style grilled salmon",
        "source": "http:\/\/www.foodnetwork.com\/recipes\/cooking-live\/japanese-style-grilled-salmon-recipe\/index.html",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Season salmon with salt and set aside.\r\n\r\nCombine marinade ingredients, except lemon slices, in a small saucepan and bring to a boil. Remove from heat and allow to cool to room temperature. Add lemon and pour cooled marinade over fish and marinate refrigerated for 2 to 4 hours. Turn fish occasionally.\r\n\r\nTo serve: Grill or broil on both sides until just done, approximately 4 to 5 minutes per side. Be careful not to overcook. Salmon should still be translucent in the center. Serve with Soba Noodle Salad on the side.",
        "ingredients": [
            "4 (5-ounce) salmon fillets\r",
            "1\/2 teaspoon salt\r",
            "<hr>\r",
            "1\/4 cup soy sauce\r",
            "1\/4 cup sake or dry white wine, sake is preferred\r",
            "1\/4 cup mirin\r",
            "2 tablespoon sugar\r",
            "2 green onions, chopped\r",
            "3 tablespoon ginger, chopped\r",
            "1 small lemon, thinly sliced\r",
            "4 servings [Soba Noodle Salad](http:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=id255)"
        ],
        "tags": [
            "salmon",
            "japanese",
            "main"
        ]
    },
    "id151": {
        "id": "id151",
        "name": "Dang cold Asian noodle salad",
        "source": "http:\/\/www.foodnetwork.com\/recipes\/guy-fieri\/dang-cold-asian-noodle-salad-recipe\/index.html",
        "preptime": 1200,
        "waittime": 0,
        "cooktime": 900,
        "servings": 4,
        "comments": "",
        "calories": 2362,
        "fat": 113,
        "satfat": 16,
        "carbs": 300,
        "fiber": 14,
        "sugar": 17,
        "protein": 72,
        "instructions": "In a medium stock pot, boil water, add salt and cook noodles. When finished, place noodles in an ice water bath to cool. Drain and set aside.\r\n\r\nIn a medium bowl combine, sesame oil, vinegar, soy sauce, hot chili oil, hoisin and extra-virgin olive oil. Mix thoroughly and then combine prepared vegetables and noodles.\r\n\r\nGarnish with sesame seeds and peanuts.",
        "ingredients": [
            "12 oz soba noodles\r",
            "1 tsp sesame oil\r",
            "1 tsp hot chili oil\r",
            "1 tbsp hoisin sauce\r",
            "2 tbsp rice wine vinegar\r",
            "3 tbsp soy sauce\r",
            "5 tbsp extra-virgin olive oil\r",
            "<hr>\r",
            "1 carrot, thinly sliced or julienned\r",
            "2 stalk celery, thinly sliced or julienned\r",
            "5 green onions, bottom 4 inches, thinly sliced\r",
            "1 cup thinly sliced napa cabbage\r",
            "1\/2 red bell pepper, thinly sliced or julienned\r",
            "3 tablespoon cilantro, minced\r",
            "3 tablespoon sesame seeds, toasted, for garnish\r",
            "4 tablespoon unsalted peanuts, for garnish"
        ],
        "tags": [
            "soba",
            "noodle",
            "salad",
            "main"
        ]
    }
}